{
  "October 2023": [
    {
      "number": 449,
      "summary": "Remove old rating display components to clean up the codebase and improve maintainability. This pull request deletes unused code related to displaying ratings, streamlining the project for easier future updates and enhancements.",
      "url": "https://github.com/terror/mcgill.courses/pull/449",
      "merged_at": "2023-10-23T21:29:44Z"
    },
    {
      "number": 448,
      "summary": "Ensure that the histogram display remains correctly aligned within the background on all screen sizes by fixing an issue causing it to overflow.",
      "url": "https://github.com/terror/mcgill.courses/pull/448",
      "merged_at": "2023-10-17T02:48:22Z"
    },
    {
      "number": 447,
      "summary": "Simplify the process for merging courses in the loader for improved efficiency and easier navigation.",
      "url": "https://github.com/terror/mcgill.courses/pull/447",
      "merged_at": "2023-10-16T19:25:50Z"
    },
    {
      "number": 446,
      "summary": "Exclude test samples used by extractors from showing up in the code report to improve the accuracy of code analysis.",
      "url": "https://github.com/terror/mcgill.courses/pull/446",
      "merged_at": "2023-10-16T05:20:40Z"
    },
    {
      "number": 440,
      "summary": "Allow instructors to utilize the full-text search functionality to easily explore and navigate course content more efficiently. This enhancement will enable instructors to find relevant information quickly and improve their teaching experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/440",
      "merged_at": "2023-10-16T05:13:16Z"
    },
    {
      "number": 445,
      "summary": "Switch to using type-only import in order to ensure that TypeScript completely erases it at runtime.",
      "url": "https://github.com/terror/mcgill.courses/pull/445",
      "merged_at": "2023-10-16T05:03:10Z"
    },
    {
      "number": 444,
      "summary": "Introducing a basic error boundary to enhance error handling in the application. This addition will help catch and display errors more gracefully, ensuring a smoother user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/444",
      "merged_at": "2023-10-16T04:59:22Z"
    },
    {
      "number": 443,
      "summary": "Fixes the issue with the reset button not being properly positioned when using absolute positioning. This pull request addresses the problem and ensures that the reset button is correctly aligned on the page.",
      "url": "https://github.com/terror/mcgill.courses/pull/443",
      "merged_at": "2023-10-11T02:47:17Z"
    },
    {
      "number": 439,
      "summary": "Sort reviews by date on instructor page to ensure that the most recent feedback is displayed first. This change will allow instructors to easily keep track of the latest reviews and prioritize their responses accordingly.",
      "url": "https://github.com/terror/mcgill.courses/pull/439",
      "merged_at": "2023-10-07T04:16:48Z"
    },
    {
      "number": 421,
      "summary": "Enable full-text search capability on the explore page to make it easier for users to find relevant content by searching through titles, descriptions, and tags. This feature enhances the user experience and improves the efficiency of navigating and locating specific information within the explore page.",
      "url": "https://github.com/terror/mcgill.courses/pull/421",
      "merged_at": "2023-10-02T17:27:15Z"
    }
  ],
  "February 2024": [
    {
      "number": 488,
      "summary": "Optimized frontend to batch review interactions in a single request per course instead of individual queries for each review card. Introduces a new endpoint for querying interactions within a specific course. This improvement enhances performance and reduces unnecessary requests.",
      "url": "https://github.com/terror/mcgill.courses/pull/488",
      "merged_at": "2024-02-05T04:27:12Z"
    }
  ],
  "April 2023": [
    {
      "number": 130,
      "summary": "Improve the parsing of schedule data in the application to ensure accurate and consistent display of upcoming events.",
      "url": "https://github.com/terror/mcgill.courses/pull/130",
      "merged_at": "2023-04-30T19:21:00Z"
    },
    {
      "number": 131,
      "summary": "This pull request converts the review add/edit functionality into dialog boxes, allowing users to easily add or edit reviews without navigating away from the main page. This change improves the user experience by providing a more seamless and visually appealing way to interact with review content.",
      "url": "https://github.com/terror/mcgill.courses/pull/131",
      "merged_at": "2023-04-28T22:16:30Z"
    },
    {
      "number": 129,
      "summary": "Replace broken image link in the project's readme file with a working image link. This update ensures that users can view the correct image when accessing the project documentation.",
      "url": "https://github.com/terror/mcgill.courses/pull/129",
      "merged_at": "2023-04-28T20:59:45Z"
    },
    {
      "number": 128,
      "summary": "Enhanced search feature to provide more accurate and relevant results based on user queries.Implemented algorithm modifications to increase search efficiency and optimize search results display.",
      "url": "https://github.com/terror/mcgill.courses/pull/128",
      "merged_at": "2023-04-28T20:32:31Z"
    },
    {
      "number": 127,
      "summary": "Introducing dark mode to provide users with the option to switch to a darker color scheme for improved visibility and reduced eye strain when using the app. This feature allows users to toggle between light and dark modes seamlessly, enhancing overall user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/127",
      "merged_at": "2023-04-28T19:47:27Z"
    },
    {
      "number": 126,
      "summary": "Prevent users with non-McGill email addresses from logging into the system for enhanced security.",
      "url": "https://github.com/terror/mcgill.courses/pull/126",
      "merged_at": "2023-04-26T19:50:01Z"
    },
    {
      "number": 124,
      "summary": "Update the system to use BSON-formatted timestamps for improved data handling and interoperability.",
      "url": "https://github.com/terror/mcgill.courses/pull/124",
      "merged_at": "2023-04-18T02:02:22Z"
    },
    {
      "number": 122,
      "summary": "Ensure proper formatting of Tailwind CSS classes by incorporating the Prettier plugin specifically designed for Tailwind CSS. This update aims to enhance the clarity and readability of Tailwind CSS code.",
      "url": "https://github.com/terror/mcgill.courses/pull/122",
      "merged_at": "2023-04-17T18:34:38Z"
    },
    {
      "number": 121,
      "summary": "Enhance the search feature to underline text that matches the search query, making it easier for users to quickly identify relevant results. This visual cue improves the user experience and helps streamline the information retrieval process.",
      "url": "https://github.com/terror/mcgill.courses/pull/121",
      "merged_at": "2023-04-10T02:35:49Z"
    },
    {
      "number": 114,
      "summary": "Introduces a new feature to allow users to explore and select icons from a library within the application. This enhancement aims to provide users with a wider range of visual elements to customize their designs more easily and efficiently.",
      "url": "https://github.com/terror/mcgill.courses/pull/114",
      "merged_at": "2023-04-09T22:24:02Z"
    },
    {
      "number": 113,
      "summary": "Redirect the user to the edit page if a review already exists for a client, improving the user experience and streamlining the workflow for managing reviews.",
      "url": "https://github.com/terror/mcgill.courses/pull/113",
      "merged_at": "2023-04-09T22:19:59Z"
    },
    {
      "number": 110,
      "summary": "Improve the accessibility of course URLs by adding a blank target attribute to ensure that links open in a new tab, providing a better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/110",
      "merged_at": "2023-04-09T02:53:56Z"
    },
    {
      "number": 101,
      "summary": "Introducing an alert notification box for displaying errors on the client-side, replacing console.err messages with a more user-friendly option. This pull request includes a prototype and formatted code for implementation.",
      "url": "https://github.com/terror/mcgill.courses/pull/101",
      "merged_at": "2023-04-09T00:01:38Z"
    },
    {
      "number": 73,
      "summary": "Introduce course reviews feature on the course page to allow users to share feedback and ratings. This pull request modifies the existing course page to include a dedicated section for reviews, enhancing user engagement and providing valuable insights for potential learners.",
      "url": "https://github.com/terror/mcgill.courses/pull/73",
      "merged_at": "2023-04-08T23:47:47Z"
    },
    {
      "number": 103,
      "summary": "Create a simple prototype of an about page to serve as a placeholder before deployment.",
      "url": "https://github.com/terror/mcgill.courses/pull/103",
      "merged_at": "2023-04-08T20:59:39Z"
    },
    {
      "number": 102,
      "summary": "Ensure that courses with the same ID in the database are updated correctly. This pull request allows for seamless updating of course information in the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/102",
      "merged_at": "2023-04-05T04:30:20Z"
    },
    {
      "number": 100,
      "summary": "Refactors and fixes issues on the course page to enhance user experience and improve functionality. The changes include updating layout design, fixing broken links, and optimizing loading speed.",
      "url": "https://github.com/terror/mcgill.courses/pull/100",
      "merged_at": "2023-04-04T20:09:52Z"
    },
    {
      "number": 99,
      "summary": "Improve navigation on non-home pages by adding a centered search bar to the nav bar and moving navigation buttons to the right for easier access and improved user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/99",
      "merged_at": "2023-04-04T13:13:18Z"
    },
    {
      "number": 95,
      "summary": "Prevent loading duplicate courses in the application after the extraction process to enhance efficiency and avoid redundancy.",
      "url": "https://github.com/terror/mcgill.courses/pull/95",
      "merged_at": "2023-04-02T20:04:19Z"
    },
    {
      "number": 94,
      "summary": "Refine the course extraction process to exclude options that are not offered, ensuring only available courses are displayed to users.",
      "url": "https://github.com/terror/mcgill.courses/pull/94",
      "merged_at": "2023-04-02T20:03:33Z"
    },
    {
      "number": 93,
      "summary": "Update the course page layout to incorporate new design elements and improve user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/93",
      "merged_at": "2023-04-02T17:02:50Z"
    },
    {
      "number": 92,
      "summary": "Improve search functionality with a sleeker design and enhanced user experience. This update refines the search feature by introducing new styling and optimizations for better performance.",
      "url": "https://github.com/terror/mcgill.courses/pull/92",
      "merged_at": "2023-04-02T02:15:11Z"
    },
    {
      "number": 91,
      "summary": "Implement a review form feature to gather feedback from users. This pull request introduces a new form component that allows users to submit their reviews seamlessly. Additionally, the pull request also includes styling adjustments to enhance the overall user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/91",
      "merged_at": "2023-04-02T01:22:36Z"
    },
    {
      "number": 86,
      "summary": "Enhance the review model by adding more fields such as course ID, instructor name, and timestamp, allowing for more detailed and organized review information.",
      "url": "https://github.com/terror/mcgill.courses/pull/86",
      "merged_at": "2023-04-02T01:21:34Z"
    },
    {
      "number": 84,
      "summary": "Improve clarity in test functions by updating their names to more accurately reflect their purpose and contents. This enhancement will help developers better understand the intent of each test and make the testing process more efficient.",
      "url": "https://github.com/terror/mcgill.courses/pull/84",
      "merged_at": "2023-04-01T19:22:33Z"
    },
    {
      "number": 83,
      "summary": "Improve profile icon styling by removing the ring and adjusting the hover color for consistency with the search bar.",
      "url": "https://github.com/terror/mcgill.courses/pull/83",
      "merged_at": "2023-04-01T19:20:54Z"
    },
    {
      "number": 82,
      "summary": "Add arrow-key navigation for the search bar results, allowing users to easily navigate through search results. Note that the 'explore all courses' rectangle is currently excluded from navigation.",
      "url": "https://github.com/terror/mcgill.courses/pull/82",
      "merged_at": "2023-04-01T19:11:04Z"
    }
  ],
  "September 2023": [
    {
      "number": 436,
      "summary": "Refactored the content structure of the about page for improved readability and user experience. This PR reorganized the information to make it more clear and concise, ensuring easier navigation and understanding for visitors.",
      "url": "https://github.com/terror/mcgill.courses/pull/436",
      "merged_at": "2023-09-29T16:52:41Z"
    },
    {
      "number": 437,
      "summary": "Enhance the user experience by adding loading skeletons to the explore page, giving users a visual indication of where content will appear while the page is loading. This change aims to reduce confusion and improve overall usability when browsing the explore page.",
      "url": "https://github.com/terror/mcgill.courses/pull/437",
      "merged_at": "2023-09-29T16:51:35Z"
    },
    {
      "number": 434,
      "summary": "Introducing a content label for easier organization and evenly spacing margins on the review card for a cleaner look.",
      "url": "https://github.com/terror/mcgill.courses/pull/434",
      "merged_at": "2023-09-27T18:35:46Z"
    },
    {
      "number": 432,
      "summary": "Add a feature to allow users to directly link to their course page on their profile when subscribing. This change enhances user experience by providing easier access to course details for other users.",
      "url": "https://github.com/terror/mcgill.courses/pull/432",
      "merged_at": "2023-09-27T17:13:31Z"
    },
    {
      "number": 431,
      "summary": "Update the color of the notification dot to red for increased visibility and emphasis.",
      "url": "https://github.com/terror/mcgill.courses/pull/431",
      "merged_at": "2023-09-27T03:08:04Z"
    },
    {
      "number": 426,
      "summary": "Improve styling for explore filter on the website to enhance user experience and aesthetics.",
      "url": "https://github.com/terror/mcgill.courses/pull/426",
      "merged_at": "2023-09-26T04:10:42Z"
    },
    {
      "number": 429,
      "summary": "In this pull request, Google Analytics tracking code has been added to the website to gather data on visitor behavior and analyze traffic patterns. This change will provide valuable insights into user interactions and help improve the overall performance and effectiveness of the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/429",
      "merged_at": "2023-09-26T03:43:03Z"
    },
    {
      "number": 371,
      "summary": "Introducing a notification system to keep users informed about new course reviews. Now, users will receive alerts when new reviews are posted for courses they follow, enhancing their overall experience on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/371",
      "merged_at": "2023-09-26T02:53:18Z"
    },
    {
      "number": 428,
      "summary": "Switching from npm to pnpm in the Dockerfile for package management to improve performance and reduce disk space usage.",
      "url": "https://github.com/terror/mcgill.courses/pull/428",
      "merged_at": "2023-09-25T18:40:48Z"
    },
    {
      "number": 427,
      "summary": "Switching to pnpm package manager for faster and more efficient dependency management. Updating packages to the latest versions for improved performance and security.",
      "url": "https://github.com/terror/mcgill.courses/pull/427",
      "merged_at": "2023-09-25T18:01:23Z"
    },
    {
      "number": 425,
      "summary": "Fix issue with squished bird image on the website by adjusting the size and position for better visibility and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/425",
      "merged_at": "2023-09-23T17:27:53Z"
    },
    {
      "number": 424,
      "summary": "Add an interactive tooltip displaying the date on review cards for better context and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/424",
      "merged_at": "2023-09-22T20:26:07Z"
    },
    {
      "number": 422,
      "summary": "Display a histogram on smaller screens to improve data visualization and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/422",
      "merged_at": "2023-09-22T20:25:38Z"
    },
    {
      "number": 419,
      "summary": "Enhance the visual styling of the explore filter to improve user experience and make it more intuitive and appealing. This pull request includes updated design elements and layout adjustments for a cleaner and more organized look.",
      "url": "https://github.com/terror/mcgill.courses/pull/419",
      "merged_at": "2023-09-21T03:02:44Z"
    },
    {
      "number": 416,
      "summary": "Replace the current toast notifications library with Sonner Toast for improved user alert messages.",
      "url": "https://github.com/terror/mcgill.courses/pull/416",
      "merged_at": "2023-09-16T17:44:14Z"
    },
    {
      "number": 418,
      "summary": "Update the Docker image used to run the Rust application to version 1.70 for better compatibility and performance.",
      "url": "https://github.com/terror/mcgill.courses/pull/418",
      "merged_at": "2023-09-16T15:33:35Z"
    },
    {
      "number": 417,
      "summary": "Enhance user experience by displaying a toast notification when saving review drafts to provide immediate feedback and improve visibility of draft saving actions.",
      "url": "https://github.com/terror/mcgill.courses/pull/417",
      "merged_at": "2023-09-16T05:59:02Z"
    },
    {
      "number": 415,
      "summary": "Update dependencies to ensure that the project is using the latest versions of third-party libraries, which can improve performance, security, and overall stability of the software.",
      "url": "https://github.com/terror/mcgill.courses/pull/415",
      "merged_at": "2023-09-16T05:17:54Z"
    },
    {
      "number": 414,
      "summary": "Enhance the visual appeal of the footer and course page filters by updating colors for better readability and a more cohesive design aesthetic in light mode.",
      "url": "https://github.com/terror/mcgill.courses/pull/414",
      "merged_at": "2023-09-15T18:50:56Z"
    },
    {
      "number": 412,
      "summary": "Ensure that the schedule display text wraps correctly if it is too long, preventing it from overflowing and improving readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/412",
      "merged_at": "2023-09-15T15:00:04Z"
    },
    {
      "number": 409,
      "summary": "This pull request enhances the user experience by adding an empty state message for the instructor/course page. When there is no content to display, users will now see a clear message guiding them on the next steps. This improvement helps users easily navigate the page and understand the context when there is no data available.",
      "url": "https://github.com/terror/mcgill.courses/pull/409",
      "merged_at": "2023-09-14T04:18:22Z"
    },
    {
      "number": 411,
      "summary": "Improve the display of the reviews on the instructor page by fixing layout issues and ensuring better readability for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/411",
      "merged_at": "2023-09-14T04:15:39Z"
    },
    {
      "number": 406,
      "summary": "Update course data for the 2022-2023 academic year by removing unnecessary schedule information and adding new field for program connections. Fixes issue #334.",
      "url": "https://github.com/terror/mcgill.courses/pull/406",
      "merged_at": "2023-09-10T16:47:43Z"
    },
    {
      "number": 405,
      "summary": "Ensure a consistent design by rounding the bottom border of the last course review displayed on the page. This change enhances the visual appeal and overall user experience of the course reviews section.",
      "url": "https://github.com/terror/mcgill.courses/pull/405",
      "merged_at": "2023-09-10T16:31:48Z"
    },
    {
      "number": 404,
      "summary": "Update course page image in readme to refresh the visual representation of the project and provide a more accurate preview for users and visitors.",
      "url": "https://github.com/terror/mcgill.courses/pull/404",
      "merged_at": "2023-09-10T16:05:29Z"
    },
    {
      "number": 403,
      "summary": "This pull request removes the background color of the FAQ section on the about page, resulting in a cleaner and more streamlined appearance for the FAQ content.",
      "url": "https://github.com/terror/mcgill.courses/pull/403",
      "merged_at": "2023-09-10T15:54:02Z"
    },
    {
      "number": 402,
      "summary": "Enhance user experience by adding a pin icon to user reviews for easier access and identification.",
      "url": "https://github.com/terror/mcgill.courses/pull/402",
      "merged_at": "2023-09-10T04:06:17Z"
    },
    {
      "number": 401,
      "summary": "Update icons used for rating and difficulty in the review form to improve visual appeal and enhance user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/401",
      "merged_at": "2023-09-10T04:03:15Z"
    },
    {
      "number": 398,
      "summary": "Increase the brightness and enhance the visibility of light colors throughout the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/398",
      "merged_at": "2023-09-09T20:13:57Z"
    },
    {
      "number": 400,
      "summary": "Update the design of the instructor page to align with the style of the course page. This includes adjusting layout, color scheme, and font styles for a more cohesive look throughout the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/400",
      "merged_at": "2023-09-09T20:12:06Z"
    },
    {
      "number": 399,
      "summary": "Corrected a spelling mistake in the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/399",
      "merged_at": "2023-09-07T15:03:40Z"
    },
    {
      "number": 397,
      "summary": "Show the review card course more prominently on the instructor page to increase visibility and engagement.",
      "url": "https://github.com/terror/mcgill.courses/pull/397",
      "merged_at": "2023-09-06T15:38:53Z"
    },
    {
      "number": 396,
      "summary": "Ensure that the fillbar fills completely and evenly when it reaches its maximum capacity.",
      "url": "https://github.com/terror/mcgill.courses/pull/396",
      "merged_at": "2023-09-04T21:52:08Z"
    },
    {
      "number": 395,
      "summary": "Improve the functionality of updating statistics when changing the professor in review filter, ensuring that the data accurately reflects the selected criteria.",
      "url": "https://github.com/terror/mcgill.courses/pull/395",
      "merged_at": "2023-09-04T21:51:08Z"
    },
    {
      "number": 394,
      "summary": "Ensure that the graph in the application updates correctly when review forms are toggled on and off, preventing any discrepancies or errors in the displayed data.",
      "url": "https://github.com/terror/mcgill.courses/pull/394",
      "merged_at": "2023-09-04T19:56:39Z"
    },
    {
      "number": 391,
      "summary": "Enhance the user experience by adding tooltips that display review counts when hovering over histograms, providing valuable insights at a glance for better data interpretation.",
      "url": "https://github.com/terror/mcgill.courses/pull/391",
      "merged_at": "2023-09-04T19:49:45Z"
    },
    {
      "number": 374,
      "summary": "Update the course requirements for MATH 478 to accurately reflect the prerequisites and course content.",
      "url": "https://github.com/terror/mcgill.courses/pull/374",
      "merged_at": "2023-09-04T02:32:01Z"
    },
    {
      "number": 366,
      "summary": "Revamp the user interface of the course information page with a more modern design, improved layout, and enhanced user experience. Update colors, fonts, and spacing for a cleaner and more visually appealing look.",
      "url": "https://github.com/terror/mcgill.courses/pull/366",
      "merged_at": "2023-09-04T02:30:42Z"
    }
  ],
  "March 2024": [
    {
      "number": 497,
      "summary": "Ensure that the reset button in the user interface correctly resets the sort order back to the default setting, allowing users to easily revert to the original sorting arrangement with one click.",
      "url": "https://github.com/terror/mcgill.courses/pull/497",
      "merged_at": "2024-03-16T04:09:37Z"
    },
    {
      "number": 494,
      "summary": "Persist the selected pane on the user profile page to improve usability. Now, when navigating away from the page and returning, the previously selected pane will remain active, providing a smoother user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/494",
      "merged_at": "2024-03-11T01:38:25Z"
    },
    {
      "number": 493,
      "summary": "Increase the readability and design coherence of the explore and profile pages by removing unnecessary horizontal margins. This enhancement will help improve the overall visual appeal and user experience of the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/493",
      "merged_at": "2024-03-11T01:19:23Z"
    },
    {
      "number": 467,
      "summary": "Implement rate limiting to prevent excessive requests and enhance system performance.\n- Introduces a feature that restricts the number of requests a user can make within a specific time frame to prevent abuse and ensure fair usage of resources.\n- Helps maintain system stability and avoid overwhelming the server with an excessive number of requests from a single user.",
      "url": "https://github.com/terror/mcgill.courses/pull/467",
      "merged_at": "2024-03-08T17:11:27Z"
    }
  ],
  "November 2023": [
    {
      "number": 465,
      "summary": "Ensure consistency in design by adjusting the filter text color on the explore page to match other elements for better visual cohesion. Fixes issue #455.",
      "url": "https://github.com/terror/mcgill.courses/pull/465",
      "merged_at": "2023-11-29T17:14:03Z"
    },
    {
      "number": 463,
      "summary": "Introducing a new schedule display feature with improved visuals. Now, users can easily view their course schedules in a more organized and user-friendly format. Enjoy a clearer and more intuitive way to manage your academic timetable.",
      "url": "https://github.com/terror/mcgill.courses/pull/463",
      "merged_at": "2023-11-28T05:36:14Z"
    },
    {
      "number": 461,
      "summary": "Enhance user experience by adding a confirmation dialog before deleting a subscription. This change prevents accidental deletions and provides users with a chance to double-check their actions.",
      "url": "https://github.com/terror/mcgill.courses/pull/461",
      "merged_at": "2023-11-17T20:03:12Z"
    },
    {
      "number": 460,
      "summary": "Update the application to use the complete database URL specified in the environment variables for improved flexibility and consistency. This change ensures that the database connection is correctly established based on the full URL provided.",
      "url": "https://github.com/terror/mcgill.courses/pull/460",
      "merged_at": "2023-11-14T00:19:51Z"
    },
    {
      "number": 450,
      "summary": "Improve the review experience by adding an interaction filter to focus on relevant comments and feedback. This feature helps users easily identify and address important interactions during code reviews.",
      "url": "https://github.com/terror/mcgill.courses/pull/450",
      "merged_at": "2023-11-13T04:07:06Z"
    },
    {
      "number": 453,
      "summary": "Add new filter options on the Explore page to enhance search functionality and improve user experience. Now users can easily narrow down their search results based on different criteria such as category, date, and popularity.",
      "url": "https://github.com/terror/mcgill.courses/pull/453",
      "merged_at": "2023-11-13T03:19:44Z"
    },
    {
      "number": 457,
      "summary": "Decrease the app's bundle size by removing unused dependencies and optimizing code to improve load times and overall performance.",
      "url": "https://github.com/terror/mcgill.courses/pull/457",
      "merged_at": "2023-11-13T03:14:43Z"
    },
    {
      "number": 454,
      "summary": "Improve course search speed by switching to frontend FlexSearch instead of backend requests. This change makes the search process faster and more efficient for users on the main page.",
      "url": "https://github.com/terror/mcgill.courses/pull/454",
      "merged_at": "2023-11-13T01:04:40Z"
    },
    {
      "number": 452,
      "summary": "Limit word count on course descriptions in explore page by restricting string length for course cards to 400 characters. This pull request aims to improve the user experience by preventing overflowing text on course cards in the explore page.",
      "url": "https://github.com/terror/mcgill.courses/pull/452",
      "merged_at": "2023-11-09T04:09:17Z"
    }
  ],
  "May 2023": [
    {
      "number": 252,
      "summary": "Remove the border around user review section to create a cleaner and more modern look.",
      "url": "https://github.com/terror/mcgill.courses/pull/252",
      "merged_at": "2023-05-28T04:16:18Z"
    },
    {
      "number": 251,
      "summary": "Improve database seeding performance by allowing concurrent inserts for faster data population.",
      "url": "https://github.com/terror/mcgill.courses/pull/251",
      "merged_at": "2023-05-28T04:16:10Z"
    },
    {
      "number": 250,
      "summary": "Update the code to import log levels directly to simplify the logging process and improve code readability. This change eliminates the need to reference the log levels through a separate module, making the code more streamlined and easier to maintain.",
      "url": "https://github.com/terror/mcgill.courses/pull/250",
      "merged_at": "2023-05-28T02:18:40Z"
    },
    {
      "number": 248,
      "summary": "Improve sidebar animation by optimizing the timing and easing functions for a smoother user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/248",
      "merged_at": "2023-05-22T01:23:43Z"
    },
    {
      "number": 246,
      "summary": "This pull request updates the web scraping script to retrieve the most recent course information from the e-calendar website.",
      "url": "https://github.com/terror/mcgill.courses/pull/246",
      "merged_at": "2023-05-22T01:17:34Z"
    },
    {
      "number": 247,
      "summary": "Allow instructors to select \"other\" as an option when setting their preferences, providing more flexibility in customization.",
      "url": "https://github.com/terror/mcgill.courses/pull/247",
      "merged_at": "2023-05-22T00:34:07Z"
    },
    {
      "number": 235,
      "summary": "Introducing a new feature to display an instructor page with a screenshot for better course information visualization.",
      "url": "https://github.com/terror/mcgill.courses/pull/235",
      "merged_at": "2023-05-21T18:23:36Z"
    },
    {
      "number": 240,
      "summary": "Introduce course difficulty level feature to improve user experience by allowing users to filter and choose courses based on their preferred difficulty level.",
      "url": "https://github.com/terror/mcgill.courses/pull/240",
      "merged_at": "2023-05-21T16:45:06Z"
    },
    {
      "number": 239,
      "summary": "Limit the number of search results displayed for courses and instructors to improve user experience and navigation on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/239",
      "merged_at": "2023-05-21T05:06:44Z"
    },
    {
      "number": 241,
      "summary": "This pull request addresses a bug that was causing animations to not work properly. It includes fixes to ensure smooth animation transitions throughout the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/241",
      "merged_at": "2023-05-21T04:09:38Z"
    },
    {
      "number": 238,
      "summary": "Enhanced the display animation for the schedule, improving its format and adding a developer recipe in the justfile for easier accessibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/238",
      "merged_at": "2023-05-21T02:10:11Z"
    },
    {
      "number": 237,
      "summary": "Enhances the animation for scheduling display to provide smoother transitions and better visual appeal. Additionally, optimizes the code for improved performance and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/237",
      "merged_at": "2023-05-21T01:54:56Z"
    },
    {
      "number": 236,
      "summary": "Introducing a new development recipe in the justfile to streamline the development process and improve code consistency. This pull request adds a convenient way for developers to manage tasks and automate common development processes effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/236",
      "merged_at": "2023-05-21T01:47:18Z"
    },
    {
      "number": 232,
      "summary": "Improve user experience by fixing issue with autocomplete functionality where clicking an option caused the page to scroll unexpectedly.",
      "url": "https://github.com/terror/mcgill.courses/pull/232",
      "merged_at": "2023-05-21T01:05:47Z"
    },
    {
      "number": 233,
      "summary": "Fixes a bug where the course term filtering on the explore page was not working correctly. This pull request makes adjustments to ensure that users can filter courses by term without any issues.",
      "url": "https://github.com/terror/mcgill.courses/pull/233",
      "merged_at": "2023-05-13T18:13:30Z"
    },
    {
      "number": 234,
      "summary": "Ensure that after a successful login, users are redirected back to the same page they were on before logging in.",
      "url": "https://github.com/terror/mcgill.courses/pull/234",
      "merged_at": "2023-05-13T17:06:27Z"
    },
    {
      "number": 228,
      "summary": "Scaffolded end-to-end (e2e) tests using Cypress framework. Updated the codebase to mock /user route with fixtures and began writing additional test specifications.",
      "url": "https://github.com/terror/mcgill.courses/pull/228",
      "merged_at": "2023-05-13T04:00:25Z"
    },
    {
      "number": 227,
      "summary": "Group and organize course schedule information to make it easier to read and navigate for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/227",
      "merged_at": "2023-05-13T03:24:06Z"
    },
    {
      "number": 229,
      "summary": "Introducing a new \"Show all reviews\" button for easier access to comprehensive feedback on course content. This enhancement allows users to view all reviews at once, facilitating a more efficient browsing experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/229",
      "merged_at": "2023-05-13T02:23:21Z"
    },
    {
      "number": 226,
      "summary": "Sort reviews by date to display the most recent reviews at the top for better visibility and easier access. This change improves user experience by providing quick access to the latest feedback.",
      "url": "https://github.com/terror/mcgill.courses/pull/226",
      "merged_at": "2023-05-10T19:21:51Z"
    },
    {
      "number": 225,
      "summary": "Adjust the bottom margin in the explore filter card to improve spacing and enhance user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/225",
      "merged_at": "2023-05-10T19:12:45Z"
    },
    {
      "number": 220,
      "summary": "Show the path of the data source when populating the database to provide transparency and clarity to users.",
      "url": "https://github.com/terror/mcgill.courses/pull/220",
      "merged_at": "2023-05-10T15:57:59Z"
    },
    {
      "number": 219,
      "summary": "Update the seeding process to interpret review timestamps as seconds for better accuracy and data consistency.",
      "url": "https://github.com/terror/mcgill.courses/pull/219",
      "merged_at": "2023-05-10T15:37:38Z"
    },
    {
      "number": 217,
      "summary": "Update the readme file to provide clearer instructions on how to use the loader, helping users understand and implement it more easily.",
      "url": "https://github.com/terror/mcgill.courses/pull/217",
      "merged_at": "2023-05-10T06:57:50Z"
    },
    {
      "number": 206,
      "summary": "Seed course reviews from external source allows users to automatically import reviews for courses from an external database, providing more comprehensive and diverse feedback for users to make informed decisions. This feature enhances the user experience by increasing the variety and relevancy of course reviews available on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/206",
      "merged_at": "2023-05-10T06:24:59Z"
    },
    {
      "number": 204,
      "summary": "Ensure users have access to updated information on fall and winter schedules for easy planning and organization.",
      "url": "https://github.com/terror/mcgill.courses/pull/204",
      "merged_at": "2023-05-09T23:38:33Z"
    },
    {
      "number": 202,
      "summary": "Improve user experience by displaying \"This course has no prerequisites\" for courses without requirements. Also, add visual indicator for clarity.",
      "url": "https://github.com/terror/mcgill.courses/pull/202",
      "merged_at": "2023-05-09T23:02:44Z"
    },
    {
      "number": 201,
      "summary": "This pull request removes the unnecessary .gitkeep file from the client's public directory, improving the cleanliness of the project structure and aligning with best practices for version control.",
      "url": "https://github.com/terror/mcgill.courses/pull/201",
      "merged_at": "2023-05-09T16:34:06Z"
    },
    {
      "number": 199,
      "summary": "This pull request adds a favicon to the site, enhancing the visual appearance and providing a recognizable icon for the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/199",
      "merged_at": "2023-05-08T23:20:33Z"
    },
    {
      "number": 195,
      "summary": "Improve readability by cutting off long reviews and adjusting formatting. Additional changes may follow for adding avatars and other review criteria in a separate pull request.",
      "url": "https://github.com/terror/mcgill.courses/pull/195",
      "merged_at": "2023-05-08T04:30:31Z"
    },
    {
      "number": 189,
      "summary": "Enable instructors to be included in the search index, allowing users to easily search and find instructors on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/189",
      "merged_at": "2023-05-08T03:56:16Z"
    },
    {
      "number": 192,
      "summary": "Enhance user experience by displaying a clear schedule to clients, making it easier for them to view and manage appointments effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/192",
      "merged_at": "2023-05-08T03:26:03Z"
    },
    {
      "number": 194,
      "summary": "This pull request adds sample review data to the system to help users get started with the platform and better understand its functionality.",
      "url": "https://github.com/terror/mcgill.courses/pull/194",
      "merged_at": "2023-05-08T02:48:10Z"
    },
    {
      "number": 166,
      "summary": "This pull request adds a new feature to the application by implementing a user profile page where users can view and edit their personal information and settings. This provides a more personalized experience for users and enhances the platform's functionality.",
      "url": "https://github.com/terror/mcgill.courses/pull/166",
      "merged_at": "2023-05-07T06:37:24Z"
    },
    {
      "number": 188,
      "summary": "Introduces a clear button for explore filters and adds animation for the filter block. The changes make the feature fully responsive.",
      "url": "https://github.com/terror/mcgill.courses/pull/188",
      "merged_at": "2023-05-07T05:10:38Z"
    },
    {
      "number": 190,
      "summary": "Improve the responsiveness and speed of the course page by making various updates and fixes:\n- Moved navbar items to a footer\n- Updated dependencies\n- Removed unnecessary database references\n- Added tooltips for course term icons\n- Added internal links to course prerequisites and corequisites\n- Pinned current user's review on the course page\n- Corrected error message for review ratings",
      "url": "https://github.com/terror/mcgill.courses/pull/190",
      "merged_at": "2023-05-07T03:23:21Z"
    },
    {
      "number": 183,
      "summary": "Pin user reviews to the top of the course page, removing redundant code and improving the UI by adding links to prerequisite and corequisite information.",
      "url": "https://github.com/terror/mcgill.courses/pull/183",
      "merged_at": "2023-05-07T00:53:15Z"
    },
    {
      "number": 187,
      "summary": "Update the system to include clickable links to prerequisite and corequisite courses, providing easy access to additional course information for students.",
      "url": "https://github.com/terror/mcgill.courses/pull/187",
      "merged_at": "2023-05-07T00:31:32Z"
    },
    {
      "number": 184,
      "summary": "Enhanced the user interface by adding hover effects to course term icons for better visibility and user experience. Made the change to accommodate limited space while also considering implementing it as a tooltip for further flexibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/184",
      "merged_at": "2023-05-07T00:25:16Z"
    },
    {
      "number": 186,
      "summary": "Remove unnecessary references from the code base to improve clarity and simplicity. This change eliminates redundant code and streamlines the `if let` statements for better readability and maintainability.",
      "url": "https://github.com/terror/mcgill.courses/pull/186",
      "merged_at": "2023-05-07T00:11:29Z"
    },
    {
      "number": 185,
      "summary": "Update dependencies to address security vulnerabilities and improve overall performance of the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/185",
      "merged_at": "2023-05-06T18:24:52Z"
    },
    {
      "number": 182,
      "summary": "Move the navigation bar items to the footer for better user experience and code cleanliness. This change also includes code linting for improved code quality.",
      "url": "https://github.com/terror/mcgill.courses/pull/182",
      "merged_at": "2023-05-06T16:51:13Z"
    },
    {
      "number": 181,
      "summary": "Update the website with the latest summer course schedule information for the upcoming 2022-2023 term to help students plan their academic calendar efficiently.",
      "url": "https://github.com/terror/mcgill.courses/pull/181",
      "merged_at": "2023-05-06T04:26:44Z"
    },
    {
      "number": 180,
      "summary": "Implement a pre-push hook using Husky to enforce code quality checks and prevent push of erroneous code to the repository. This will help maintain consistency and improve the overall quality of the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/180",
      "merged_at": "2023-05-06T02:57:59Z"
    },
    {
      "number": 176,
      "summary": "Increase the session duration from 30 minutes to 1 hour for better user experience and productivity.",
      "url": "https://github.com/terror/mcgill.courses/pull/176",
      "merged_at": "2023-05-06T02:12:34Z"
    },
    {
      "number": 177,
      "summary": "Ensure correct grammar by fixing the pluralization of \"reviews\" throughout the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/177",
      "merged_at": "2023-05-06T02:12:03Z"
    },
    {
      "number": 173,
      "summary": "Ensure that the bird image on the landing page is displayed correctly without being distorted or stretched. The pull request fixes the issue by adjusting the image size to maintain its original proportion and prevent squishing.",
      "url": "https://github.com/terror/mcgill.courses/pull/173",
      "merged_at": "2023-05-06T02:07:04Z"
    },
    {
      "number": 174,
      "summary": "Display a clear error message when users attempt to submit a form without providing a star rating in the rating component. This enhancement improves user experience by guiding users to complete all necessary fields.",
      "url": "https://github.com/terror/mcgill.courses/pull/174",
      "merged_at": "2023-05-06T02:03:24Z"
    },
    {
      "number": 175,
      "summary": "Change the website title from the current title to \"mcgill.courses\".Bug fixes, improved layout, and added FAQ section to the about page.",
      "url": "https://github.com/terror/mcgill.courses/pull/175",
      "merged_at": "2023-05-06T01:36:31Z"
    },
    {
      "number": 170,
      "summary": "Update the about page with new information and include a FAQ section for better user guidance. Fixing branch naming issues for better clarity.",
      "url": "https://github.com/terror/mcgill.courses/pull/170",
      "merged_at": "2023-05-06T01:13:09Z"
    },
    {
      "number": 169,
      "summary": "Ensure that the white space issue on the home page caused by overflowed content is fixed by adjusting the layout to prevent content from overflowing and appearing as blank space.",
      "url": "https://github.com/terror/mcgill.courses/pull/169",
      "merged_at": "2023-05-06T00:55:17Z"
    },
    {
      "number": 168,
      "summary": "Adjust the z-index of search results on the explore page to ensure they display correctly on top of other elements.",
      "url": "https://github.com/terror/mcgill.courses/pull/168",
      "merged_at": "2023-05-05T03:29:36Z"
    },
    {
      "number": 167,
      "summary": "Implementing the ability to retry loader requests in case of failure to ensure smooth loading of data and improve the overall reliability of the application. This feature will help prevent disruptions and enhance the user experience by handling errors more effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/167",
      "merged_at": "2023-05-04T20:03:59Z"
    },
    {
      "number": 165,
      "summary": "Improve parsing of `&amp;` on extractor instead of frontend. Added a test for a course page with `&`.",
      "url": "https://github.com/terror/mcgill.courses/pull/165",
      "merged_at": "2023-05-04T15:48:23Z"
    },
    {
      "number": 162,
      "summary": "Update readme with seeding example: This pull request aims to enhance the readme file by adding an example of how to seed data in the application, providing clear instructions for users on how to populate their database with initial data easily.",
      "url": "https://github.com/terror/mcgill.courses/pull/162",
      "merged_at": "2023-05-03T17:55:46Z"
    },
    {
      "number": 159,
      "summary": "Introduce database tests to validate course filtering functionality, ensuring accurate and reliable search results for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/159",
      "merged_at": "2023-05-03T17:36:51Z"
    },
    {
      "number": 132,
      "summary": "Introducing a new filter feature on the explore page for both large and small screens. Ensures correct data fetching and updates backend endpoint to return filtered Course array. All tests and code were also refactored for better performance. This PR enhances user experience by providing more targeted search results.",
      "url": "https://github.com/terror/mcgill.courses/pull/132",
      "merged_at": "2023-05-03T05:12:03Z"
    },
    {
      "number": 155,
      "summary": "Introducing a new 404 not found page to improve user experience when accessing invalid URLs by redirecting them to a dedicated error page. This update ensures that users are directed appropriately and can easily navigate back to valid content on the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/155",
      "merged_at": "2023-05-03T04:50:56Z"
    },
    {
      "number": 151,
      "summary": "Retrieve and display the term metadata for each search result to enhance user understanding and relevance in the search experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/151",
      "merged_at": "2023-05-03T03:17:52Z"
    },
    {
      "number": 152,
      "summary": "Ensure consistent and organized data storage by sorting paths when seeding the database with a directory in order to improve data retrieval and management efficiency.",
      "url": "https://github.com/terror/mcgill.courses/pull/152",
      "merged_at": "2023-05-03T02:55:26Z"
    },
    {
      "number": 146,
      "summary": "Add the data directory to the .prettierignore file to exclude data files from being formatted by Prettier. This change ensures that data files are not mistakenly altered when running the code formatter on the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/146",
      "merged_at": "2023-05-02T23:50:24Z"
    },
    {
      "number": 143,
      "summary": "Extracts historical course data from the database to be used for analysis and reporting purposes. This pull request improves data retrieval efficiency and ensures accurate historical records are available for review.",
      "url": "https://github.com/terror/mcgill.courses/pull/143",
      "merged_at": "2023-05-02T23:49:07Z"
    },
    {
      "number": 142,
      "summary": "Improve readability and organization of README.md by adding headers for each section, providing clear structure for the document.",
      "url": "https://github.com/terror/mcgill.courses/pull/142",
      "merged_at": "2023-05-01T23:59:28Z"
    },
    {
      "number": 139,
      "summary": "Switching to MongoDB for session storage to improve scalability and reliability of storing user session data. This change allows for better handling of large amounts of session data and enhances the overall performance of the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/139",
      "merged_at": "2023-05-01T06:25:23Z"
    },
    {
      "number": 138,
      "summary": "Introducing a pie chart feature on course pages to visualize average ratings. The chart is now responsive, adjusting in size and centering on smaller screens for better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/138",
      "merged_at": "2023-05-01T06:22:55Z"
    },
    {
      "number": 133,
      "summary": "Introducing a CourseTerm tag for non-offered courses, now visible on both the explore and course pages. This visual indicator helps users easily identify courses that are currently unavailable.",
      "url": "https://github.com/terror/mcgill.courses/pull/133",
      "merged_at": "2023-05-01T02:59:38Z"
    }
  ],
  "April 2024": [
    {
      "number": 544,
      "summary": "This pull request adds comprehensive tests for the new database methods to ensure their accuracy and reliability in different scenarios. The tests cover various use cases and edge cases to guarantee the functionality of the database methods in different situations.",
      "url": "https://github.com/terror/mcgill.courses/pull/544",
      "merged_at": "2024-04-28T19:52:58Z"
    },
    {
      "number": 543,
      "summary": "Decreased loading time for the review page by optimizing backend queries and implementing caching to enhance user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/543",
      "merged_at": "2024-04-28T17:45:31Z"
    },
    {
      "number": 542,
      "summary": "Include a new section in the readme file detailing how to deploy the project. This update will guide users on deploying the project successfully by providing clear instructions and step-by-step guidance.",
      "url": "https://github.com/terror/mcgill.courses/pull/542",
      "merged_at": "2024-04-25T18:00:32Z"
    },
    {
      "number": 540,
      "summary": "Introduces a loading spinner to indicate when the profile page is fetching data, providing users with a visual cue while waiting for information to load.",
      "url": "https://github.com/terror/mcgill.courses/pull/540",
      "merged_at": "2024-04-25T14:53:35Z"
    },
    {
      "number": 539,
      "summary": "Improve user experience by sorting reviews from most to least on profile page, while fixing styling issues.",
      "url": "https://github.com/terror/mcgill.courses/pull/539",
      "merged_at": "2024-04-25T14:52:15Z"
    },
    {
      "number": 538,
      "summary": "This pull request aims to remove the bold styling from the subtitle on the explore page. This change will make the text on the explore page subtitle consistent with the rest of the page design, creating a more polished and visually pleasing user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/538",
      "merged_at": "2024-04-25T03:54:50Z"
    },
    {
      "number": 530,
      "summary": "Simplify the process of setting up the latest course by streamlining the initialization steps and improving user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/530",
      "merged_at": "2024-04-25T03:23:32Z"
    },
    {
      "number": 535,
      "summary": "Improve styling on the reviews page to enhance readability and user experience. This pull request updates font sizes, spacing, and colors for a more polished and professional look.",
      "url": "https://github.com/terror/mcgill.courses/pull/535",
      "merged_at": "2024-04-25T03:23:12Z"
    },
    {
      "number": 534,
      "summary": "Add subtitle to the explore page to provide users with a brief summary of each content item. This change enhances the user experience by making it easier for them to quickly understand the content before diving into it.",
      "url": "https://github.com/terror/mcgill.courses/pull/534",
      "merged_at": "2024-04-25T03:22:33Z"
    },
    {
      "number": 529,
      "summary": "Addition of a meta description tag to improve SEO and accessibility for better website ranking and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/529",
      "merged_at": "2024-04-25T02:19:28Z"
    },
    {
      "number": 533,
      "summary": "Improve the responsiveness of the reviews page by making it adjust seamlessly to different screen sizes, providing a better user experience across devices. This enhancement ensures that the content is properly displayed and accessible regardless of the device being used.",
      "url": "https://github.com/terror/mcgill.courses/pull/533",
      "merged_at": "2024-04-25T01:47:00Z"
    },
    {
      "number": 531,
      "summary": "Introduces a new \"Reviews\" page to the application, allowing users to view and leave feedback on products and services. This feature enhances user engagement and provides a platform for sharing experiences with others.",
      "url": "https://github.com/terror/mcgill.courses/pull/531",
      "merged_at": "2024-04-24T19:25:35Z"
    },
    {
      "number": 525,
      "summary": "Ensure that schedules are correctly validated and displayed to users in the application, preventing any incorrect information from being saved or displayed. This pull request improves the accuracy and reliability of scheduling features in the app.",
      "url": "https://github.com/terror/mcgill.courses/pull/525",
      "merged_at": "2024-04-22T15:45:43Z"
    },
    {
      "number": 519,
      "summary": "Add Discord link to the contacts for easier communication with the community members.",
      "url": "https://github.com/terror/mcgill.courses/pull/519",
      "merged_at": "2024-04-22T15:39:47Z"
    },
    {
      "number": 517,
      "summary": "Maintains the selected filters in the explore section even after refreshing the page, improving user experience and reducing the need to reselect filters frequently. Fixes issue #510.",
      "url": "https://github.com/terror/mcgill.courses/pull/517",
      "merged_at": "2024-04-20T04:31:23Z"
    },
    {
      "number": 516,
      "summary": "Add horizontal margin to the new explore button to prevent it from covering the entire row when clicked or hovered over.",
      "url": "https://github.com/terror/mcgill.courses/pull/516",
      "merged_at": "2024-04-19T20:48:25Z"
    },
    {
      "number": 513,
      "summary": "Add 'explore all courses' option to home page for quick, one-click access. This PR addresses a common user scenario by placing the option below the search bar, reducing the need for multiple clicks. The option remains available in the search input for continued accessibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/513",
      "merged_at": "2024-04-19T20:07:30Z"
    },
    {
      "number": 515,
      "summary": "Improve the clarity and accuracy of instructions related to the 'services' command in the development setup guide. This update aims to help users better understand and utilize the command effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/515",
      "merged_at": "2024-04-19T19:57:44Z"
    },
    {
      "number": 512,
      "summary": "Ensure that long words in review content are properly broken to improve readability and avoid overflowing. This pull request adds the `break-words` property to the review container, ensuring that long words are automatically broken into smaller fragments for a better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/512",
      "merged_at": "2024-04-19T17:59:51Z"
    },
    {
      "number": 509,
      "summary": "Integrate the Discord server to fetch development environment variables for easier management and access during the development process. This update streamlines the process of securely retrieving necessary variables, enhancing the efficiency of development workflows.",
      "url": "https://github.com/terror/mcgill.courses/pull/509",
      "merged_at": "2024-04-19T17:11:50Z"
    },
    {
      "number": 508,
      "summary": "Update my socials\n\nThis pull request includes updates to my social media links in the project's documentation and website to ensure they are accurate and up to date.",
      "url": "https://github.com/terror/mcgill.courses/pull/508",
      "merged_at": "2024-04-19T16:55:26Z"
    },
    {
      "number": 505,
      "summary": "Adjust notification dropdown z-index to ensure it displays correctly on top of other elements. The changes in this pull request fix an issue where the dropdown was being hidden by other page elements due to incorrect stacking order.",
      "url": "https://github.com/terror/mcgill.courses/pull/505",
      "merged_at": "2024-04-19T15:18:45Z"
    },
    {
      "number": 506,
      "summary": "This pull request aims to prevent accidental initialization in a production environment by disabling this feature. It ensures that the system does not undergo any unnecessary changes in a live environment, reducing the risk of errors and ensuring smooth operations.",
      "url": "https://github.com/terror/mcgill.courses/pull/506",
      "merged_at": "2024-04-19T14:53:58Z"
    },
    {
      "number": 503,
      "summary": "Increase the version of prettier and enhance visibility of the course graph button for better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/503",
      "merged_at": "2024-04-19T12:45:49Z"
    },
    {
      "number": 501,
      "summary": "Update the course information for the 2023-2024 academic year by rescraping the e-calendar courses to ensure accuracy and relevancy for students and faculty.",
      "url": "https://github.com/terror/mcgill.courses/pull/501",
      "merged_at": "2024-04-18T18:39:01Z"
    },
    {
      "number": 500,
      "summary": "Improve data accuracy by re-scraping RateMyProfessor reviews to ensure up-to-date information for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/500",
      "merged_at": "2024-04-18T17:40:38Z"
    },
    {
      "number": 499,
      "summary": "Add disclaimer to clearly differentiate the content and official endorsements of the project from any association with McGill University.",
      "url": "https://github.com/terror/mcgill.courses/pull/499",
      "merged_at": "2024-04-18T16:51:44Z"
    },
    {
      "number": 498,
      "summary": "Refactor database crate to remove custom error structs and instead utilize standard Rust error types for improved code clarity and consistency.",
      "url": "https://github.com/terror/mcgill.courses/pull/498",
      "merged_at": "2024-04-03T14:48:29Z"
    }
  ],
  "March 2023": [
    {
      "number": 77,
      "summary": "This pull request adds new tests to ensure the reliability and accuracy of the course and review routes. This addition helps to enhance the overall quality and stability of the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/77",
      "merged_at": "2023-03-31T02:37:06Z"
    },
    {
      "number": 76,
      "summary": "Update the code to properly handle special characters in query strings, ensuring accurate data retrieval and improved application performance.",
      "url": "https://github.com/terror/mcgill.courses/pull/76",
      "merged_at": "2023-03-29T22:25:53Z"
    },
    {
      "number": 64,
      "summary": "Introduce new routes for users to leave reviews on course materials, enhancing user engagement and feedback collection on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/64",
      "merged_at": "2023-03-28T23:22:05Z"
    },
    {
      "number": 72,
      "summary": "Ensure that the tslint command works correctly by updating the script to use the appropriate file path.",
      "url": "https://github.com/terror/mcgill.courses/pull/72",
      "merged_at": "2023-03-28T02:35:22Z"
    },
    {
      "number": 71,
      "summary": "Integrate tslint to improve code quality and maintainability by catching potential errors and enforcing coding standards during development. This will help developers write cleaner and more reliable code.",
      "url": "https://github.com/terror/mcgill.courses/pull/71",
      "merged_at": "2023-03-26T19:56:06Z"
    },
    {
      "number": 68,
      "summary": "Introduces a new profile dropdown component to enhance user experience by providing easy access to personalized settings and information within the application. This addition enables users to conveniently navigate and manage their profiles with a simple dropdown menu.",
      "url": "https://github.com/terror/mcgill.courses/pull/68",
      "merged_at": "2023-03-26T18:56:32Z"
    },
    {
      "number": 62,
      "summary": "Introducing an 'explore' page to enable incremental fetching using infinite scroll functionality.",
      "url": "https://github.com/terror/mcgill.courses/pull/62",
      "merged_at": "2023-03-26T13:41:29Z"
    },
    {
      "number": 63,
      "summary": "Replace all anchor tags with React Router's `Link` component for improved client-side routing and navigation within the application. This change enhances the user experience and ensures consistency in navigation behavior throughout the web application.",
      "url": "https://github.com/terror/mcgill.courses/pull/63",
      "merged_at": "2023-03-25T20:30:44Z"
    },
    {
      "number": 61,
      "summary": "Include a reference to the client/.env.example file in the readme for clarity and ease of use.",
      "url": "https://github.com/terror/mcgill.courses/pull/61",
      "merged_at": "2023-03-25T19:48:57Z"
    },
    {
      "number": 58,
      "summary": "Finalize index page with various improvements:\n- Adjusted magnifying glass icon size\n- Implemented a parser to handle `&amp;` in course titles\n- Linked each search result suggestion to `/course/${result._id}`\n- Streamlined the template by replacing nav bar buttons with an About page button\n- Limited search results array size to 6 for better screen display.",
      "url": "https://github.com/terror/mcgill.courses/pull/58",
      "merged_at": "2023-03-25T19:46:26Z"
    },
    {
      "number": 59,
      "summary": "Introduces a TypeScript formatting check to the actions workflow, ensuring consistent code style across the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/59",
      "merged_at": "2023-03-25T19:21:48Z"
    },
    {
      "number": 55,
      "summary": "Enhance the appearance and user experience of the course search dropdown by refining its styling for better visibility and ease of use. This includes improvements to the layout and design to make it more user-friendly.",
      "url": "https://github.com/terror/mcgill.courses/pull/55",
      "merged_at": "2023-03-25T16:38:16Z"
    },
    {
      "number": 51,
      "summary": "Refactor home page into components to improve code organization and maintainability. This pull request breaks down the existing home page into smaller, reusable components for better structure and easier maintenance.",
      "url": "https://github.com/terror/mcgill.courses/pull/51",
      "merged_at": "2023-03-25T15:35:41Z"
    },
    {
      "number": 50,
      "summary": "Improve user experience by removing the loading spinner in the authentication provider, resulting in a cleaner interface and faster authentication process for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/50",
      "merged_at": "2023-03-24T02:59:00Z"
    },
    {
      "number": 49,
      "summary": "Add functionality to store the request client on the state object for easier access and management in the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/49",
      "merged_at": "2023-03-24T02:54:19Z"
    },
    {
      "number": 47,
      "summary": "Update the readme to include information about setting and using environment variables for better customization and configuration.",
      "url": "https://github.com/terror/mcgill.courses/pull/47",
      "merged_at": "2023-03-23T23:57:44Z"
    },
    {
      "number": 46,
      "summary": "Update sidebar component to conditionally render a login button based on user authentication status. This change ensures a seamless user experience by displaying the appropriate content.",
      "url": "https://github.com/terror/mcgill.courses/pull/46",
      "merged_at": "2023-03-23T23:48:48Z"
    },
    {
      "number": 45,
      "summary": "Simplify and optimize authentication routes for improved performance and readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/45",
      "merged_at": "2023-03-23T23:36:40Z"
    },
    {
      "number": 44,
      "summary": "Corrected spelling errors in the Rust source code to improve readability and maintain code quality.",
      "url": "https://github.com/terror/mcgill.courses/pull/44",
      "merged_at": "2023-03-23T19:05:27Z"
    },
    {
      "number": 25,
      "summary": "Introducing Microsoft OAuth support, enabling users to securely log in using their Microsoft accounts. This pull request adds a new authentication option, expanding user accessibility and enhancing security for the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/25",
      "merged_at": "2023-03-23T18:49:10Z"
    },
    {
      "number": 42,
      "summary": "Implementing a full-text search index in MongoDB for course identifiers to enhance search functionality and improve user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/42",
      "merged_at": "2023-03-22T17:44:47Z"
    },
    {
      "number": 39,
      "summary": "Introduce a new route to search for courses efficiently on the website. This update enables users to easily locate specific courses by typing in keywords.",
      "url": "https://github.com/terror/mcgill.courses/pull/39",
      "merged_at": "2023-03-22T17:24:19Z"
    },
    {
      "number": 38,
      "summary": "This pull request organizes the routing logic into separate modules for cleaner code structure and easier maintenance. By splitting the routes into multiple files, it improves readability and makes it simpler to manage and expand the application's routing capabilities.",
      "url": "https://github.com/terror/mcgill.courses/pull/38",
      "merged_at": "2023-03-22T05:28:56Z"
    },
    {
      "number": 34,
      "summary": "Introducing a new feature that allows users to select the option to load the McGill term in the program. This update provides users with more flexibility and customization in their experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/34",
      "merged_at": "2023-03-21T21:55:20Z"
    },
    {
      "number": 33,
      "summary": "Introduce a new test to ensure the correct functionality of the `vec combine` feature. This test will help check and validate the combining logic for vectors in the codebase, ensuring accurate results and improving overall reliability.",
      "url": "https://github.com/terror/mcgill.courses/pull/33",
      "merged_at": "2023-03-21T21:52:18Z"
    },
    {
      "number": 32,
      "summary": "This pull request adds support for full-text search capabilities in MongoDB, allowing users to easily search for text within their databases. This feature enhances the searching function and improves overall query performance for users working with large datasets.",
      "url": "https://github.com/terror/mcgill.courses/pull/32",
      "merged_at": "2023-03-21T21:17:06Z"
    },
    {
      "number": 31,
      "summary": "Introduces a new helper function to improve the testing process for extractors by providing easier validation of extracted content. This will streamline the testing workflow and ensure more robust validation of extracted data.",
      "url": "https://github.com/terror/mcgill.courses/pull/31",
      "merged_at": "2023-03-21T02:40:19Z"
    },
    {
      "number": 29,
      "summary": "Update the name of the \"extract\" recipe to \"parse\" for clarity and consistency in the Justfile.",
      "url": "https://github.com/terror/mcgill.courses/pull/29",
      "merged_at": "2023-03-21T00:31:54Z"
    },
    {
      "number": 28,
      "summary": "Update the serialization of course data to use camel case formatting for better consistency and readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/28",
      "merged_at": "2023-03-21T00:29:01Z"
    },
    {
      "number": 27,
      "summary": "Improve course filtering by parsing and incorporating restrictions for more accurate search results.",
      "url": "https://github.com/terror/mcgill.courses/pull/27",
      "merged_at": "2023-03-21T00:26:13Z"
    },
    {
      "number": 26,
      "summary": "Improve readability of the function that extracts instructors in the codebase by refactoring and simplifying the logic.",
      "url": "https://github.com/terror/mcgill.courses/pull/26",
      "merged_at": "2023-03-21T00:02:17Z"
    },
    {
      "number": 22,
      "summary": "Include the year in the instructor term field to provide more specific information about when instructors are active within a program.",
      "url": "https://github.com/terror/mcgill.courses/pull/22",
      "merged_at": "2023-03-19T20:45:14Z"
    },
    {
      "number": 21,
      "summary": "Introducing a new route to retrieve all available courses from the database through a GET request.",
      "url": "https://github.com/terror/mcgill.courses/pull/21",
      "merged_at": "2023-03-19T19:48:23Z"
    },
    {
      "number": 17,
      "summary": "Switch the backend database to MongoDB for improved performance and scalability. Includes adding more database tests and configuring CI to run these tests.",
      "url": "https://github.com/terror/mcgill.courses/pull/17",
      "merged_at": "2023-03-19T18:59:14Z"
    },
    {
      "number": 15,
      "summary": "Improve the readability of course information by adding indentation and line breaks to the JSON output for better organization and clarity.",
      "url": "https://github.com/terror/mcgill.courses/pull/15",
      "merged_at": "2023-03-18T17:25:06Z"
    },
    {
      "number": 13,
      "summary": "This pull request enhances the readme by adding an example on how to extract course data, providing users with a clear guide on how to utilize this feature effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/13",
      "merged_at": "2023-03-18T17:18:01Z"
    },
    {
      "number": 12,
      "summary": "Update vsb client to no longer require passing in a term parameter when making a request. This change simplifies the client interface and improves usability.",
      "url": "https://github.com/terror/mcgill.courses/pull/12",
      "merged_at": "2023-03-18T17:10:43Z"
    },
    {
      "number": 10,
      "summary": "Adjust the formatting of the workflow file for better readability and consistency. Fixed indentation and organized sections to enhance clarity and ease of maintenance.",
      "url": "https://github.com/terror/mcgill.courses/pull/10",
      "merged_at": "2023-03-17T23:29:50Z"
    },
    {
      "number": 9,
      "summary": "Implement Continuous Integration workflow for the backend to run automated tests and ensure code quality before merging changes. This setup will help maintain a reliable and stable codebase for the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/9",
      "merged_at": "2023-03-17T23:08:54Z"
    },
    {
      "number": 8,
      "summary": "Consolidates mock implementations into the extractor crate for easier access and maintenance. This change streamlines the codebase organization and enhances code reuse efficiency.",
      "url": "https://github.com/terror/mcgill.courses/pull/8",
      "merged_at": "2023-03-17T22:46:21Z"
    },
    {
      "number": 7,
      "summary": "Improve clarity and readability by giving more descriptive names to the mock functions and variables in the codebase. This makes it easier for developers to understand and work with the code.",
      "url": "https://github.com/terror/mcgill.courses/pull/7",
      "merged_at": "2023-03-17T22:42:27Z"
    },
    {
      "number": 6,
      "summary": "Refactors the extraction code by implementing extension traits, improving the readability and maintainability of the code.",
      "url": "https://github.com/terror/mcgill.courses/pull/6",
      "merged_at": "2023-03-17T22:35:08Z"
    },
    {
      "number": 5,
      "summary": "Move model structs to the root of the crate for easier access and better organization. This change simplifies the file structure and improves overall readability of the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/5",
      "merged_at": "2023-03-16T19:24:25Z"
    },
    {
      "number": 4,
      "summary": "Exclude mock files from being counted in code statistics to provide more accurate metrics on actual codebase size and complexity. This change ensures that files used solely for testing purposes are not included in the calculations, allowing for a clearer analysis of the project's codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/4",
      "merged_at": "2023-03-16T19:15:36Z"
    },
    {
      "number": 1,
      "summary": "Update schema for scraping course scheduling information, providing detailed course data including title, credits, description, schedule, instructors, prerequisites, and more. Separates html parsing and models into distinct crates for improved organization and efficiency.",
      "url": "https://github.com/terror/mcgill.courses/pull/1",
      "merged_at": "2023-03-16T19:11:21Z"
    }
  ],
  "June 2023": [
    {
      "number": 328,
      "summary": "Update dependencies to the latest versions to ensure improved performance, security, and compatibility with other tools and libraries in the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/328",
      "merged_at": "2023-06-25T02:04:09Z"
    },
    {
      "number": 327,
      "summary": "Reduce the size of the header text on smaller screens to improve readability and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/327",
      "merged_at": "2023-06-23T03:02:27Z"
    },
    {
      "number": 325,
      "summary": "This pull request removes the ability to interact with a review that has been deleted, ensuring a cleaner user experience and eliminating any confusion or errors that may arise from attempting to interact with a deleted review.",
      "url": "https://github.com/terror/mcgill.courses/pull/325",
      "merged_at": "2023-06-23T00:20:53Z"
    },
    {
      "number": 321,
      "summary": "Filter out the reviews array in the user profile to remove deleted reviews and maintain an accurate list of reviews. This change ensures that users only see active reviews on their profile page.",
      "url": "https://github.com/terror/mcgill.courses/pull/321",
      "merged_at": "2023-06-22T23:48:57Z"
    },
    {
      "number": 320,
      "summary": "Improve the user experience on the course page by adding a layout to the spinning animation, enhancing visual appeal and engagement.",
      "url": "https://github.com/terror/mcgill.courses/pull/320",
      "merged_at": "2023-06-22T23:45:44Z"
    },
    {
      "number": 318,
      "summary": "Introducing a loading indicator to the instructor page to provide visual feedback to users while content is being fetched and displayed, enhancing user experience and usability.",
      "url": "https://github.com/terror/mcgill.courses/pull/318",
      "merged_at": "2023-06-22T23:13:12Z"
    },
    {
      "number": 313,
      "summary": "Introducing a new feature in the review filter box by adding a reset button. Users can now easily clear any filters applied and start fresh with their review search. This enhancement improves user experience and makes it more convenient to manage review filters.",
      "url": "https://github.com/terror/mcgill.courses/pull/313",
      "merged_at": "2023-06-22T00:26:19Z"
    },
    {
      "number": 311,
      "summary": "Ensure all course pages follow a uniform layout by standardizing the design elements such as font sizes, colors, and spacing. This pull request brings visual consistency across the entire course website for a cohesive user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/311",
      "merged_at": "2023-06-22T00:08:56Z"
    },
    {
      "number": 309,
      "summary": "This pull request removes horizontal rules that were appearing under header text on the website. The purpose of this change is to create a cleaner and more visually appealing layout by eliminating unnecessary distractions.",
      "url": "https://github.com/terror/mcgill.courses/pull/309",
      "merged_at": "2023-06-21T23:52:51Z"
    },
    {
      "number": 305,
      "summary": "This pull request adds a new \"Prior Art\" section to the project's readme file. This section will provide information on existing projects, ideas, or designs that have influenced the current project. This will help users understand the context and history behind the project's development.",
      "url": "https://github.com/terror/mcgill.courses/pull/305",
      "merged_at": "2023-06-21T04:52:41Z"
    },
    {
      "number": 300,
      "summary": "Purpose: This pull request removes the rmp-scraper tool from being tracked in version control to reduce repository size and improve performance.\n\nChanges: The rmp-scraper tool is no longer included in version control, making the repository leaner and easier to manage. This optimization ensures that only necessary files are tracked and helps streamline the development process.",
      "url": "https://github.com/terror/mcgill.courses/pull/300",
      "merged_at": "2023-06-21T04:07:44Z"
    },
    {
      "number": 299,
      "summary": "Implement request method in API client to obtain access token securely using transport layer security protocols such as HTTPS. This enhancement strengthens the security measures of the application by ensuring sensitive data is transmitted safely.",
      "url": "https://github.com/terror/mcgill.courses/pull/299",
      "merged_at": "2023-06-21T03:25:14Z"
    },
    {
      "number": 298,
      "summary": "Introduce deployment configurations and scripts for easier project deployment to production servers.",
      "url": "https://github.com/terror/mcgill.courses/pull/298",
      "merged_at": "2023-06-21T00:24:04Z"
    },
    {
      "number": 249,
      "summary": "Introducing filters for sorting and organizing individual course reviews, allowing users to now sort reviews by orders, filter by specific instructors, and narrow down by ratings. This update enhances the user experience by providing more control and customization options for viewing course feedback.",
      "url": "https://github.com/terror/mcgill.courses/pull/249",
      "merged_at": "2023-06-19T02:57:10Z"
    },
    {
      "number": 293,
      "summary": "Migrate codebase to use typescript-eslint for improved static code analysis and linting. This update enhances code quality and helps maintain consistency in coding standards.",
      "url": "https://github.com/terror/mcgill.courses/pull/293",
      "merged_at": "2023-06-19T02:04:18Z"
    },
    {
      "number": 292,
      "summary": "Fixes the issue causing a stutter when closing dialogs, improving the smoothness of user interactions.",
      "url": "https://github.com/terror/mcgill.courses/pull/292",
      "merged_at": "2023-06-19T00:11:26Z"
    },
    {
      "number": 290,
      "summary": "Fixes a bug where invisible texts were not being displayed in the schedule. This pull request addresses the issue with just one line of code.",
      "url": "https://github.com/terror/mcgill.courses/pull/290",
      "merged_at": "2023-06-18T21:47:43Z"
    },
    {
      "number": 288,
      "summary": "Set up lint-staged to run pre-commit hooks automatically, ensuring code quality by running linters before each commit. This will help catch potential issues early in the development process and maintain consistency in the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/288",
      "merged_at": "2023-06-18T03:52:03Z"
    },
    {
      "number": 287,
      "summary": "Ensure consistent code formatting by automatically running the format command before each commit to the repository. This pull request adds a pre-commit hook to execute the format command, improving code readability and maintainability across the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/287",
      "merged_at": "2023-06-18T03:19:42Z"
    },
    {
      "number": 285,
      "summary": "Enhance review validation to accurately account for a catch-all instructor, ensuring all review statuses are properly validated and accounted for in the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/285",
      "merged_at": "2023-06-18T01:46:34Z"
    },
    {
      "number": 283,
      "summary": "Adds a prompt for users without accounts when attempting to like a review on the website to prevent actions that require authentication.",
      "url": "https://github.com/terror/mcgill.courses/pull/283",
      "merged_at": "2023-06-17T15:40:05Z"
    },
    {
      "number": 281,
      "summary": "Enhance the software testing process by adding a server test specifically for reviewing interactions. This will help ensure that the system correctly handles and responds to various user interactions, contributing to a more robust and reliable application.",
      "url": "https://github.com/terror/mcgill.courses/pull/281",
      "merged_at": "2023-06-17T01:39:41Z"
    },
    {
      "number": 278,
      "summary": "Increase the test coverage of the backend code to ensure more robust and reliable functionality.",
      "url": "https://github.com/terror/mcgill.courses/pull/278",
      "merged_at": "2023-06-16T04:44:13Z"
    },
    {
      "number": 277,
      "summary": "Introducing a new feature that allows users to like or dislike reviews on the platform. This enhancement aims to enhance user engagement and provide valuable feedback on the content shared.",
      "url": "https://github.com/terror/mcgill.courses/pull/277",
      "merged_at": "2023-06-16T04:31:42Z"
    },
    {
      "number": 276,
      "summary": "Refactors database initialization code into a separate function for improved code readability and maintainability. This change helps organize the codebase better and makes it easier to manage database-related tasks in the future.",
      "url": "https://github.com/terror/mcgill.courses/pull/276",
      "merged_at": "2023-06-12T20:35:23Z"
    },
    {
      "number": 271,
      "summary": "Improve accuracy by matching external professor names with e-calendar entries.",
      "url": "https://github.com/terror/mcgill.courses/pull/271",
      "merged_at": "2023-06-12T15:11:32Z"
    },
    {
      "number": 273,
      "summary": "Improve the design of the explore page by removing borders from cards for a cleaner and more modern look.",
      "url": "https://github.com/terror/mcgill.courses/pull/273",
      "merged_at": "2023-06-12T04:06:53Z"
    },
    {
      "number": 274,
      "summary": "Streamline the process of populating the database with sample data by simplifying the steps and removing redundant tasks in the database seeding pipeline.",
      "url": "https://github.com/terror/mcgill.courses/pull/274",
      "merged_at": "2023-06-12T03:56:47Z"
    },
    {
      "number": 265,
      "summary": "Ensure that only valid instructors can be added or edited in the reviews on the backend. This pull request restricts the selection to existing instructors, preventing errors or invalid data entries.",
      "url": "https://github.com/terror/mcgill.courses/pull/265",
      "merged_at": "2023-06-12T00:27:59Z"
    },
    {
      "number": 270,
      "summary": "Introduces a sidebar overlay feature that allows users to easily access additional information and navigation options without leaving the current page. This enhancement aims to improve user experience by providing quick access to relevant content while maintaining the focus on the main page.",
      "url": "https://github.com/terror/mcgill.courses/pull/270",
      "merged_at": "2023-06-11T21:35:49Z"
    },
    {
      "number": 261,
      "summary": "Ensure that course cards on the explore page show the terms offered correctly. Fix the issue where no terms were displayed if not currently offered, providing a more accurate representation of courses available. Additionally, the code has been formatted for improved readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/261",
      "merged_at": "2023-06-10T19:12:03Z"
    },
    {
      "number": 258,
      "summary": "Enable users to speed up database seeding process by allowing them to seed the database using multiple threads simultaneously, resulting in faster execution times.",
      "url": "https://github.com/terror/mcgill.courses/pull/258",
      "merged_at": "2023-06-10T05:57:38Z"
    },
    {
      "number": 257,
      "summary": "Introducing a new difficulty pie chart visual representation to provide users with a clear overview of course difficulty. This addition is fully responsive, ensuring a seamless experience across different devices.",
      "url": "https://github.com/terror/mcgill.courses/pull/257",
      "merged_at": "2023-06-10T05:19:31Z"
    },
    {
      "number": 259,
      "summary": "Ensure that the instructor is included in the list of review instructors before allowing access to specific features.",
      "url": "https://github.com/terror/mcgill.courses/pull/259",
      "merged_at": "2023-06-05T00:39:09Z"
    },
    {
      "number": 256,
      "summary": "Prevent unused variables from being included in the client-side code to improve code cleanliness and performance.",
      "url": "https://github.com/terror/mcgill.courses/pull/256",
      "merged_at": "2023-06-04T04:59:24Z"
    },
    {
      "number": 254,
      "summary": "Allow multiple instructors to be added to the review form, enabling collaboration and feedback from multiple team members on student work. This update allows for a more comprehensive and inclusive review process.",
      "url": "https://github.com/terror/mcgill.courses/pull/254",
      "merged_at": "2023-06-04T04:33:06Z"
    }
  ],
  "August 2023": [
    {
      "number": 373,
      "summary": "Fix issue where page would crash when there were duplicate nodes by implementing a check to prevent the addition of duplicate nodes in the page structure. This update ensures a smooth user experience by avoiding any interruptions caused by duplicate content.",
      "url": "https://github.com/terror/mcgill.courses/pull/373",
      "merged_at": "2023-08-19T04:07:26Z"
    },
    {
      "number": 372,
      "summary": "Improve performance by adding memoization to the course graph component, reducing unnecessary re-renders and enhancing overall user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/372",
      "merged_at": "2023-08-19T03:05:11Z"
    },
    {
      "number": 364,
      "summary": "Enhance the profile page by adding a header for improved visual appeal. The new header addition enhances the overall look and feel of the page.",
      "url": "https://github.com/terror/mcgill.courses/pull/364",
      "merged_at": "2023-08-14T02:16:31Z"
    },
    {
      "number": 363,
      "summary": "Ensure consistent vertical spacing between terms on course cards for improved readability and visual appeal. Fixed issue where terms were overlapping.",
      "url": "https://github.com/terror/mcgill.courses/pull/363",
      "merged_at": "2023-08-13T17:43:01Z"
    },
    {
      "number": 362,
      "summary": "Capitalize and add proper punctuation to the course restrictions text displayed on the enrollment page for a clearer and more professional presentation.",
      "url": "https://github.com/terror/mcgill.courses/pull/362",
      "merged_at": "2023-08-13T17:28:53Z"
    },
    {
      "number": 361,
      "summary": "Set the default log level to `info` in the application if the environment variable `RUST_LOG` is not specified by the user. This change ensures that essential information is displayed during application runtime even if a specific log level is not explicitly defined.",
      "url": "https://github.com/terror/mcgill.courses/pull/361",
      "merged_at": "2023-08-11T00:00:52Z"
    },
    {
      "number": 360,
      "summary": "Fix issue where SSL certificates were not being properly validated in Docker containers by adding installation of the `ca-certificates` package to the Dockerfile. This change ensures secure connections when accessing external resources.",
      "url": "https://github.com/terror/mcgill.courses/pull/360",
      "merged_at": "2023-08-10T23:33:37Z"
    },
    {
      "number": 359,
      "summary": "Switch the HTTP client in the rusoto crate to use rustls for improved security and compatibility with the latest TLS standards. This change ensures safer communication with AWS services.",
      "url": "https://github.com/terror/mcgill.courses/pull/359",
      "merged_at": "2023-08-10T23:10:41Z"
    },
    {
      "number": 357,
      "summary": "Integrates building code for the `ARMST` shorthand, allowing for streamlined development and deployment on ARM architectures.",
      "url": "https://github.com/terror/mcgill.courses/pull/357",
      "merged_at": "2023-08-10T03:13:39Z"
    },
    {
      "number": 356,
      "summary": "Improve efficiency by calculating source hash check only during initialization, reducing unnecessary computations throughout the program's runtime.",
      "url": "https://github.com/terror/mcgill.courses/pull/356",
      "merged_at": "2023-08-10T03:07:43Z"
    },
    {
      "number": 355,
      "summary": "Store source hash in S3 to ensure that only necessary changes are made during deployments. This update impacts the production environment by storing the hash and seeding only when changes occur.",
      "url": "https://github.com/terror/mcgill.courses/pull/355",
      "merged_at": "2023-08-10T02:55:28Z"
    },
    {
      "number": 353,
      "summary": "Improve efficiency by only re-initializing the database if the source hash has changed. This reduces unnecessary operations and enhances performance when updating the database.",
      "url": "https://github.com/terror/mcgill.courses/pull/353",
      "merged_at": "2023-08-06T17:26:21Z"
    },
    {
      "number": 352,
      "summary": "This pull request improves the parsing of html documents from requirement text by handling them after a specific prefix.",
      "url": "https://github.com/terror/mcgill.courses/pull/352",
      "merged_at": "2023-08-06T15:47:52Z"
    },
    {
      "number": 351,
      "summary": "Refactor code to remove extension traits in the extractor module for improved readability and maintenance.",
      "url": "https://github.com/terror/mcgill.courses/pull/351",
      "merged_at": "2023-08-06T15:39:57Z"
    },
    {
      "number": 350,
      "summary": "Introducing verification for Azure in this pull request brings an added layer of security for user authentication and system access, ensuring a more secure and reliable experience when using Azure services.",
      "url": "https://github.com/terror/mcgill.courses/pull/350",
      "merged_at": "2023-08-05T03:07:37Z"
    },
    {
      "number": 343,
      "summary": "Integrate LLM to parse course requirements accurately and efficiently, ensuring a smoother course planning experience for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/343",
      "merged_at": "2023-08-05T03:05:45Z"
    }
  ],
  "July 2023": [
    {
      "number": 344,
      "summary": "Introducing a hovering effect on classroom numbers in the schedule display, now showing the full building name when hovered over.",
      "url": "https://github.com/terror/mcgill.courses/pull/344",
      "merged_at": "2023-07-26T23:18:37Z"
    },
    {
      "number": 348,
      "summary": "Ensure successful installation of MongoDB in the continuous integration pipeline by fixing issues causing the installation to fail.",
      "url": "https://github.com/terror/mcgill.courses/pull/348",
      "merged_at": "2023-07-22T19:03:06Z"
    },
    {
      "number": 345,
      "summary": "Ensure that the \"open-schedule\" button does not overflow its container by adjusting the styling of the button's width.",
      "url": "https://github.com/terror/mcgill.courses/pull/345",
      "merged_at": "2023-07-17T02:41:12Z"
    },
    {
      "number": 337,
      "summary": "Consolidate multiple course requests into a single form to simplify the submission process for users. This change reduces the need for users to fill out multiple forms for each course request, making it more efficient and user-friendly.",
      "url": "https://github.com/terror/mcgill.courses/pull/337",
      "merged_at": "2023-07-16T03:33:06Z"
    },
    {
      "number": 341,
      "summary": "Add course page screenshot to readme to provide a visual preview of the course content and layout for users visiting the repository. This visual aid will enhance the overall presentation of the project and help users quickly understand the scope and quality of the course materials offered.",
      "url": "https://github.com/terror/mcgill.courses/pull/341",
      "merged_at": "2023-07-15T23:39:35Z"
    },
    {
      "number": 340,
      "summary": "Improve user experience by blending search results with the search bar for easier navigation and a more intuitive browsing experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/340",
      "merged_at": "2023-07-12T23:46:28Z"
    },
    {
      "number": 296,
      "summary": "Refactor the frontend code with various improvements and optimizations:\n- Updated utility functions\n- Standardized component widths and margins\n- Improved CSS styling for consistency\n- Renamed props and components for clarity\n- Enhanced user interface elements\n- Streamlined code structure and removed unnecessary containers\n- Optimized code for better performance\n- Replaced enum with string union for better typing\n- Resolved flickering and transition issues\n- Utilized reusable components\n- Enhanced user experience with transitions and hover effects\n- Switched to lodash for efficient data manipulation\n- Created new type aliases for better readability\n- Fixed styling inconsistencies\n- Removed redundant classes and margins.",
      "url": "https://github.com/terror/mcgill.courses/pull/296",
      "merged_at": "2023-07-12T03:26:06Z"
    },
    {
      "number": 336,
      "summary": "Ensure that the review form stays open when clicked on by addressing bug #332.",
      "url": "https://github.com/terror/mcgill.courses/pull/336",
      "merged_at": "2023-07-03T17:11:25Z"
    },
    {
      "number": 335,
      "summary": "Improve the example for the `load` command in the README file to provide clearer instructions for users on how to use the command.",
      "url": "https://github.com/terror/mcgill.courses/pull/335",
      "merged_at": "2023-07-02T00:51:22Z"
    },
    {
      "number": 330,
      "summary": "Introducing a new feature that adds a visual course graph to enhance navigation and organization within the platform. Now users can easily visualize the relationships between different courses for a smoother learning experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/330",
      "merged_at": "2023-07-02T00:41:36Z"
    },
    {
      "number": 317,
      "summary": "Enhance user experience by adding visual icons to the explore term filter buttons, making it easier for users to identify and select filters. This change improves the aesthetics and usability of the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/317",
      "merged_at": "2023-07-01T15:43:14Z"
    }
  ],
  "January 2024": [
    {
      "number": 486,
      "summary": "Adjust the positioning of the notification pane to the right to provide a more balanced and visually appealing user interface.",
      "url": "https://github.com/terror/mcgill.courses/pull/486",
      "merged_at": "2024-01-02T04:48:33Z"
    },
    {
      "number": 487,
      "summary": "Update the display image in the readme file to better represent the project and enhance its visual appeal.",
      "url": "https://github.com/terror/mcgill.courses/pull/487",
      "merged_at": "2024-01-02T04:39:10Z"
    },
    {
      "number": 482,
      "summary": "Enhanced mobile display experience by fixing inconsistent margins, preventing overflow in schedule rows, and blocking background scrolling when the sidenav is open.",
      "url": "https://github.com/terror/mcgill.courses/pull/482",
      "merged_at": "2024-01-02T04:38:02Z"
    },
    {
      "number": 483,
      "summary": "Enable serving of the Microsoft Identity Association file to help verify domain ownership and enhance security measures for Microsoft services.",
      "url": "https://github.com/terror/mcgill.courses/pull/483",
      "merged_at": "2024-01-02T03:41:26Z"
    }
  ],
  "May 2024": [
    {
      "number": 573,
      "summary": "Improves the readability of the reviews page header text on mobile devices by adjusting the font size and line spacing for better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/573",
      "merged_at": "2024-05-13T22:11:02Z"
    },
    {
      "number": 572,
      "summary": "Show full list of instructors instead of truncated names to provide a comprehensive view of course averages. This resolves issue #570.",
      "url": "https://github.com/terror/mcgill.courses/pull/572",
      "merged_at": "2024-05-13T19:11:30Z"
    },
    {
      "number": 569,
      "summary": "Improve readability of text on the explore page for mobile users by adjusting font size and line spacing.",
      "url": "https://github.com/terror/mcgill.courses/pull/569",
      "merged_at": "2024-05-11T18:17:34Z"
    },
    {
      "number": 568,
      "summary": "Remove the click handler that was causing issues with course terms not having an instructor assigned. This change fixes bug #567.",
      "url": "https://github.com/terror/mcgill.courses/pull/568",
      "merged_at": "2024-05-11T15:55:45Z"
    },
    {
      "number": 566,
      "summary": "Enhanced course terms to display multiple instructors, with the ability to update state using `immer` for improved performance. Fixed key errors in other components.",
      "url": "https://github.com/terror/mcgill.courses/pull/566",
      "merged_at": "2024-05-10T03:30:51Z"
    },
    {
      "number": 565,
      "summary": "Update the Discord invite link to resolve issue #564.",
      "url": "https://github.com/terror/mcgill.courses/pull/565",
      "merged_at": "2024-05-08T14:09:27Z"
    },
    {
      "number": 562,
      "summary": "Improve parsing of restrictions text to handle year-long courses correctly. Fix issue where restrictions for courses lasting more than one year were not being displayed accurately.",
      "url": "https://github.com/terror/mcgill.courses/pull/562",
      "merged_at": "2024-05-06T01:59:21Z"
    },
    {
      "number": 559,
      "summary": "Adjusts the layout of course averages to align with the requirements box for better visual presentation and organization on the page.",
      "url": "https://github.com/terror/mcgill.courses/pull/559",
      "merged_at": "2024-05-05T19:30:53Z"
    },
    {
      "number": 558,
      "summary": "Enhance user experience by adding hyperlinks to course codes in restriction text, allowing users to easily access more information about specific courses. Fixes issue #367 related to navigating course restrictions effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/558",
      "merged_at": "2024-05-05T19:30:37Z"
    },
    {
      "number": 557,
      "summary": "Add an extra Helmet SEO tag in the Home page to ensure the website switches back to `index.html` when returning to the home page.",
      "url": "https://github.com/terror/mcgill.courses/pull/557",
      "merged_at": "2024-05-05T01:12:25Z"
    },
    {
      "number": 555,
      "summary": "Hide the \"show all\" button on course averages if there are fewer than 6 grades to improve user experience and avoid clutter on the page.",
      "url": "https://github.com/terror/mcgill.courses/pull/555",
      "merged_at": "2024-05-04T21:13:40Z"
    },
    {
      "number": 554,
      "summary": "Ensure that sidebar elements appear above other content on the page by adjusting the z-index value. This change addresses issue #553 related to sidebar visibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/554",
      "merged_at": "2024-05-04T20:44:14Z"
    },
    {
      "number": 552,
      "summary": "Ensure correct ordering of terms in search results to improve user experience. This pull request fixes an issue where terms were displayed out of order, ensuring that search results are more accurate and relevant for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/552",
      "merged_at": "2024-05-04T16:57:41Z"
    },
    {
      "number": 547,
      "summary": "Add course averages from McGill Enhanced's crowdsourced sheet to the project. Data is retrieved using the Google Sheets API and stored as a static asset for periodic updates. The UI may be improved in the future.",
      "url": "https://github.com/terror/mcgill.courses/pull/547",
      "merged_at": "2024-05-04T16:17:18Z"
    },
    {
      "number": 550,
      "summary": "Ensure that all webpages have appropriate SEO meta tags for better search engine optimization and visibility. This pull request adds meta tags to all pages for improved website ranking and visibility on search engines.",
      "url": "https://github.com/terror/mcgill.courses/pull/550",
      "merged_at": "2024-05-04T15:06:26Z"
    },
    {
      "number": 551,
      "summary": "Ensure consistency in the design of review cards by updating the CSS styling to round all four corners instead of just the bottom ones.",
      "url": "https://github.com/terror/mcgill.courses/pull/551",
      "merged_at": "2024-05-04T14:52:26Z"
    },
    {
      "number": 548,
      "summary": "This pull request aims to make the Docker image used for production environments more efficient and secure by switching to the leaner and more stable `rust slim-buster` image. This change will help streamline the deployment process and improve overall performance while maintaining reliability for production deployments.",
      "url": "https://github.com/terror/mcgill.courses/pull/548",
      "merged_at": "2024-05-03T18:00:17Z"
    },
    {
      "number": 546,
      "summary": "This pull request updates the website scraper to accurately gather course schedules for the summer of 2024.",
      "url": "https://github.com/terror/mcgill.courses/pull/546",
      "merged_at": "2024-05-03T16:29:54Z"
    }
  ],
  "December 2023": [
    {
      "number": 481,
      "summary": "Improve the layout and design of the instructors page by adjusting styles for better readability and visual appeal.",
      "url": "https://github.com/terror/mcgill.courses/pull/481",
      "merged_at": "2023-12-23T00:36:51Z"
    },
    {
      "number": 291,
      "summary": "Added privacy policy and Terms of Service (TOS) to the website and made improvements for better user experience. Footer now disappears on small screens when side navigation button is present. Side navigation now closes when pressing the same page.",
      "url": "https://github.com/terror/mcgill.courses/pull/291",
      "merged_at": "2023-12-22T21:44:09Z"
    },
    {
      "number": 480,
      "summary": "Improve course requisites by enhancing the fine-tuned LLM model for better accuracy and parsing capabilities.",
      "url": "https://github.com/terror/mcgill.courses/pull/480",
      "merged_at": "2023-12-22T02:00:47Z"
    },
    {
      "number": 470,
      "summary": "Improve the visual appearance of various pages including the profile, mobile explore, and course page empty states with style tweaks to enhance the overall user experience and design consistency.",
      "url": "https://github.com/terror/mcgill.courses/pull/470",
      "merged_at": "2023-12-21T04:16:22Z"
    },
    {
      "number": 471,
      "summary": "The pull request ensures that the search query input field is cleared once a user selects a search result, improving the user experience by removing redundant text in the search bar.",
      "url": "https://github.com/terror/mcgill.courses/pull/471",
      "merged_at": "2023-12-21T00:42:52Z"
    },
    {
      "number": 476,
      "summary": "Improve the styling of the review form for a modern and streamlined look. Update colors, fonts, and spacing to enhance user experience and readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/476",
      "merged_at": "2023-12-21T00:35:17Z"
    },
    {
      "number": 478,
      "summary": "Refine the styling of the navigation bar to enhance the overall design and user experience. This pull request makes visual adjustments to ensure cohesiveness and usability throughout the website's navigation elements.",
      "url": "https://github.com/terror/mcgill.courses/pull/478",
      "merged_at": "2023-12-21T00:29:19Z"
    },
    {
      "number": 477,
      "summary": "Improve alignment of location information in schedules for better readability and organization.",
      "url": "https://github.com/terror/mcgill.courses/pull/477",
      "merged_at": "2023-12-20T21:36:08Z"
    },
    {
      "number": 479,
      "summary": "Improve user experience by removing graph animation that was causing slow transitions, making the visual updates smoother and more responsive.",
      "url": "https://github.com/terror/mcgill.courses/pull/479",
      "merged_at": "2023-12-20T21:32:02Z"
    },
    {
      "number": 475,
      "summary": "This pull request introduces a new lint rule that enforces developers to avoid using `console` statements in the code. By identifying and flagging these statements as errors, the quality and maintainability of the codebase are improved, helping to prevent debugging output from being included in production code.",
      "url": "https://github.com/terror/mcgill.courses/pull/475",
      "merged_at": "2023-12-19T23:57:20Z"
    },
    {
      "number": 473,
      "summary": "Decrease the font size of the text in the 'About' section to improve readability and make the page layout more visually appealing.",
      "url": "https://github.com/terror/mcgill.courses/pull/473",
      "merged_at": "2023-12-19T23:09:41Z"
    },
    {
      "number": 474,
      "summary": "Improve the appearance of search result icons on mobile devices by fixing their alignment and size for a better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/474",
      "merged_at": "2023-12-19T03:07:31Z"
    },
    {
      "number": 469,
      "summary": "Ensure a consistent hover animation duration for the explore button in the course search bar. Fixing the issue where the animation was not uniform across different interactions, making the user experience smoother and more visually appealing.",
      "url": "https://github.com/terror/mcgill.courses/pull/469",
      "merged_at": "2023-12-19T02:02:40Z"
    },
    {
      "number": 468,
      "summary": "Ensure that the Azure identity file is hosted correctly to enable seamless authentication with Azure services. This pull request modifies the hosting configuration to prevent any issues related to accessing the identity file.",
      "url": "https://github.com/terror/mcgill.courses/pull/468",
      "merged_at": "2023-12-10T01:31:44Z"
    },
    {
      "number": 466,
      "summary": "Introduce logging middleware to track and log server requests and responses for better monitoring and debugging purposes.",
      "url": "https://github.com/terror/mcgill.courses/pull/466",
      "merged_at": "2023-12-10T01:29:04Z"
    }
  ]
}
