{
  "January 2024": [
    {
      "number": 486,
      "summary": "Adjust the position of the notification pane to the right for improved visibility and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/486",
      "merged_at": "2024-01-02T04:48:33Z"
    },
    {
      "number": 487,
      "summary": "Replace the outdated display image in the project's readme file with a new and updated one to provide users with a more accurate representation of the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/487",
      "merged_at": "2024-01-02T04:39:10Z"
    },
    {
      "number": 482,
      "summary": "Improve mobile display by adjusting various styling issues:\n- Fixed inconsistent margins on explore page\n- Resolved overflow of long schedule rows\n- Prevented scrolling when sidenav is open to enhance user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/482",
      "merged_at": "2024-01-02T04:38:02Z"
    },
    {
      "number": 483,
      "summary": "Enable serving the Microsoft Identity Association file from the root domain to verify ownership of a domain for Microsoft services, such as Office 365 or Azure. This ensures seamless integration and authentication processes for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/483",
      "merged_at": "2024-01-02T03:41:26Z"
    }
  ],
  "October 2023": [
    {
      "number": 449,
      "summary": "This pull request removes outdated rating display components to streamline and simplify the codebase. This change helps maintain code cleanliness and easier maintenance going forward.",
      "url": "https://github.com/terror/mcgill.courses/pull/449",
      "merged_at": "2023-10-23T21:29:44Z"
    },
    {
      "number": 448,
      "summary": "Ensure the histogram graph stays within the background on all screen sizes for better display and aesthetics. Fixed the issue with the histogram overflowing outside the designated area.",
      "url": "https://github.com/terror/mcgill.courses/pull/448",
      "merged_at": "2023-10-17T02:48:22Z"
    },
    {
      "number": 447,
      "summary": "Refactor the course merge logic for an easier and more efficient loading process. This update simplifies how courses are merged during loading, making the process smoother and more streamlined.",
      "url": "https://github.com/terror/mcgill.courses/pull/447",
      "merged_at": "2023-10-16T19:25:50Z"
    },
    {
      "number": 446,
      "summary": "Exclude extractor test samples from code analysis to ensure accurate results and prevent false positives in the generated report. This change improves the reliability of the code analysis process.",
      "url": "https://github.com/terror/mcgill.courses/pull/446",
      "merged_at": "2023-10-16T05:20:40Z"
    },
    {
      "number": 440,
      "summary": "Introducing a new feature that allows instructors to utilize full-text search capabilities, enhancing their ability to efficiently explore and access course content. This pull request expands the search function for instructors, enabling them to easily navigate and find relevant information within the educational platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/440",
      "merged_at": "2023-10-16T05:13:16Z"
    },
    {
      "number": 445,
      "summary": "Switching to type-only imports ensures that TypeScript will remove the import entirely during the compilation process, making the code more efficient and reducing unnecessary overhead at runtime. This change helps improve the performance of the application by removing unused imports.",
      "url": "https://github.com/terror/mcgill.courses/pull/445",
      "merged_at": "2023-10-16T05:03:10Z"
    },
    {
      "number": 444,
      "summary": "Introducing a basic error boundary feature to enhance the error handling process and improve the overall stability of the application. The implementation includes a visual representation for error detection and resolution. This update aims to provide a smoother user experience by efficiently managing errors within the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/444",
      "merged_at": "2023-10-16T04:59:22Z"
    },
    {
      "number": 443,
      "summary": "Ensure the reset button is correctly positioned on the page by fixing a bug with absolute positioning. The image attached visually demonstrates the issue and the proposed solution.",
      "url": "https://github.com/terror/mcgill.courses/pull/443",
      "merged_at": "2023-10-11T02:47:17Z"
    },
    {
      "number": 439,
      "summary": "This pull request updates the instructor page to display reviews in a chronological order, making it easier for users to view the most recent feedback first.",
      "url": "https://github.com/terror/mcgill.courses/pull/439",
      "merged_at": "2023-10-07T04:16:48Z"
    },
    {
      "number": 421,
      "summary": "Enable users to perform full-text search on the explore page, making it easier to find specific content quickly. This enhancement improves the overall user experience by providing a more efficient search functionality within the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/421",
      "merged_at": "2023-10-02T17:27:15Z"
    }
  ],
  "May 2023": [
    {
      "number": 252,
      "summary": "Remove the border around user review sections for a cleaner and more streamlined appearance on the website. This change enhances the overall visual experience for users interacting with reviews.",
      "url": "https://github.com/terror/mcgill.courses/pull/252",
      "merged_at": "2023-05-28T04:16:18Z"
    },
    {
      "number": 251,
      "summary": "Improve database seeding process by implementing concurrent insertions, leading to faster and more efficient data population. This change enhances the performance of the application when initializing or updating the database with new records.",
      "url": "https://github.com/terror/mcgill.courses/pull/251",
      "merged_at": "2023-05-28T04:16:10Z"
    },
    {
      "number": 250,
      "summary": "Integrate new log levels directly to streamline log management in the project. This update simplifies how different levels of logs are used and improves visibility for developers working on the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/250",
      "merged_at": "2023-05-28T02:18:40Z"
    },
    {
      "number": 248,
      "summary": "This pull request enhances the sidebar by adding smooth animation effects when opening and closing it. This change makes the user experience more visually appealing and intuitive.",
      "url": "https://github.com/terror/mcgill.courses/pull/248",
      "merged_at": "2023-05-22T01:23:43Z"
    },
    {
      "number": 246,
      "summary": "Implement feature allowing users to scrape the most up-to-date course information from e-calendar websites. This update enhances the tool by providing accurate and current data for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/246",
      "merged_at": "2023-05-22T01:17:34Z"
    },
    {
      "number": 247,
      "summary": "This pull request expands the options available for selecting instructors by adding an \"Other\" option. This allows users to choose an instructor not listed in the default options.",
      "url": "https://github.com/terror/mcgill.courses/pull/247",
      "merged_at": "2023-05-22T00:34:07Z"
    },
    {
      "number": 235,
      "summary": "Introducing an instructor page to the website, providing users with a dedicated space to access information and details about course instructors. The addition of this feature enhances the user experience by offering valuable insights into the teaching staff.",
      "url": "https://github.com/terror/mcgill.courses/pull/235",
      "merged_at": "2023-05-21T18:23:36Z"
    },
    {
      "number": 240,
      "summary": "Introducing a new feature that allows users to assign difficulty levels to courses on the platform. This update enables students to easily identify and choose courses based on their skill level and learning needs.",
      "url": "https://github.com/terror/mcgill.courses/pull/240",
      "merged_at": "2023-05-21T16:45:06Z"
    },
    {
      "number": 239,
      "summary": "Limit the number of search results displayed for courses and instructors to improve user experience and make the search functionality more efficient. This change ensures that only the most relevant results are shown, making it easier for users to find the information they need quickly.",
      "url": "https://github.com/terror/mcgill.courses/pull/239",
      "merged_at": "2023-05-21T05:06:44Z"
    },
    {
      "number": 241,
      "summary": "This pull request fixes a bug that caused animations to not display correctly. The changes in this update ensure that animations function smoothly and as intended.",
      "url": "https://github.com/terror/mcgill.courses/pull/241",
      "merged_at": "2023-05-21T04:09:38Z"
    },
    {
      "number": 238,
      "summary": "Enhanced the animation for displaying schedules to make them smoother and more visually appealing. Additionally, corrected the formatting to ensure a sleek and polished look. Added a development recipe in the justfile for easier management.",
      "url": "https://github.com/terror/mcgill.courses/pull/238",
      "merged_at": "2023-05-21T02:10:11Z"
    },
    {
      "number": 237,
      "summary": "Enhanced the animation for displaying schedules for a more fluid and visually appealing user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/237",
      "merged_at": "2023-05-21T01:54:56Z"
    },
    {
      "number": 236,
      "summary": "Introducing a new development recipe in the justfile to streamline the process of building and testing code. This addition will make it easier for developers to run common commands and automate tasks during the development process.",
      "url": "https://github.com/terror/mcgill.courses/pull/236",
      "merged_at": "2023-05-21T01:47:18Z"
    },
    {
      "number": 232,
      "summary": "Ensure that clicking on an autocomplete suggestion while scrolling does not inadvertently select the wrong item. This pull request fixes an issue where the selection would jump to a different suggestion when clicking on one while scrolling through the options.",
      "url": "https://github.com/terror/mcgill.courses/pull/232",
      "merged_at": "2023-05-21T01:05:47Z"
    },
    {
      "number": 233,
      "summary": "Improve filtering options on the explore page to accurately display courses based on the selected term. Fixing the issue where some courses were not showing up in the results when filtering by term.",
      "url": "https://github.com/terror/mcgill.courses/pull/233",
      "merged_at": "2023-05-13T18:13:30Z"
    },
    {
      "number": 234,
      "summary": "Ensure that users are redirected back to the page they were on after logging in, providing a seamless user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/234",
      "merged_at": "2023-05-13T17:06:27Z"
    },
    {
      "number": 228,
      "summary": "Scaffold end-to-end tests using Cypress framework for better testing coverage. Added mock for the /user route with a fixture for testing and started writing additional test specifications.",
      "url": "https://github.com/terror/mcgill.courses/pull/228",
      "merged_at": "2023-05-13T04:00:25Z"
    },
    {
      "number": 227,
      "summary": "Improve course schedule information by sorting and grouping it for easier navigation and organization.",
      "url": "https://github.com/terror/mcgill.courses/pull/227",
      "merged_at": "2023-05-13T03:24:06Z"
    },
    {
      "number": 229,
      "summary": "Introducing a new 'Show all reviews' button to easily access all course reviews in one place. This update enhances user experience by providing quick access to comprehensive feedback for better decision-making.",
      "url": "https://github.com/terror/mcgill.courses/pull/229",
      "merged_at": "2023-05-13T02:23:21Z"
    },
    {
      "number": 226,
      "summary": "This pull request modifies the code to sort reviews by date, ensuring that the most recent reviews appear first. This will help users easily identify and access the latest feedback provided by others.",
      "url": "https://github.com/terror/mcgill.courses/pull/226",
      "merged_at": "2023-05-10T19:21:51Z"
    },
    {
      "number": 225,
      "summary": "This pull request increases the bottom margin in the explore filter card to improve visual spacing and enhance user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/225",
      "merged_at": "2023-05-10T19:12:45Z"
    },
    {
      "number": 220,
      "summary": "This pull request enhances the database seeding process by displaying the source path of the data being added. This improvement provides users with more visibility and understanding of where the database data is coming from, aiding in better tracking and management of the data.",
      "url": "https://github.com/terror/mcgill.courses/pull/220",
      "merged_at": "2023-05-10T15:57:59Z"
    },
    {
      "number": 219,
      "summary": "Improve the accuracy of review timestamps by interpreting seeding reviews in seconds instead of milliseconds. This change enhances the precision and reliability of timestamps in the review process.",
      "url": "https://github.com/terror/mcgill.courses/pull/219",
      "merged_at": "2023-05-10T15:37:38Z"
    },
    {
      "number": 217,
      "summary": "Update loader usage information in readme to ensure that users have clear and accurate instructions on how to use loaders in the project. This pull request includes clarifications and examples to help users easily integrate and configure loaders for improved performance and functionality.",
      "url": "https://github.com/terror/mcgill.courses/pull/217",
      "merged_at": "2023-05-10T06:57:50Z"
    },
    {
      "number": 206,
      "summary": "Introduce functionality to import course reviews from an external source to enrich the platform's content and provide more valuable insights to users.",
      "url": "https://github.com/terror/mcgill.courses/pull/206",
      "merged_at": "2023-05-10T06:24:59Z"
    },
    {
      "number": 204,
      "summary": "Incorporate new fall and winter schedules in the system to keep users informed about updated class timings and availability during the colder seasons.",
      "url": "https://github.com/terror/mcgill.courses/pull/204",
      "merged_at": "2023-05-09T23:38:33Z"
    },
    {
      "number": 202,
      "summary": "Display a message indicating when a course does not have specific requirements. This change ensures clarity for users when a course lacks certain elements, improving the user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/202",
      "merged_at": "2023-05-09T23:02:44Z"
    },
    {
      "number": 201,
      "summary": "This pull request removes the outdated and unnecessary .gitkeep file from the client's public directory, resulting in a cleaner repository structure without affecting any functionality.",
      "url": "https://github.com/terror/mcgill.courses/pull/201",
      "merged_at": "2023-05-09T16:34:06Z"
    },
    {
      "number": 199,
      "summary": "This pull request adds a favicon to the website, improving user experience by displaying a recognizable icon on the browser tab.",
      "url": "https://github.com/terror/mcgill.courses/pull/199",
      "merged_at": "2023-05-08T23:20:33Z"
    },
    {
      "number": 195,
      "summary": "Improve the appearance of reviews by cutting off long reviews and adjusting formatting for better readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/195",
      "merged_at": "2023-05-08T04:30:31Z"
    },
    {
      "number": 189,
      "summary": "This update adds instructors to the search index, making it easier for users to find and access instructor profiles on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/189",
      "merged_at": "2023-05-08T03:56:16Z"
    },
    {
      "number": 192,
      "summary": "Introducing a new feature that displays the schedule to clients, providing them with easy access to upcoming appointments. This update enhances communication and ensures everyone is on the same page regarding scheduled events.",
      "url": "https://github.com/terror/mcgill.courses/pull/192",
      "merged_at": "2023-05-08T03:26:03Z"
    },
    {
      "number": 194,
      "summary": "Introducing a new feature to automatically add sample review data for testing and demonstration purposes in the application. This change allows users to have pre-populated data to work with, making the testing process more efficient and reducing manual data entry.",
      "url": "https://github.com/terror/mcgill.courses/pull/194",
      "merged_at": "2023-05-08T02:48:10Z"
    },
    {
      "number": 166,
      "summary": "Introducing a brand new feature, this pull request adds a user profile page to the platform. Users can now customize and personalize their profiles by adding details about themselves for others to view. This enhancement enhances the user experience by allowing individuals to share more about their background and interests.",
      "url": "https://github.com/terror/mcgill.courses/pull/166",
      "merged_at": "2023-05-07T06:37:24Z"
    },
    {
      "number": 188,
      "summary": "Introducing a clear button for explore filters, along with animated explore filter blocks to enhance user experience. These changes make the interface fully responsive for seamless interaction.",
      "url": "https://github.com/terror/mcgill.courses/pull/188",
      "merged_at": "2023-05-07T05:10:38Z"
    },
    {
      "number": 190,
      "summary": "Improve the performance and user experience of the course page by making it responsive and more efficient. The changes include moving navbar items to a footer, updating dependencies, removing unnecessary references, adding tooltips for course term icons, and enhancing internal links for prerequisites and corequisites. Additionally, the pull request includes features like pinning current user reviews and correcting error messages for review ratings.",
      "url": "https://github.com/terror/mcgill.courses/pull/190",
      "merged_at": "2023-05-07T03:23:21Z"
    },
    {
      "number": 183,
      "summary": "Organize user reviews by pinning them to the top of the course page for better visibility. This update also includes removing duplicate code, improving the course requirement user interface, and adding links to prerequisite and corequisite courses.",
      "url": "https://github.com/terror/mcgill.courses/pull/183",
      "merged_at": "2023-05-07T00:53:15Z"
    },
    {
      "number": 187,
      "summary": "Improve user experience by adding links to prerequisite and corequisite courses on the course registration page. This enhancement will make it easier for students to navigate and plan their academic journey.",
      "url": "https://github.com/terror/mcgill.courses/pull/187",
      "merged_at": "2023-05-07T00:31:32Z"
    },
    {
      "number": 184,
      "summary": "Enhance the user experience by adding a hover effect to course term icons for better visibility and accessibility. The updated design includes a tooltip feature to provide more information without compromising space.",
      "url": "https://github.com/terror/mcgill.courses/pull/184",
      "merged_at": "2023-05-07T00:25:16Z"
    },
    {
      "number": 186,
      "summary": "Remove unnecessary references from the 'if let' statements to improve code readability and simplify the logic in the file. This change streamlines the code and enhances its maintainability.",
      "url": "https://github.com/terror/mcgill.courses/pull/186",
      "merged_at": "2023-05-07T00:11:29Z"
    },
    {
      "number": 185,
      "summary": "Improve security and performance by updating the project dependencies to their latest versions.",
      "url": "https://github.com/terror/mcgill.courses/pull/185",
      "merged_at": "2023-05-06T18:24:52Z"
    },
    {
      "number": 182,
      "summary": "Streamline the website layout by relocating navigation bar items to the footer. This change enhances user experience and ensures a cleaner design. Additionally, the code has been linted for improved quality and consistency.",
      "url": "https://github.com/terror/mcgill.courses/pull/182",
      "merged_at": "2023-05-06T16:51:13Z"
    },
    {
      "number": 181,
      "summary": "Update the website with the summer course schedule for the 2022-2023 term. This pull request adds new information about available courses, dates, and times for the upcoming summer term.",
      "url": "https://github.com/terror/mcgill.courses/pull/181",
      "merged_at": "2023-05-06T04:26:44Z"
    },
    {
      "number": 180,
      "summary": "Introduce pre-push hook to run automated tests before pushing code changes, ensuring code quality and preventing errors from being pushed to the repository.",
      "url": "https://github.com/terror/mcgill.courses/pull/180",
      "merged_at": "2023-05-06T02:57:59Z"
    },
    {
      "number": 176,
      "summary": "Increase the duration of user sessions for a more convenient and seamless browsing experience. Users will now stay logged in for a longer period before needing to sign in again. This change aims to enhance usability and reduce the frequency of login interruptions.",
      "url": "https://github.com/terror/mcgill.courses/pull/176",
      "merged_at": "2023-05-06T02:12:34Z"
    },
    {
      "number": 177,
      "summary": "Ensure that the correct pluralization is used in the reviews section of the application to accurately display the number of reviews. This pull request fixes the issue where the wrong plural form was being shown when there was more than one review.",
      "url": "https://github.com/terror/mcgill.courses/pull/177",
      "merged_at": "2023-05-06T02:12:03Z"
    },
    {
      "number": 173,
      "summary": "Ensure that the bird image in the game does not get distorted or squished when resizing the window. Fix applied to maintain the aspect ratio of the bird image.",
      "url": "https://github.com/terror/mcgill.courses/pull/173",
      "merged_at": "2023-05-06T02:07:04Z"
    },
    {
      "number": 174,
      "summary": "Display error messages when users fail to submit a form and enhance the star rating component by adding hover effects for better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/174",
      "merged_at": "2023-05-06T02:03:24Z"
    },
    {
      "number": 175,
      "summary": "Update the website title to \"mcgill.courses\", fix search result display on explore page, add scrolling functionality to the layout component, and include a FAQ section on the about page.",
      "url": "https://github.com/terror/mcgill.courses/pull/175",
      "merged_at": "2023-05-06T01:36:31Z"
    },
    {
      "number": 170,
      "summary": "Updated the about page content and added a FAQ section for better user information and improved site navigation.",
      "url": "https://github.com/terror/mcgill.courses/pull/170",
      "merged_at": "2023-05-06T01:13:09Z"
    },
    {
      "number": 169,
      "summary": "Ensure that long paragraphs on the home page do not cause the page to display as a white blank space instead of content. Fix implemented to prevent overflow issues and maintain a seamless browsing experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/169",
      "merged_at": "2023-05-06T00:55:17Z"
    },
    {
      "number": 168,
      "summary": "Adjust the z-index of search results in the explore section to prevent overlapping with other elements on the page, improving the overall user experience and readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/168",
      "merged_at": "2023-05-05T03:29:36Z"
    },
    {
      "number": 167,
      "summary": "Introducing the ability to automatically retry loader requests in case of failure, ensuring a more reliable and efficient data loading process. This change enhances the system's robustness and reliability by automatically attempting to fetch data again if the initial request is unsuccessful.",
      "url": "https://github.com/terror/mcgill.courses/pull/167",
      "merged_at": "2023-05-04T20:03:59Z"
    },
    {
      "number": 165,
      "summary": "Update parsing functionality in the extractor to handle `&amp;` properly, instead of relying on the frontend. Test added to ensure correct parsing on course pages containing `&`.",
      "url": "https://github.com/terror/mcgill.courses/pull/165",
      "merged_at": "2023-05-04T15:48:23Z"
    },
    {
      "number": 162,
      "summary": "Description:\nThis pull request updates the README file with an example and instructions for seeding data in the application. Users can now easily follow the provided example to populate their database with initial data for testing and development purposes.",
      "url": "https://github.com/terror/mcgill.courses/pull/162",
      "merged_at": "2023-05-03T17:55:46Z"
    },
    {
      "number": 159,
      "summary": "Implementing database tests to confirm that course filtering functionality works as expected. These tests will ensure that users can successfully filter courses based on specific criteria without encountering any errors. This enhancement enhances the overall reliability and accuracy of the course filtering feature.",
      "url": "https://github.com/terror/mcgill.courses/pull/159",
      "merged_at": "2023-05-03T17:36:51Z"
    },
    {
      "number": 132,
      "summary": "Introducing a filter feature on the Explore page to help users find courses easily. This pull request adds a filter box on both large and small screens, updates the backend endpoint to return a filtered course array, and includes refactoring for improved code quality.",
      "url": "https://github.com/terror/mcgill.courses/pull/132",
      "merged_at": "2023-05-03T05:12:03Z"
    },
    {
      "number": 155,
      "summary": "Introducing a new 404 Not Found page to enhance user experience. This pull request includes the addition of the page and linking of all invalid URLs to it for a more seamless browsing experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/155",
      "merged_at": "2023-05-03T04:50:56Z"
    },
    {
      "number": 151,
      "summary": "Introduces a new function to retrieve the specific term from a glossary, enhancing the user experience by providing easy access to detailed information when needed.",
      "url": "https://github.com/terror/mcgill.courses/pull/151",
      "merged_at": "2023-05-03T03:17:52Z"
    },
    {
      "number": 152,
      "summary": "Ensure database seeding is consistent by sorting paths alphabetically before processing. This change helps organize the data insertion process and maintains a uniform seeding order, improving overall database reliability and performance.",
      "url": "https://github.com/terror/mcgill.courses/pull/152",
      "merged_at": "2023-05-03T02:55:26Z"
    },
    {
      "number": 146,
      "summary": "Include the newly added data directory in the list of directories to be ignored by Prettier for consistent code formatting across the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/146",
      "merged_at": "2023-05-02T23:50:24Z"
    },
    {
      "number": 143,
      "summary": "Extract historical course data from the database to provide users with a comprehensive overview of past course offerings and enrollment statistics. This change enhances the platform's reporting capabilities and supports better decision-making by analyzing trends over time.",
      "url": "https://github.com/terror/mcgill.courses/pull/143",
      "merged_at": "2023-05-02T23:49:07Z"
    },
    {
      "number": 142,
      "summary": "Improve the formatting and readability of the README.md file by organizing content into sections, adding bullet points for clarity, and updating language for better understanding.",
      "url": "https://github.com/terror/mcgill.courses/pull/142",
      "merged_at": "2023-05-01T23:59:28Z"
    },
    {
      "number": 139,
      "summary": "Implementing MongoDB to store session data for improved scalability and performance. This change allows the application to handle a larger number of users and sessions efficiently.",
      "url": "https://github.com/terror/mcgill.courses/pull/139",
      "merged_at": "2023-05-01T06:25:23Z"
    },
    {
      "number": 138,
      "summary": "Enhance course pages by adding a responsive pie chart to display the average rating. This update ensures the chart adapts to screen width, becoming centered on smaller devices for improved user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/138",
      "merged_at": "2023-05-01T06:22:55Z"
    },
    {
      "number": 133,
      "summary": "Introducing a new CourseTerm tag to mark non-offered courses, visible on the explore and course pages. The tag helps users easily identify courses that are currently unavailable.",
      "url": "https://github.com/terror/mcgill.courses/pull/133",
      "merged_at": "2023-05-01T02:59:38Z"
    }
  ],
  "July 2023": [
    {
      "number": 344,
      "summary": "Enhance the user experience by adding a hovering effect on classroom numbers in the schedule display. When users hover over a classroom number, the full name of the building will now be displayed, making it easier to identify locations.",
      "url": "https://github.com/terror/mcgill.courses/pull/344",
      "merged_at": "2023-07-26T23:18:37Z"
    },
    {
      "number": 348,
      "summary": "Ensure successful installation of MongoDB in our Continuous Integration environment by updating the installation script to include necessary dependencies and configurations. This fix addresses the issue of failing MongoDB installation during the CI process.",
      "url": "https://github.com/terror/mcgill.courses/pull/348",
      "merged_at": "2023-07-22T19:03:06Z"
    },
    {
      "number": 345,
      "summary": "Ensure that the \"open schedule\" button on the website displays correctly by adjusting the size and spacing to prevent text from overflowing. This change enhances the user experience by improving the visual appearance and functionality of the button.",
      "url": "https://github.com/terror/mcgill.courses/pull/345",
      "merged_at": "2023-07-17T02:41:12Z"
    },
    {
      "number": 337,
      "summary": "Consolidate individual course requests into a single form for easier submission and processing. This change simplifies the request process for users and improves efficiency for administrators by streamlining the data collection.",
      "url": "https://github.com/terror/mcgill.courses/pull/337",
      "merged_at": "2023-07-16T03:33:06Z"
    },
    {
      "number": 341,
      "summary": "Include a screenshot of the course page in the readme file to provide a visual preview of the content for users. This enhances the overall user experience and helps to attract more visitors to the course page.",
      "url": "https://github.com/terror/mcgill.courses/pull/341",
      "merged_at": "2023-07-15T23:39:35Z"
    },
    {
      "number": 340,
      "summary": "Enhance search functionality by blending search results with search bar for a more seamless user experience. This change allows users to view search results and refine their search query simultaneously on the same page, improving navigation and efficiency.",
      "url": "https://github.com/terror/mcgill.courses/pull/340",
      "merged_at": "2023-07-12T23:46:28Z"
    },
    {
      "number": 296,
      "summary": "Improve the frontend user experience with various enhancements in this pull request. Key changes include simplifying code structure by replacing utility functions, adjusting styling for better consistency, renaming props for clarity, and improving component performance. From streamlined layouts to refined interactions, these updates aim to enhance the overall usability and maintainability of the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/296",
      "merged_at": "2023-07-12T03:26:06Z"
    },
    {
      "number": 336,
      "summary": "Ensure that the review form remains open when users click on it, addressing the issue where it automatically closes.",
      "url": "https://github.com/terror/mcgill.courses/pull/336",
      "merged_at": "2023-07-03T17:11:25Z"
    },
    {
      "number": 335,
      "summary": "Update the example command for loading data in the readme file to provide clearer and more accurate instructions for users. This helps new users understand how to properly use the load command when working with the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/335",
      "merged_at": "2023-07-02T00:51:22Z"
    },
    {
      "number": 330,
      "summary": "Introducing a new feature to visualize course progression with a course graph. Now users can easily track their academic journey and plan their courses more effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/330",
      "merged_at": "2023-07-02T00:41:36Z"
    },
    {
      "number": 317,
      "summary": "Enhance the user experience by adding visually appealing icons to the term filter buttons, making it easier for users to navigate and select options when exploring different terms.",
      "url": "https://github.com/terror/mcgill.courses/pull/317",
      "merged_at": "2023-07-01T15:43:14Z"
    }
  ],
  "May 2024": [
    {
      "number": 573,
      "summary": "Improve the readability of the reviews page header text on mobile devices by adjusting the font size and line spacing for optimal viewing experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/573",
      "merged_at": "2024-05-13T22:11:02Z"
    },
    {
      "number": 572,
      "summary": "Show the complete list of instructors in the course averages for better transparency and accuracy. Fixes a bug where not all instructors were being displayed.",
      "url": "https://github.com/terror/mcgill.courses/pull/572",
      "merged_at": "2024-05-13T19:11:30Z"
    },
    {
      "number": 569,
      "summary": "Improve the readability of text on the explore page when viewed on mobile devices by adjusting the text size and line spacing for better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/569",
      "merged_at": "2024-05-11T18:17:34Z"
    },
    {
      "number": 568,
      "summary": "Ensure that users cannot click on course terms that do not have an instructor assigned to them. This prevents confusion and maintains clarity throughout the course selection process. This change improves the user experience by removing the ability to interact with terms that are not relevant to the user's current context.",
      "url": "https://github.com/terror/mcgill.courses/pull/568",
      "merged_at": "2024-05-11T15:55:45Z"
    },
    {
      "number": 566,
      "summary": "Enable the display of multiple instructors in course terms. This update resolves a previous issue (#521) and includes the integration of `immer` for smoother nested state updates. Key errors in certain components have also been corrected.",
      "url": "https://github.com/terror/mcgill.courses/pull/566",
      "merged_at": "2024-05-10T03:30:51Z"
    },
    {
      "number": 565,
      "summary": "Update the expired Discord link to ensure users can easily join the community.",
      "url": "https://github.com/terror/mcgill.courses/pull/565",
      "merged_at": "2024-05-08T14:09:27Z"
    },
    {
      "number": 562,
      "summary": "Enable the system to correctly handle courses spanning over a year in the restrictions text parsing, ensuring accurate information is displayed for long-duration courses.",
      "url": "https://github.com/terror/mcgill.courses/pull/562",
      "merged_at": "2024-05-06T01:59:21Z"
    },
    {
      "number": 559,
      "summary": "Ensure that course average grades align correctly with the requirements box on the user interface for a more intuitive and accurate display for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/559",
      "merged_at": "2024-05-05T19:30:53Z"
    },
    {
      "number": 558,
      "summary": "Update the restrictions text by adding clickable links to each course code, making it easier for users to navigate to related courses. This enhancement improves the user experience and provides quick access to relevant information.",
      "url": "https://github.com/terror/mcgill.courses/pull/558",
      "merged_at": "2024-05-05T19:30:37Z"
    },
    {
      "number": 557,
      "summary": "Enhance SEO for the website's Home page by adding an extra Helmet tag to improve indexing and search engine visibility. This change ensures that the website correctly switches back to `index.html` when navigating to the Home page.",
      "url": "https://github.com/terror/mcgill.courses/pull/557",
      "merged_at": "2024-05-05T01:12:25Z"
    },
    {
      "number": 555,
      "summary": "This update hides the 'Show All' button on the course averages page if there are fewer than 6 grades present, providing a cleaner and more focused view for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/555",
      "merged_at": "2024-05-04T21:13:40Z"
    },
    {
      "number": 554,
      "summary": "Ensure that the sidebar menu does not appear behind other elements on the page by adjusting the z-index value. This fix addresses the issue reported in #553.",
      "url": "https://github.com/terror/mcgill.courses/pull/554",
      "merged_at": "2024-05-04T20:44:14Z"
    },
    {
      "number": 552,
      "summary": "Ensure that the terms are displayed in the correct order across the platform by fixing the issue with the term ordering.",
      "url": "https://github.com/terror/mcgill.courses/pull/552",
      "merged_at": "2024-05-04T16:57:41Z"
    },
    {
      "number": 547,
      "summary": "Introducing course averages feature to display class averages using McGill Enhanced's data. The information is fetched from a Google Sheets API and stored as a static Json file for periodic updates. This addition was approved by Koz and acknowledges the contributors. The UI display may be further improved in the future.",
      "url": "https://github.com/terror/mcgill.courses/pull/547",
      "merged_at": "2024-05-04T16:17:18Z"
    },
    {
      "number": 550,
      "summary": "Update the code to include SEO meta tags on all pages for improved search engine visibility and ranking.",
      "url": "https://github.com/terror/mcgill.courses/pull/550",
      "merged_at": "2024-05-04T15:06:26Z"
    },
    {
      "number": 551,
      "summary": "Update review cards in the review page to round all four corners instead of just the bottom, addressing a styling issue.",
      "url": "https://github.com/terror/mcgill.courses/pull/551",
      "merged_at": "2024-05-04T14:52:26Z"
    },
    {
      "number": 548,
      "summary": "Switching to the rust slim-buster docker image helps reduce the final image size, making it more efficient and secure for production environments.",
      "url": "https://github.com/terror/mcgill.courses/pull/548",
      "merged_at": "2024-05-03T18:00:17Z"
    },
    {
      "number": 546,
      "summary": "Implement a feature to scrape and extract course schedules for the summer of 2024 from the university's website. This pull request adds functionality to gather course information, including titles, times, and locations, to help students plan their upcoming semester more efficiently.",
      "url": "https://github.com/terror/mcgill.courses/pull/546",
      "merged_at": "2024-05-03T16:29:54Z"
    }
  ],
  "March 2024": [
    {
      "number": 497,
      "summary": "Ensure that the reset button properly resets the sorting order in the application when clicked. This fix addresses an issue where the sorting order was not being reset as expected and ensures a smoother user experience when adjusting sorting preferences.",
      "url": "https://github.com/terror/mcgill.courses/pull/497",
      "merged_at": "2024-03-16T04:09:37Z"
    },
    {
      "number": 494,
      "summary": "Ensure that the selected pane stays highlighted when navigating back to the profile page, providing a better user experience by improving navigation consistency.",
      "url": "https://github.com/terror/mcgill.courses/pull/494",
      "merged_at": "2024-03-11T01:38:25Z"
    },
    {
      "number": 493,
      "summary": "Reduce the spacing on explore and profile pages for a cleaner and more streamlined look. This change removes unnecessary horizontal margins to enhance the overall user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/493",
      "merged_at": "2024-03-11T01:19:23Z"
    },
    {
      "number": 467,
      "summary": "Implement rate limiting to prevent users from sending too many requests in a short amount of time. This feature helps protect the system from being overwhelmed and ensures fair access for all users by restricting the number of requests they can send within a specific time frame.",
      "url": "https://github.com/terror/mcgill.courses/pull/467",
      "merged_at": "2024-03-08T17:11:27Z"
    }
  ],
  "April 2024": [
    {
      "number": 544,
      "summary": "This pull request adds automated tests to ensure the reliability and accuracy of recently implemented database functions. The tests help validate the functionality and performance of the new methods, enhancing the overall stability of the database system.",
      "url": "https://github.com/terror/mcgill.courses/pull/544",
      "merged_at": "2024-04-28T19:52:58Z"
    },
    {
      "number": 543,
      "summary": "Reduce the load time of the review page by optimizing the code and improving the performance of data fetching processes.",
      "url": "https://github.com/terror/mcgill.courses/pull/543",
      "merged_at": "2024-04-28T17:45:31Z"
    },
    {
      "number": 542,
      "summary": "Introducing a deployment section in the readme to guide users on how to deploy the application effectively. This addition aims to provide clear instructions for users to easily deploy the project and ensure a smooth and successful deployment process.",
      "url": "https://github.com/terror/mcgill.courses/pull/542",
      "merged_at": "2024-04-25T18:00:32Z"
    },
    {
      "number": 540,
      "summary": "Introducing a loading indicator to the profile page to provide users with visual feedback while the content is being fetched. This improvement enhances the user experience by reducing uncertainty and frustration when waiting for the content to load.",
      "url": "https://github.com/terror/mcgill.courses/pull/540",
      "merged_at": "2024-04-25T14:53:35Z"
    },
    {
      "number": 539,
      "summary": "Improve user experience by fixing the sorting of reviews on profile pages from least to most recent. This change enhances the readability and usability of user feedback.",
      "url": "https://github.com/terror/mcgill.courses/pull/539",
      "merged_at": "2024-04-25T14:52:15Z"
    },
    {
      "number": 538,
      "summary": "This pull request removes the bold styling from the subtitle on the explore page, providing a cleaner and more consistent visual appearance across the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/538",
      "merged_at": "2024-04-25T03:54:50Z"
    },
    {
      "number": 530,
      "summary": "This pull request simplifies the process of setting up the latest course, making it easier for users to access and navigate through the course materials. It improves the overall user experience by streamlining the initialization steps and reducing any potential confusion.",
      "url": "https://github.com/terror/mcgill.courses/pull/530",
      "merged_at": "2024-04-25T03:23:32Z"
    },
    {
      "number": 535,
      "summary": "Enhances the visual appearance of the reviews page by adjusting styles for better readability and overall user experience. This pull request improves the layout and design elements to make the reviews section more attractive and user-friendly.",
      "url": "https://github.com/terror/mcgill.courses/pull/535",
      "merged_at": "2024-04-25T03:23:12Z"
    },
    {
      "number": 534,
      "summary": "Introduce a subtitle feature to the explore page for better organization and user experience. This change allows users to quickly understand the content of each section and find relevant information more efficiently.",
      "url": "https://github.com/terror/mcgill.courses/pull/534",
      "merged_at": "2024-04-25T03:22:33Z"
    },
    {
      "number": 529,
      "summary": "Improve website SEO by adding a meta description tag to enhance search engine visibility and user understanding of webpage content.",
      "url": "https://github.com/terror/mcgill.courses/pull/529",
      "merged_at": "2024-04-25T02:19:28Z"
    },
    {
      "number": 533,
      "summary": "Improve the reviews page by making it responsive, ensuring it looks great and functions well on all different screen sizes, from mobile devices to desktops. This change will enhance user experience and ensure content is easily accessible and readable on any device.",
      "url": "https://github.com/terror/mcgill.courses/pull/533",
      "merged_at": "2024-04-25T01:47:00Z"
    },
    {
      "number": 531,
      "summary": "Introducing a new 'Reviews' page to showcase customer feedback and improve user experience. Customers can now easily access and read reviews on the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/531",
      "merged_at": "2024-04-24T19:25:35Z"
    },
    {
      "number": 525,
      "summary": "Ensure that schedules are displayed correctly by fixing a bug that was causing invalid schedules to appear. This pull request addresses the issue and ensures that schedules are now accurately displayed.",
      "url": "https://github.com/terror/mcgill.courses/pull/525",
      "merged_at": "2024-04-22T15:45:43Z"
    },
    {
      "number": 519,
      "summary": "Update contact information by adding a Discord link for easier communication with the team instead of using an email address. This change aims to improve accessibility and streamline communication with users.",
      "url": "https://github.com/terror/mcgill.courses/pull/519",
      "merged_at": "2024-04-22T15:39:47Z"
    },
    {
      "number": 517,
      "summary": "Ensure that the filter settings in the explore section are saved and persist even after refreshing the page. This update addresses the issue where users had to reset their filters every time they refreshed the page.",
      "url": "https://github.com/terror/mcgill.courses/pull/517",
      "merged_at": "2024-04-20T04:31:23Z"
    },
    {
      "number": 516,
      "summary": "Ensure that clicking or hovering over the new explore button only affects the text itself, not the entire row. This change adds horizontal margin to the button for a cleaner and more precise user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/516",
      "merged_at": "2024-04-19T20:48:25Z"
    },
    {
      "number": 513,
      "summary": "Add 'explore all courses' option to the home page for quick, one-click access, reducing the need for extra clicks to navigate to the full course list. Option now available below the search bar and on the search input for improved user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/513",
      "merged_at": "2024-04-19T20:07:30Z"
    },
    {
      "number": 515,
      "summary": "Improve clarity and accuracy in the development instructions by updating the services command to reflect the latest changes and better guide users through the process of managing services in the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/515",
      "merged_at": "2024-04-19T19:57:44Z"
    },
    {
      "number": 512,
      "summary": "Improve user experience by adding the `break-words` property to the review content, ensuring that long words are properly wrapped to prevent overflow and maintain readability. This change will make it easier for users to review content without encountering cut-off text.",
      "url": "https://github.com/terror/mcgill.courses/pull/512",
      "merged_at": "2024-04-19T17:59:51Z"
    },
    {
      "number": 509,
      "summary": "Integrate Discord server to facilitate access to development environment variables, allowing for seamless communication and collaboration among team members. This change enables developers to easily retrieve the necessary environment variables from the Discord server, streamlining the development process and promoting teamwork efficiency.",
      "url": "https://github.com/terror/mcgill.courses/pull/509",
      "merged_at": "2024-04-19T17:11:50Z"
    },
    {
      "number": 508,
      "summary": "Update my socials enables users to easily connect with the developer on various social media platforms by including updated links in the project readme. This update ensures that users can conveniently access and engage with the developer's latest updates and content across different social media channels.",
      "url": "https://github.com/terror/mcgill.courses/pull/508",
      "merged_at": "2024-04-19T16:55:26Z"
    },
    {
      "number": 505,
      "summary": "Ensure notification dropdown appears above other elements on the page by adjusting the z-index to prevent it from being hidden.",
      "url": "https://github.com/terror/mcgill.courses/pull/505",
      "merged_at": "2024-04-19T15:18:45Z"
    },
    {
      "number": 506,
      "summary": "This pull request adds a feature to disable unnecessary initialization steps in the production environment, improving system efficiency and performance by reducing unnecessary processes.",
      "url": "https://github.com/terror/mcgill.courses/pull/506",
      "merged_at": "2024-04-19T14:53:58Z"
    },
    {
      "number": 503,
      "summary": "Improve code formatting and enhance user experience by updating prettier version and making the course graph button easier to find and interact with on the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/503",
      "merged_at": "2024-04-19T12:45:49Z"
    },
    {
      "number": 501,
      "summary": "Ensure accurate and up-to-date course information in the e-calendar for the academic year 2023-2024 by manually re-scraping all courses for any changes and updates.",
      "url": "https://github.com/terror/mcgill.courses/pull/501",
      "merged_at": "2024-04-18T18:39:01Z"
    },
    {
      "number": 500,
      "summary": "Purpose: Enhance the accuracy and completeness of Rate My Professors data by re-scraping reviews from the website.\n\nChanges:\n- Implement a new scraping process to retrieve the latest reviews from Rate My Professors.\n- Update the database with the newly obtained information for better quality data and improved user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/500",
      "merged_at": "2024-04-18T17:40:38Z"
    },
    {
      "number": 499,
      "summary": "Add disclaimer to make it clear that the project is not affiliated with or endorsed by McGill University.",
      "url": "https://github.com/terror/mcgill.courses/pull/499",
      "merged_at": "2024-04-18T16:51:44Z"
    },
    {
      "number": 498,
      "summary": "Refactor the database crate to use built-in error types instead of custom error structs for improved consistency and maintainability. This pull request simplifies error handling in the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/498",
      "merged_at": "2024-04-03T14:48:29Z"
    }
  ],
  "December 2023": [
    {
      "number": 481,
      "summary": "Improve the styling of the instructors page by adjusting the layout and design for better readability and visual appeal.",
      "url": "https://github.com/terror/mcgill.courses/pull/481",
      "merged_at": "2023-12-23T00:36:51Z"
    },
    {
      "number": 291,
      "summary": "Enhanced user experience by removing footer on small screens and fixing navigation behavior. Additionally, added privacy policy and terms of service for improved transparency and compliance.",
      "url": "https://github.com/terror/mcgill.courses/pull/291",
      "merged_at": "2023-12-22T21:44:09Z"
    },
    {
      "number": 480,
      "summary": "Improve accuracy in matching course prerequisites by updating the system to use a fine-tuned language model. This change will enhance the precision in identifying and parsing course requirements, giving users a more reliable and efficient experience when selecting their courses.",
      "url": "https://github.com/terror/mcgill.courses/pull/480",
      "merged_at": "2023-12-22T02:00:47Z"
    },
    {
      "number": 470,
      "summary": "Refine the appearance of various elements such as the profile page, mobile explore, and empty course states for a more polished and visually appealing user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/470",
      "merged_at": "2023-12-21T04:16:22Z"
    },
    {
      "number": 471,
      "summary": "Automatically clear the search bar after selecting a search result to enhance user experience and reduce clutter on the search interface. This change ensures a smoother and more intuitive search process.",
      "url": "https://github.com/terror/mcgill.courses/pull/471",
      "merged_at": "2023-12-21T00:42:52Z"
    },
    {
      "number": 476,
      "summary": "Enhance the appearance of the review form by updating the styling for a more modern and user-friendly look. This pull request improves the overall aesthetics and user experience by tweaking the design elements of the review form.",
      "url": "https://github.com/terror/mcgill.courses/pull/476",
      "merged_at": "2023-12-21T00:35:17Z"
    },
    {
      "number": 478,
      "summary": "Improve the appearance of the navigation bar by adjusting the styles for better readability and visual appeal. The changes include refining the spacing, colors, and alignment of the elements in the navbar to enhance the user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/478",
      "merged_at": "2023-12-21T00:29:19Z"
    },
    {
      "number": 477,
      "summary": "Ensure consistent alignment of location information in the schedules display to improve readability and user experience. This pull request adjusts the layout to properly align location details with other schedule elements for a more organized and visually appealing presentation.",
      "url": "https://github.com/terror/mcgill.courses/pull/477",
      "merged_at": "2023-12-20T21:36:08Z"
    },
    {
      "number": 479,
      "summary": "Improve user experience by removing graph animations to make transitions smoother and less jittery when interacting with graphs on the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/479",
      "merged_at": "2023-12-20T21:32:02Z"
    },
    {
      "number": 475,
      "summary": "Disallow the usage of console.log and other console methods in the code to improve code quality and prevent potential issues caused by debugging statements. This change enforces better programming practices by encouraging developers to use proper logging and debugging tools instead of console statements.",
      "url": "https://github.com/terror/mcgill.courses/pull/475",
      "merged_at": "2023-12-19T23:57:20Z"
    },
    {
      "number": 473,
      "summary": "Decrease the font size in the 'About' section to improve readability and visual appeal for users accessing the information. This change enhances the user experience by making the text easier to digest and ensuring a more aesthetically pleasing layout.",
      "url": "https://github.com/terror/mcgill.courses/pull/473",
      "merged_at": "2023-12-19T23:09:41Z"
    },
    {
      "number": 474,
      "summary": "Improve the display of search result icons on mobile devices by updating styles for better visibility and consistency.",
      "url": "https://github.com/terror/mcgill.courses/pull/474",
      "merged_at": "2023-12-19T03:07:31Z"
    },
    {
      "number": 469,
      "summary": "Improve user experience by fixing the inconsistent hover animation duration of the explore button in the course search bar. This change ensures that the button's animation is smooth and consistent when users interact with it.",
      "url": "https://github.com/terror/mcgill.courses/pull/469",
      "merged_at": "2023-12-19T02:02:40Z"
    },
    {
      "number": 468,
      "summary": "Ensure proper hosting of the Azure identity file in a secure and organized manner by updating file paths and configurations. This change aims to prevent any potential security vulnerabilities and ensure smooth operation of the application when interacting with Azure services.",
      "url": "https://github.com/terror/mcgill.courses/pull/468",
      "merged_at": "2023-12-10T01:31:44Z"
    },
    {
      "number": 466,
      "summary": "Implement a logging middleware for the server to track incoming requests and responses. This will help developers monitor and troubleshoot the server's activity easily, providing valuable insights for improving performance and identifying potential issues.",
      "url": "https://github.com/terror/mcgill.courses/pull/466",
      "merged_at": "2023-12-10T01:29:04Z"
    }
  ],
  "September 2023": [
    {
      "number": 436,
      "summary": "Restructure the content on the about page to improve organization and flow. This pull request rearranges the text and headings for better readability and coherence.",
      "url": "https://github.com/terror/mcgill.courses/pull/436",
      "merged_at": "2023-09-29T16:52:41Z"
    },
    {
      "number": 437,
      "summary": "Enhance user experience by adding loading skeletons to the explore page, providing a visual indication of content loading to improve usability while waiting for data to load.",
      "url": "https://github.com/terror/mcgill.courses/pull/437",
      "merged_at": "2023-09-29T16:51:35Z"
    },
    {
      "number": 434,
      "summary": "Introduce a new content label on review cards and ensure equal margins for a visually balanced design.",
      "url": "https://github.com/terror/mcgill.courses/pull/434",
      "merged_at": "2023-09-27T18:35:46Z"
    },
    {
      "number": 432,
      "summary": "Integrate a new feature that adds a direct link to the course page on user profiles to improve user experience and access to subscribed courses.",
      "url": "https://github.com/terror/mcgill.courses/pull/432",
      "merged_at": "2023-09-27T17:13:31Z"
    },
    {
      "number": 431,
      "summary": "Change the color of the notification dot to red for better visibility and emphasis on unread messages.",
      "url": "https://github.com/terror/mcgill.courses/pull/431",
      "merged_at": "2023-09-27T03:08:04Z"
    },
    {
      "number": 426,
      "summary": "Enhance the visual appearance of the explore filter by making additional style adjustments based on feedback.",
      "url": "https://github.com/terror/mcgill.courses/pull/426",
      "merged_at": "2023-09-26T04:10:42Z"
    },
    {
      "number": 429,
      "summary": "Introduce Google Analytics tracking to gather insights on website traffic and user interactions, helping website owners make data-driven decisions. This pull request includes the necessary code to insert the Google Analytics tracking code into the website's HTML pages, enabling the collection of analytics data for better understanding and optimization of user engagement.",
      "url": "https://github.com/terror/mcgill.courses/pull/429",
      "merged_at": "2023-09-26T03:43:03Z"
    },
    {
      "number": 371,
      "summary": "Introducing a notification system for course reviews to enhance user experience and engagement. This feature will notify users of new reviews and updates on courses they follow, improving interaction and communication within the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/371",
      "merged_at": "2023-09-26T02:53:18Z"
    },
    {
      "number": 428,
      "summary": "Switch from using npm to pnpm in the Dockerfile to improve package installation speed and efficiency for the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/428",
      "merged_at": "2023-09-25T18:40:48Z"
    },
    {
      "number": 427,
      "summary": "Switching from npm to pnpm package manager for faster and more efficient dependency management. Updated packages to their latest versions to enhance performance and security.",
      "url": "https://github.com/terror/mcgill.courses/pull/427",
      "merged_at": "2023-09-25T18:01:23Z"
    },
    {
      "number": 425,
      "summary": "Ensure that the bird image on the website is no longer squished, improving the overall appearance and user experience. The updated image format preserves the correct proportions, restoring the image to its intended appearance.",
      "url": "https://github.com/terror/mcgill.courses/pull/425",
      "merged_at": "2023-09-23T17:27:53Z"
    },
    {
      "number": 424,
      "summary": "Display a tooltip on review cards showing the date of the review, making it easier for users to quickly see when the review was conducted.",
      "url": "https://github.com/terror/mcgill.courses/pull/424",
      "merged_at": "2023-09-22T20:26:07Z"
    },
    {
      "number": 422,
      "summary": "Display a histogram on smaller screens for better visualization of data.",
      "url": "https://github.com/terror/mcgill.courses/pull/422",
      "merged_at": "2023-09-22T20:25:38Z"
    },
    {
      "number": 419,
      "summary": "Improve the styles for the explore filter dropdown menu to enhance the user experience and make it more visually appealing.",
      "url": "https://github.com/terror/mcgill.courses/pull/419",
      "merged_at": "2023-09-21T03:02:44Z"
    },
    {
      "number": 416,
      "summary": "Replace the current toast library with a newer and more efficient one called sonner toast. This change will improve the way notifications are displayed in the application, making them more user-friendly and visually appealing.",
      "url": "https://github.com/terror/mcgill.courses/pull/416",
      "merged_at": "2023-09-16T17:44:14Z"
    },
    {
      "number": 418,
      "summary": "Update docker image to use version 1.70 of the Rust buster image for improved performance and compatibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/418",
      "merged_at": "2023-09-16T15:33:35Z"
    },
    {
      "number": 417,
      "summary": "Display a notification message (toast) whenever a review draft is saved in the system, to provide users with a visual confirmation of their actions. This change enhances the user experience by making it clear when drafts are successfully saved.",
      "url": "https://github.com/terror/mcgill.courses/pull/417",
      "merged_at": "2023-09-16T05:59:02Z"
    },
    {
      "number": 415,
      "summary": "Improve overall application performance and security by updating dependencies to the latest versions. This ensures that the application remains up-to-date and functions smoothly.",
      "url": "https://github.com/terror/mcgill.courses/pull/415",
      "merged_at": "2023-09-16T05:17:54Z"
    },
    {
      "number": 414,
      "summary": "Enhance the visual appeal of the footer and course page filters in light mode by adjusting their color schemes for better readability and aesthetics. This pull request aims to improve the overall user experience on the website by making these elements more appealing and easier to interact with.",
      "url": "https://github.com/terror/mcgill.courses/pull/414",
      "merged_at": "2023-09-15T18:50:56Z"
    },
    {
      "number": 412,
      "summary": "Ensure that long schedule display texts are properly wrapped and displayed to prevent overflowing and maintain readability for users. This update improves the visual presentation of schedules on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/412",
      "merged_at": "2023-09-15T15:00:04Z"
    },
    {
      "number": 409,
      "summary": "Introducing a new empty state design for the instructor/course page, providing a visually appealing and informative layout for when there is no content to display. This update enhances user experience by offering clear guidance and improving overall website aesthetics.",
      "url": "https://github.com/terror/mcgill.courses/pull/409",
      "merged_at": "2023-09-14T04:18:22Z"
    },
    {
      "number": 411,
      "summary": "Improve how reviews are displayed on the instructor page by fixing the layout and making it more user-friendly. This change ensures that all review content is properly visible and enhances the overall user experience on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/411",
      "merged_at": "2023-09-14T04:15:39Z"
    },
    {
      "number": 406,
      "summary": "Update the `courses-2022-2023.json` file by removing schedule details and adding `leadingTo` information for better organization of course data. Fixes issue #334.",
      "url": "https://github.com/terror/mcgill.courses/pull/406",
      "merged_at": "2023-09-10T16:47:43Z"
    },
    {
      "number": 405,
      "summary": "Ensures a visually pleasing design by rounding the bottom border of the last course review in the user interface, providing a polished and consistent look across all review cards.",
      "url": "https://github.com/terror/mcgill.courses/pull/405",
      "merged_at": "2023-09-10T16:31:48Z"
    },
    {
      "number": 404,
      "summary": "Replace the outdated course page image with a new and updated one for better visual presentation on the README file of the repository.",
      "url": "https://github.com/terror/mcgill.courses/pull/404",
      "merged_at": "2023-09-10T16:05:29Z"
    },
    {
      "number": 403,
      "summary": "Remove background color from the FAQ section of the about page to improve readability and visual appeal. This change simplifies the design and creates a more cohesive look for the web page.",
      "url": "https://github.com/terror/mcgill.courses/pull/403",
      "merged_at": "2023-09-10T15:54:02Z"
    },
    {
      "number": 402,
      "summary": "Introducing a new feature that adds a pin icon to user reviews for better organization and visibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/402",
      "merged_at": "2023-09-10T04:06:17Z"
    },
    {
      "number": 401,
      "summary": "Revamp the rating and difficulty icons in the review form for a more intuitive and visually appealing user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/401",
      "merged_at": "2023-09-10T04:03:15Z"
    },
    {
      "number": 398,
      "summary": "Update light colors to make the interface more visually appealing and easier on the eyes. Brighten and adjust the hues of primary colors to enhance the overall user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/398",
      "merged_at": "2023-09-09T20:13:57Z"
    },
    {
      "number": 400,
      "summary": "Update the design of the instructor page to align it with the style of the course page, creating a more cohesive and seamless user experience across the platform. This pull request enhances the visual consistency of the instructor page with the rest of the website's design.",
      "url": "https://github.com/terror/mcgill.courses/pull/400",
      "merged_at": "2023-09-09T20:12:06Z"
    },
    {
      "number": 399,
      "summary": "Corrected a typo in the codebase to improve readability and maintain professionalism.",
      "url": "https://github.com/terror/mcgill.courses/pull/399",
      "merged_at": "2023-09-07T15:03:40Z"
    },
    {
      "number": 397,
      "summary": "Introducing a feature that highlights the review card course on the instructor page, enhancing visibility and promoting user engagement. This update aims to provide a more dynamic and user-friendly experience for instructors accessing their course reviews.",
      "url": "https://github.com/terror/mcgill.courses/pull/397",
      "merged_at": "2023-09-06T15:38:53Z"
    },
    {
      "number": 396,
      "summary": "Ensure that the fillbar accurately rounds out when it reaches its maximum capacity. This update ensures a visually appealing and accurate representation of progress for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/396",
      "merged_at": "2023-09-04T21:52:08Z"
    },
    {
      "number": 395,
      "summary": "Ensure that statistics accurately reflect changes in review filter for professors. This update allows for real-time updates of statistics when the review filter for professors is modified.",
      "url": "https://github.com/terror/mcgill.courses/pull/395",
      "merged_at": "2023-09-04T21:51:08Z"
    },
    {
      "number": 394,
      "summary": "Ensure that the graph on the webpage correctly updates when review forms are shown or hidden, preventing any visual discrepancies and ensuring an accurate representation of the data on the page.",
      "url": "https://github.com/terror/mcgill.courses/pull/394",
      "merged_at": "2023-09-04T19:56:39Z"
    },
    {
      "number": 391,
      "summary": "Enhance the user experience by adding tooltips to display review counts when hovering over histogram bars. This change provides users with quick access to see the number of reviews represented by each bar directly on the graph.",
      "url": "https://github.com/terror/mcgill.courses/pull/391",
      "merged_at": "2023-09-04T19:49:45Z"
    },
    {
      "number": 374,
      "summary": "Ensure accurate course requirements for MATH 478 in the academic catalog. Update prerequisites and course descriptions to align with current curriculum guidelines.",
      "url": "https://github.com/terror/mcgill.courses/pull/374",
      "merged_at": "2023-09-04T02:32:01Z"
    },
    {
      "number": 366,
      "summary": "Revamp the user interface (UI) of the course information section to enhance its look and feel, improve user experience, and make the content more visually appealing. The changes include updating the layout, adding new design elements, and optimizing the display of course details for better readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/366",
      "merged_at": "2023-09-04T02:30:42Z"
    }
  ],
  "February 2024": [
    {
      "number": 488,
      "summary": "Optimizes the frontend by making a single batch request for all review interactions per course, improving efficiency and reducing network traffic. Introduces a new endpoint to retrieve all interactions within a specific course for enhanced performance.",
      "url": "https://github.com/terror/mcgill.courses/pull/488",
      "merged_at": "2024-02-05T04:27:12Z"
    }
  ],
  "March 2023": [
    {
      "number": 77,
      "summary": "Developers added additional tests to ensure the functionality and integrity of the course and review routes in the codebase. These tests help ensure that these routes continue to work as expected and prevent any potential issues that may arise during development.",
      "url": "https://github.com/terror/mcgill.courses/pull/77",
      "merged_at": "2023-03-31T02:37:06Z"
    },
    {
      "number": 76,
      "summary": "Improve handling of special characters in the query string to ensure accurate processing and avoid potential errors. This will enhance the application's functionality and user experience by correctly interpreting and utilizing query string parameters containing special characters.",
      "url": "https://github.com/terror/mcgill.courses/pull/76",
      "merged_at": "2023-03-29T22:25:53Z"
    },
    {
      "number": 64,
      "summary": "Introducing new routes for course reviews to allow users to leave feedback and ratings for courses on the platform. This addition enhances the user experience by providing a space for valuable input and helps guide others in their course selections.",
      "url": "https://github.com/terror/mcgill.courses/pull/64",
      "merged_at": "2023-03-28T23:22:05Z"
    },
    {
      "number": 72,
      "summary": "Ensure proper linting standards by fixing issues and optimizing the `tslint` command for improved code quality and consistency in the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/72",
      "merged_at": "2023-03-28T02:35:22Z"
    },
    {
      "number": 71,
      "summary": "Integrate tslint into the project to enforce consistent coding standards and improve code quality. This will help identify and fix potential issues earlier in the development process.",
      "url": "https://github.com/terror/mcgill.courses/pull/71",
      "merged_at": "2023-03-26T19:56:06Z"
    },
    {
      "number": 68,
      "summary": "Introducing a new profile dropdown component for easy access to user settings and account information. This pull request enhances user experience by providing a convenient way to manage and customize profiles without navigating through multiple pages.",
      "url": "https://github.com/terror/mcgill.courses/pull/68",
      "merged_at": "2023-03-26T18:56:32Z"
    },
    {
      "number": 62,
      "summary": "Introducing an explore page with incremental fetch functionality for seamless scrolling and discovering new content.",
      "url": "https://github.com/terror/mcgill.courses/pull/62",
      "merged_at": "2023-03-26T13:41:29Z"
    },
    {
      "number": 63,
      "summary": "Replace anchor tags with React Router links to improve navigation and support client-side routing in the website. This change allows for faster page rendering and a smoother user experience when navigating between pages.",
      "url": "https://github.com/terror/mcgill.courses/pull/63",
      "merged_at": "2023-03-25T20:30:44Z"
    },
    {
      "number": 61,
      "summary": "Update README to include instructions for setting up the client environment by referencing the client/.env.example file. This change aims to provide clear guidance for configuring the client environment by mentioning the specific example file in the README documentation.",
      "url": "https://github.com/terror/mcgill.courses/pull/61",
      "merged_at": "2023-03-25T19:48:57Z"
    },
    {
      "number": 58,
      "summary": "Enhanced the index page by refining the layout:\n- Adjusted the size of the magnifying glass icon for a better fit\n- Implemented a parser to handle `&amp;` within course titles\n- Incorporated direct links to search result suggestions formatted as `/course/${result._id}`\n- Streamlined the template by replacing nav bar buttons with a single button for the About page\n- Limited the size of search results' array to 6 to prevent screen overflow.",
      "url": "https://github.com/terror/mcgill.courses/pull/58",
      "merged_at": "2023-03-25T19:46:26Z"
    },
    {
      "number": 59,
      "summary": "Introducing a TypeScript formatting check to the actions workflow ensures that all code contributions maintain a consistent and clean formatting style, making the codebase more readable and maintainable. This enhancement improves the overall quality of the project by enforcing coding standards during the development process.",
      "url": "https://github.com/terror/mcgill.courses/pull/59",
      "merged_at": "2023-03-25T19:21:48Z"
    },
    {
      "number": 55,
      "summary": "Enhance the appearance of the course search dropdown menu by updating styles and improving readability for a better user experience. This pull request focuses on making the search dropdown more visually appealing and easier to navigate for users browsing through available course options.",
      "url": "https://github.com/terror/mcgill.courses/pull/55",
      "merged_at": "2023-03-25T16:38:16Z"
    },
    {
      "number": 51,
      "summary": "Restructures the home page into smaller, reusable components for easier maintenance and code organization. This change enhances readability and scalability of the codebase by breaking down the page into manageable sections.",
      "url": "https://github.com/terror/mcgill.courses/pull/51",
      "merged_at": "2023-03-25T15:35:41Z"
    },
    {
      "number": 50,
      "summary": "This pull request removes the loading div element that appears during the authentication process, providing a cleaner and more seamless user experience when logging in or signing up. This change enhances the overall user interface by eliminating unnecessary visual clutter.",
      "url": "https://github.com/terror/mcgill.courses/pull/50",
      "merged_at": "2023-03-24T02:59:00Z"
    },
    {
      "number": 49,
      "summary": "Introducing a new feature that puts a request client on state, allowing for easier access and management of client requests within the application. This pull request enhances the functionality and streamlines the process of handling client requests, improving overall user experience and efficiency.",
      "url": "https://github.com/terror/mcgill.courses/pull/49",
      "merged_at": "2023-03-24T02:54:19Z"
    },
    {
      "number": 47,
      "summary": "Update the README file to include information about using environment variables in the application to enhance customization and security. This addition aims to provide clear guidance for users on leveraging environment variables effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/47",
      "merged_at": "2023-03-23T23:57:44Z"
    },
    {
      "number": 46,
      "summary": "This pull request adds the functionality to only display the login button in the sidepane when a user is not already logged in. This change improves the user experience by decluttering the interface and providing a more focused view for both logged in and logged out users.",
      "url": "https://github.com/terror/mcgill.courses/pull/46",
      "merged_at": "2023-03-23T23:48:48Z"
    },
    {
      "number": 45,
      "summary": "Refactor auth routes to improve code organization and readability. This pull request cleans up the authentication routes in the codebase for better maintenance and understanding by developers working on the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/45",
      "merged_at": "2023-03-23T23:36:40Z"
    },
    {
      "number": 44,
      "summary": "Corrected spelling errors in the Rust source code files to improve readability and maintain consistency throughout the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/44",
      "merged_at": "2023-03-23T19:05:27Z"
    },
    {
      "number": 25,
      "summary": "Introducing Microsoft OAuth login option for enhanced user authentication and security. Users can now securely sign in using their Microsoft accounts, providing a convenient and trusted authentication method. This additional feature expands the login options, offering flexibility and a seamless experience for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/25",
      "merged_at": "2023-03-23T18:49:10Z"
    },
    {
      "number": 42,
      "summary": "Implementing a MongoDB full-text search index for course identifiers, allowing for faster and more efficient search functionality within the application. This enhancement will improve the overall user experience by providing quicker and more accurate search results when looking for specific courses.",
      "url": "https://github.com/terror/mcgill.courses/pull/42",
      "merged_at": "2023-03-22T17:44:47Z"
    },
    {
      "number": 39,
      "summary": "Introduces a new 'find course' route to easily search and access specific courses within the application. This enhancement adds a user-friendly feature that allows users to quickly locate and navigate to the desired course.",
      "url": "https://github.com/terror/mcgill.courses/pull/39",
      "merged_at": "2023-03-22T17:24:19Z"
    },
    {
      "number": 38,
      "summary": "Organize routes into separate modules to improve code readability and maintainability. This change will make it easier to manage and scale the application by dividing routes into logical sections.",
      "url": "https://github.com/terror/mcgill.courses/pull/38",
      "merged_at": "2023-03-22T05:28:56Z"
    },
    {
      "number": 34,
      "summary": "Introducing the ability to load data files specific to McGill University term schedules, allowing users to access relevant information easily.",
      "url": "https://github.com/terror/mcgill.courses/pull/34",
      "merged_at": "2023-03-21T21:55:20Z"
    },
    {
      "number": 33,
      "summary": "Introduce a new test to ensure the accuracy and effectiveness of the `combine` function when used with vectors, improving the overall reliability and stability of the software.",
      "url": "https://github.com/terror/mcgill.courses/pull/33",
      "merged_at": "2023-03-21T21:52:18Z"
    },
    {
      "number": 32,
      "summary": "Introducing full-text search capability with MongoDB, enabling users to efficiently search for text within documents stored in the database. This feature enhances search functionality within applications by enabling more comprehensive and accurate search results.",
      "url": "https://github.com/terror/mcgill.courses/pull/32",
      "merged_at": "2023-03-21T21:17:06Z"
    },
    {
      "number": 31,
      "summary": "Introduce a helper function to simplify the process of writing tests for extractors. This change aims to streamline the testing of data extraction functionality, making it more efficient for developers to verify the accuracy and reliability of data extraction features in the software.",
      "url": "https://github.com/terror/mcgill.courses/pull/31",
      "merged_at": "2023-03-21T02:40:19Z"
    },
    {
      "number": 29,
      "summary": "Rename the 'extract' recipe to 'unpack' for clarity and consistency in the justfile, making it easier to understand and use for managing tasks and processes.",
      "url": "https://github.com/terror/mcgill.courses/pull/29",
      "merged_at": "2023-03-21T00:31:54Z"
    },
    {
      "number": 28,
      "summary": "Converts the naming convention of courses to camel case for better consistency and readability throughout the application. This will standardize how course data is displayed and managed, leading to a more polished user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/28",
      "merged_at": "2023-03-21T00:29:01Z"
    },
    {
      "number": 27,
      "summary": "Improve course mapping by parsing restrictions and updating logic. This pull request enhances the system's ability to understand and apply course restrictions accurately, ensuring better organization and allocation of resources.",
      "url": "https://github.com/terror/mcgill.courses/pull/27",
      "merged_at": "2023-03-21T00:26:13Z"
    },
    {
      "number": 26,
      "summary": "Improve the readability of the code for extracting instructors by simplifying and clarifying the function. This change enhances the code's clarity and maintainability for developers working on the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/26",
      "merged_at": "2023-03-21T00:02:17Z"
    },
    {
      "number": 22,
      "summary": "Update the instructor term field to include the year for better organization and clarity when scheduling courses. This enhancement will help users easily track and manage instructor assignments based on specific years.",
      "url": "https://github.com/terror/mcgill.courses/pull/22",
      "merged_at": "2023-03-19T20:45:14Z"
    },
    {
      "number": 21,
      "summary": "Introducing a new feature to the application that allows users to access a list of all available courses by sending a GET request to the '/courses' endpoint. This update enables users to retrieve information about courses stored in the database easily.",
      "url": "https://github.com/terror/mcgill.courses/pull/21",
      "merged_at": "2023-03-19T19:48:23Z"
    },
    {
      "number": 17,
      "summary": "Introducing a switch to using MongoDB on the backend, this pull request aims to enhance the database functionality. It includes the addition of more database tests and ensures that these tests run seamlessly in continuous integration. This update will improve the efficiency and reliability of the system's backend operations.",
      "url": "https://github.com/terror/mcgill.courses/pull/17",
      "merged_at": "2023-03-19T18:59:14Z"
    },
    {
      "number": 15,
      "summary": "Improve the formatting of course information to make it more visually appealing and easier to read in the JSON output.",
      "url": "https://github.com/terror/mcgill.courses/pull/15",
      "merged_at": "2023-03-18T17:25:06Z"
    },
    {
      "number": 13,
      "summary": "In this pull request, a new example showcasing how to extract course data has been added to the README file. This will help users understand how to use the tool for extracting specific information from courses effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/13",
      "merged_at": "2023-03-18T17:18:01Z"
    },
    {
      "number": 12,
      "summary": "Remove the unnecessary passing of the term variable in the VSCode extension for smoother functionality.",
      "url": "https://github.com/terror/mcgill.courses/pull/12",
      "merged_at": "2023-03-18T17:10:43Z"
    },
    {
      "number": 10,
      "summary": "Ensure consistency and readability by reorganizing and tidying up the code in the workflow file to make it easier to navigate and understand. This pull request aims to improve the structure and overall presentation of the workflow file for better workflow management.",
      "url": "https://github.com/terror/mcgill.courses/pull/10",
      "merged_at": "2023-03-17T23:29:50Z"
    },
    {
      "number": 9,
      "summary": "Implemented Continuous Integration (CI) workflow to automatically test the backend code, ensuring reliability and efficiency. This automates the testing process and helps in detecting and fixing issues early on in the development cycle.",
      "url": "https://github.com/terror/mcgill.courses/pull/9",
      "merged_at": "2023-03-17T23:08:54Z"
    },
    {
      "number": 8,
      "summary": "This pull request moves the mock files into the extractor crate, allowing for better organization and improved maintenance of the project. This change streamlines the codebase and enhances the overall structure of the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/8",
      "merged_at": "2023-03-17T22:46:21Z"
    },
    {
      "number": 7,
      "summary": "Improve code readability by giving clearer and more descriptive names to mock objects in the project. This change makes it easier for developers to understand the purpose and usage of these mock objects in the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/7",
      "merged_at": "2023-03-17T22:42:27Z"
    },
    {
      "number": 6,
      "summary": "Refactor code to improve readability and maintainability by moving extraction logic into separate extension traits, making the codebase more organized and easier to manage.",
      "url": "https://github.com/terror/mcgill.courses/pull/6",
      "merged_at": "2023-03-17T22:35:08Z"
    },
    {
      "number": 5,
      "summary": "Move model structs to the root of the crate for easier access and better organization. This change simplifies the structure of the codebase and makes it more intuitive for developers to locate and work with model structs.",
      "url": "https://github.com/terror/mcgill.courses/pull/5",
      "merged_at": "2023-03-16T19:24:25Z"
    },
    {
      "number": 4,
      "summary": "Exclude mocks from code statistics to provide a more accurate representation of the actual code base without the inclusion of test data. This helps developers better understand the size and complexity of their code by removing irrelevant information from the calculations.",
      "url": "https://github.com/terror/mcgill.courses/pull/4",
      "merged_at": "2023-03-16T19:15:36Z"
    },
    {
      "number": 1,
      "summary": "Enhancement: Improved course scheduling information scraping with an updated schema including details like course title, credits, instructors, prerequisites, and schedule. Additionally, the PR separates html parsing and models into separate crates for better organization and maintainability.",
      "url": "https://github.com/terror/mcgill.courses/pull/1",
      "merged_at": "2023-03-16T19:11:21Z"
    }
  ],
  "April 2023": [
    {
      "number": 130,
      "summary": "This pull request updates the code to correctly parse and display schedule data, ensuring that all dates and times are accurately processed and displayed in the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/130",
      "merged_at": "2023-04-30T19:21:00Z"
    },
    {
      "number": 131,
      "summary": "This pull request changes the review creation and editing process to use dialogs, providing a more user-friendly way to add and modify reviews. This enhancement aims to improve the overall user experience by simplifying the review management workflow.",
      "url": "https://github.com/terror/mcgill.courses/pull/131",
      "merged_at": "2023-04-28T22:16:30Z"
    },
    {
      "number": 129,
      "summary": "Replace broken image links in the README file with correct and working image links to ensure that all visuals are displayed properly in the documentation. This update enhances the overall readability and user experience of the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/129",
      "merged_at": "2023-04-28T20:59:45Z"
    },
    {
      "number": 128,
      "summary": "Enhanced search functionality to include partial matches and improved relevancy ranking, making it easier for users to find relevant information quickly.",
      "url": "https://github.com/terror/mcgill.courses/pull/128",
      "merged_at": "2023-04-28T20:32:31Z"
    },
    {
      "number": 127,
      "summary": "Introducing a new feature: dark mode! This pull request enhances the user experience by adding a dark mode option to the application, providing users with a more comfortable viewing experience in low-light environments. Say goodbye to eye strain and enjoy browsing in style with the new dark mode feature.",
      "url": "https://github.com/terror/mcgill.courses/pull/127",
      "merged_at": "2023-04-28T19:47:27Z"
    },
    {
      "number": 126,
      "summary": "Ensure that only McGill email addresses are allowed for authentication, enhancing the security and integrity of user accounts. This change prevents unauthorized access from non-McGill email domains.",
      "url": "https://github.com/terror/mcgill.courses/pull/126",
      "merged_at": "2023-04-26T19:50:01Z"
    },
    {
      "number": 124,
      "summary": "Update the application to use BSON formatted timestamps for improved data storage and performance. This change ensures that date and time data is stored in a more efficient manner, enhancing the overall functionality of the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/124",
      "merged_at": "2023-04-18T02:02:22Z"
    },
    {
      "number": 122,
      "summary": "Improve the formatting of Tailwind classes to ensure consistency and readability in the code. This pull request aims to enhance the visual structure of Tailwind CSS classes for better documentation and understanding.",
      "url": "https://github.com/terror/mcgill.courses/pull/122",
      "merged_at": "2023-04-17T18:34:38Z"
    },
    {
      "number": 121,
      "summary": "Enable underlining of search results that match the search query to improve visibility and user experience in the search feature.",
      "url": "https://github.com/terror/mcgill.courses/pull/121",
      "merged_at": "2023-04-10T02:35:49Z"
    },
    {
      "number": 114,
      "summary": "Introducing a variety of new icons to enhance visual elements across the platform. This pull request adds a selection of modern and sleek icons for a more user-friendly and engaging experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/114",
      "merged_at": "2023-04-09T22:24:02Z"
    },
    {
      "number": 113,
      "summary": "Enable users to smoothly transition to editing mode when a review has been previously submitted on the client side, ensuring a seamless user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/113",
      "merged_at": "2023-04-09T22:19:59Z"
    },
    {
      "number": 110,
      "summary": "Introduces a new feature that adds a \"blank\" target attribute to course URLs, ensuring that when users click on a course link, it will open in a new tab or window instead of directing them away from the current page. This helps improve user experience by allowing them to easily navigate back to the original content after exploring a course link.",
      "url": "https://github.com/terror/mcgill.courses/pull/110",
      "merged_at": "2023-04-09T02:53:56Z"
    },
    {
      "number": 101,
      "summary": "Introducing an alert notification box for displaying errors on the client-side, designed to replace console.error messages for a more user-friendly experience. The pull request includes a prototype and code formatting improvements.",
      "url": "https://github.com/terror/mcgill.courses/pull/101",
      "merged_at": "2023-04-09T00:01:38Z"
    },
    {
      "number": 73,
      "summary": "Introducing a new feature that adds a reviews section to each course page, allowing users to read and leave feedback on their learning experience. This update enhances the user interaction and provides valuable insights for potential students.",
      "url": "https://github.com/terror/mcgill.courses/pull/73",
      "merged_at": "2023-04-08T23:47:47Z"
    },
    {
      "number": 103,
      "summary": "Introducing a basic prototype of an about page to serve as a temporary placeholder until further adjustments are made before deployment.",
      "url": "https://github.com/terror/mcgill.courses/pull/103",
      "merged_at": "2023-04-08T20:59:39Z"
    },
    {
      "number": 102,
      "summary": "Ensure consistency in the database by updating courses with the same unique identification number. This change helps prevent duplicate entries and maintains accurate data within the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/102",
      "merged_at": "2023-04-05T04:30:20Z"
    },
    {
      "number": 100,
      "summary": "Improves the layout and functionality of course pages by fixing bugs and restructuring code for better performance and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/100",
      "merged_at": "2023-04-04T20:09:52Z"
    },
    {
      "number": 99,
      "summary": "Added a search bar to the navigation bar on all pages, making it easier for users to search for content. The positioning of the navigation buttons has been adjusted to the right side of the navigation bar for a cleaner layout.",
      "url": "https://github.com/terror/mcgill.courses/pull/99",
      "merged_at": "2023-04-04T13:13:18Z"
    },
    {
      "number": 95,
      "summary": "Ensure that courses extracted from a database are unique to avoid loading duplicates into the system, improving the overall data integrity and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/95",
      "merged_at": "2023-04-02T20:04:19Z"
    },
    {
      "number": 94,
      "summary": "This update enhances the program to extract courses that are not being offered, making it easier for administrators to manage course listings and keep them up to date.",
      "url": "https://github.com/terror/mcgill.courses/pull/94",
      "merged_at": "2023-04-02T20:03:33Z"
    },
    {
      "number": 93,
      "summary": "This pull request merges new content and updates into the course page to provide students with the latest information and resources in a single organized location. Students can easily access all the necessary details and materials they need for the course.",
      "url": "https://github.com/terror/mcgill.courses/pull/93",
      "merged_at": "2023-04-02T17:02:50Z"
    },
    {
      "number": 92,
      "summary": "Introducing a new feature to enhance the search functionality, making it more efficient and user-friendly. This pull request improves the search experience by adding filters and sorting options, providing a cooler and more effective way to find information.",
      "url": "https://github.com/terror/mcgill.courses/pull/92",
      "merged_at": "2023-04-02T02:15:11Z"
    },
    {
      "number": 91,
      "summary": "Introduce a new review form feature to collect feedback efficiently and accurately from users. This pull request enhances the user experience by streamlining the process of gathering feedback through a structured form. The review form now enables users to provide detailed feedback in a more organized manner, improving the overall feedback collection process for better insights.",
      "url": "https://github.com/terror/mcgill.courses/pull/91",
      "merged_at": "2023-04-02T01:22:36Z"
    },
    {
      "number": 86,
      "summary": "Add a new field 'instructor' to the review model for better organization and tracking of course reviews.",
      "url": "https://github.com/terror/mcgill.courses/pull/86",
      "merged_at": "2023-04-02T01:21:34Z"
    },
    {
      "number": 84,
      "summary": "Improve the accuracy of function names in the codebase for better clarity and understanding.",
      "url": "https://github.com/terror/mcgill.courses/pull/84",
      "merged_at": "2023-04-01T19:22:33Z"
    },
    {
      "number": 83,
      "summary": "Improve the profile icon design by removing the ring and adjusting the hover color to match the search bar for a more uniform look and feel.",
      "url": "https://github.com/terror/mcgill.courses/pull/83",
      "merged_at": "2023-04-01T19:20:54Z"
    },
    {
      "number": 82,
      "summary": "Implement arrow-key navigation for search bar results to easily navigate through search results. Currently excludes the 'explore all courses' rectangle, seeking feedback on whether to include it.",
      "url": "https://github.com/terror/mcgill.courses/pull/82",
      "merged_at": "2023-04-01T19:11:04Z"
    }
  ],
  "November 2023": [
    {
      "number": 465,
      "summary": "Ensure consistency in design by adjusting the color of the explore filter text to match other page elements, enhancing the overall visual cohesion of the platform. This change addresses issue #455.",
      "url": "https://github.com/terror/mcgill.courses/pull/465",
      "merged_at": "2023-11-29T17:14:03Z"
    },
    {
      "number": 463,
      "summary": "Introducing a new schedule display feature that enhances the visual representation of course schedules. This pull request adds a modern and easy-to-read layout for viewing class timings, locations, and other important information at a glance. The improved design aims to provide users with a more intuitive and efficient way to manage their academic schedules.",
      "url": "https://github.com/terror/mcgill.courses/pull/463",
      "merged_at": "2023-11-28T05:36:14Z"
    },
    {
      "number": 461,
      "summary": "Introduce a confirmation dialog to prompt users before deleting a subscription, helping prevent unintentional removals and enhancing user experience by ensuring clarity and control over subscriptions management.",
      "url": "https://github.com/terror/mcgill.courses/pull/461",
      "merged_at": "2023-11-17T20:03:12Z"
    },
    {
      "number": 460,
      "summary": "Update the application to use the full database URL provided in the environment settings, ensuring seamless and secure database connections. This change allows for more flexibility and simplifies the configuration process when connecting to the database.",
      "url": "https://github.com/terror/mcgill.courses/pull/460",
      "merged_at": "2023-11-14T00:19:51Z"
    },
    {
      "number": 450,
      "summary": "Improve the review process by implementing an interaction filter that helps moderators easily identify and address inappropriate content in reviews. This feature adds a new tool to efficiently manage and maintain a safe and constructive review environment.",
      "url": "https://github.com/terror/mcgill.courses/pull/450",
      "merged_at": "2023-11-13T04:07:06Z"
    },
    {
      "number": 453,
      "summary": "Introduce new filter options on the Explore page to easily search and narrow down content. Users can now refine search results by categories, tags, and date ranges for a more personalized browsing experience. This update enhances user navigation and provides a more tailored content discovery journey.",
      "url": "https://github.com/terror/mcgill.courses/pull/453",
      "merged_at": "2023-11-13T03:19:44Z"
    },
    {
      "number": 457,
      "summary": "Decreases the overall file size of the application to improve loading times and optimize performance. By removing unnecessary code and dependencies, the application's bundle size is significantly reduced, resulting in a faster and smoother user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/457",
      "merged_at": "2023-11-13T03:14:43Z"
    },
    {
      "number": 454,
      "summary": "Improve course search speed by upgrading to FlexSearch on the frontend, reducing reliance on backend requests for faster results.",
      "url": "https://github.com/terror/mcgill.courses/pull/454",
      "merged_at": "2023-11-13T01:04:40Z"
    },
    {
      "number": 452,
      "summary": "Limiting the length of text on course cards in the explore page to 400 characters for better readability and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/452",
      "merged_at": "2023-11-09T04:09:17Z"
    }
  ],
  "August 2023": [
    {
      "number": 373,
      "summary": "Fix issue that caused the webpage to crash when duplicate nodes were present by implementing a check to ensure unique nodes are rendered correctly.",
      "url": "https://github.com/terror/mcgill.courses/pull/373",
      "merged_at": "2023-08-19T04:07:26Z"
    },
    {
      "number": 372,
      "summary": "Optimized the course graph component by adding memoization, which helps improve performance by caching the results of expensive computations. This change reduces unnecessary re-rendering of the component, making the user experience smoother and faster.",
      "url": "https://github.com/terror/mcgill.courses/pull/372",
      "merged_at": "2023-08-19T03:05:11Z"
    },
    {
      "number": 364,
      "summary": "Introducing a header to the profile page for improved visual appeal and user experience. This change enhances the overall look of the page, making it more engaging and organized. See the updated design in the screenshot provided.",
      "url": "https://github.com/terror/mcgill.courses/pull/364",
      "merged_at": "2023-08-14T02:16:31Z"
    },
    {
      "number": 363,
      "summary": "Improve the layout of course card terms by adding consistent vertical spacing for better readability and visual appeal.",
      "url": "https://github.com/terror/mcgill.courses/pull/363",
      "merged_at": "2023-08-13T17:43:01Z"
    },
    {
      "number": 362,
      "summary": "Enhance the user experience by correctly capitalizing and punctuating the text that displays course restrictions. This change ensures that the information provided is clear and professional for students to easily understand.",
      "url": "https://github.com/terror/mcgill.courses/pull/362",
      "merged_at": "2023-08-13T17:28:53Z"
    },
    {
      "number": 361,
      "summary": "Set the default log level to `info` if the `RUST_LOG` environment variable is not specified. This change ensures that logging is configured with a default level when no specific level is provided, making the application's logging behavior more predictable.",
      "url": "https://github.com/terror/mcgill.courses/pull/361",
      "merged_at": "2023-08-11T00:00:52Z"
    },
    {
      "number": 360,
      "summary": "Ensure that the `ca-certificates` package is installed in the Dockerfile to improve security and enable secure communication within containers.",
      "url": "https://github.com/terror/mcgill.courses/pull/360",
      "merged_at": "2023-08-10T23:33:37Z"
    },
    {
      "number": 359,
      "summary": "Update the code to use the more secure Rustls library with the Rusoto crate, enhancing security and reliability when making network requests.",
      "url": "https://github.com/terror/mcgill.courses/pull/359",
      "merged_at": "2023-08-10T23:10:41Z"
    },
    {
      "number": 357,
      "summary": "Implement building code for the shorthand `ARMST` to improve efficiency and readability when working with ARM templates in Azure DevOps pipelines. This update streamlines the process of referencing ARM templates in pipelines, making it easier for developers to deploy infrastructure as code on the Azure platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/357",
      "merged_at": "2023-08-10T03:13:39Z"
    },
    {
      "number": 356,
      "summary": "Improve performance by updating the source hash check to only compute during initialization, reducing unnecessary processing during runtime.",
      "url": "https://github.com/terror/mcgill.courses/pull/356",
      "merged_at": "2023-08-10T03:07:43Z"
    },
    {
      "number": 355,
      "summary": "Store source hash in S3 to track changes between deployments in production environment, optimizing seeding process and reducing unnecessary data transfers. This ensures that only changed sources are updated, enhancing efficiency and minimizing resources usage.",
      "url": "https://github.com/terror/mcgill.courses/pull/355",
      "merged_at": "2023-08-10T02:55:28Z"
    },
    {
      "number": 353,
      "summary": "Improve efficiency by only re-initializing the database if there's a change in the source hash, reducing unnecessary resets and optimizing performance.",
      "url": "https://github.com/terror/mcgill.courses/pull/353",
      "merged_at": "2023-08-06T17:26:21Z"
    },
    {
      "number": 352,
      "summary": "Enhance the parsing functionality by enabling the extraction of HTML documents from requirement text once it is prefixed. This improvement allows for better organization and clarity when working with requirements in the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/352",
      "merged_at": "2023-08-06T15:47:52Z"
    },
    {
      "number": 351,
      "summary": "Refactoring the codebase by removing extension traits in the extractor to simplify and streamline the functionality. This change aims to improve code readability and maintenance.",
      "url": "https://github.com/terror/mcgill.courses/pull/351",
      "merged_at": "2023-08-06T15:39:57Z"
    },
    {
      "number": 350,
      "summary": "Introducing verification for Azure in this update, ensuring accuracy and security in the authentication process. This new feature enhances the overall reliability and usability of the platform when connecting to Azure services.",
      "url": "https://github.com/terror/mcgill.courses/pull/350",
      "merged_at": "2023-08-05T03:07:37Z"
    },
    {
      "number": 343,
      "summary": "Integrate LLM to accurately parse and analyze course requirements, ensuring efficient and precise processing of data for improved user experience in the educational platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/343",
      "merged_at": "2023-08-05T03:05:45Z"
    }
  ],
  "June 2023": [
    {
      "number": 328,
      "summary": "Updated the project dependencies to ensure improved performance, security, and compatibility with other libraries and tools. This update is essential for maintaining the stability and reliability of the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/328",
      "merged_at": "2023-06-25T02:04:09Z"
    },
    {
      "number": 327,
      "summary": "Decreases the size of the index header text on small screens to improve readability and user experience. This change will ensure that the header text fits better on smaller devices, making it easier to navigate and access content on mobile devices.",
      "url": "https://github.com/terror/mcgill.courses/pull/327",
      "merged_at": "2023-06-23T03:02:27Z"
    },
    {
      "number": 325,
      "summary": "Ensure that review interactions are only shown for existing reviews and remove interactions associated with deleted reviews to prevent confusion and improve user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/325",
      "merged_at": "2023-06-23T00:20:53Z"
    },
    {
      "number": 321,
      "summary": "Filtering out reviews array to remove deleted reviews and ensure accurate data is displayed to users. This pull request ensures that the reviews presented to users are up-to-date and reflect the current state of the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/321",
      "merged_at": "2023-06-22T23:48:57Z"
    },
    {
      "number": 320,
      "summary": "This pull request adds a layout to the spinner displayed on the course page, providing a more visually appealing and user-friendly loading experience for website visitors.",
      "url": "https://github.com/terror/mcgill.courses/pull/320",
      "merged_at": "2023-06-22T23:45:44Z"
    },
    {
      "number": 318,
      "summary": "This pull request adds a loading indicator to the instructor page, so users can now see when the content is being loaded. This will provide a better user experience and make it clearer that the page is still loading.",
      "url": "https://github.com/terror/mcgill.courses/pull/318",
      "merged_at": "2023-06-22T23:13:12Z"
    },
    {
      "number": 313,
      "summary": "Introduces a reset button to the review filter box on the website to easily clear any applied filters and view all reviews. This makes it more user-friendly and convenient for visitors to manage their review filtering options.",
      "url": "https://github.com/terror/mcgill.courses/pull/313",
      "merged_at": "2023-06-22T00:26:19Z"
    },
    {
      "number": 311,
      "summary": "Ensure a consistent layout for all course pages by updating styling and design elements to improve user experience and navigation.",
      "url": "https://github.com/terror/mcgill.courses/pull/311",
      "merged_at": "2023-06-22T00:08:56Z"
    },
    {
      "number": 309,
      "summary": "Enhances the layout of the webpage by removing horizontal lines that appeared below header texts, creating a cleaner and more streamlined design for improved user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/309",
      "merged_at": "2023-06-21T23:52:51Z"
    },
    {
      "number": 305,
      "summary": "Include a new section in the readme file to showcase similar projects for reference and inspiration. This addition enhances the understanding and context of the project for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/305",
      "merged_at": "2023-06-21T04:52:41Z"
    },
    {
      "number": 300,
      "summary": "This pull request removes the 'rmp-scraper' package from version control, leading to a cleaner and more streamlined codebase without this unnecessary dependency. This change helps to simplify the project and reduces potential issues related to managing external packages.",
      "url": "https://github.com/terror/mcgill.courses/pull/300",
      "merged_at": "2023-06-21T04:07:44Z"
    },
    {
      "number": 299,
      "summary": "Enable requesting access tokens with added security by implementing transport layer security to encrypt communication between the application and the server. This update enhances the secure transmission of sensitive data during the authentication process for increased data protection.",
      "url": "https://github.com/terror/mcgill.courses/pull/299",
      "merged_at": "2023-06-21T03:25:14Z"
    },
    {
      "number": 298,
      "summary": "Introduce necessary configurations and scripts for deploying the project to a server, making it easier to launch and manage the application after development. This includes setting up a deployment pipeline to streamline the deployment process.",
      "url": "https://github.com/terror/mcgill.courses/pull/298",
      "merged_at": "2023-06-21T00:24:04Z"
    },
    {
      "number": 249,
      "summary": "Introducing a new feature that allows users to sort course reviews by orders, filter reviews by specific instructors, and filter reviews based on ratings. These changes aim to provide users with more customization options when browsing course feedback.",
      "url": "https://github.com/terror/mcgill.courses/pull/249",
      "merged_at": "2023-06-19T02:57:10Z"
    },
    {
      "number": 293,
      "summary": "Update the project to use typescript-eslint for improved code quality and consistency. This change ensures that the codebase is checked against a stricter set of rules provided by typescript-eslint, leading to better readability and maintainability of the code.",
      "url": "https://github.com/terror/mcgill.courses/pull/293",
      "merged_at": "2023-06-19T02:04:18Z"
    },
    {
      "number": 292,
      "summary": "Improve user experience by fixing the stutter that occurs when closing dialogs, enhancing the overall interaction with the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/292",
      "merged_at": "2023-06-19T00:11:26Z"
    },
    {
      "number": 290,
      "summary": "Resolved an issue where invisible text was showing up on the schedule display. This one-line fix ensures that all text is now visible as intended.",
      "url": "https://github.com/terror/mcgill.courses/pull/290",
      "merged_at": "2023-06-18T21:47:43Z"
    },
    {
      "number": 288,
      "summary": "Introduce lint-staged to streamline the code review process by running linters automatically before committing changes. This pull request sets up lint-staged to enforce code quality checks and formatting rules when files are staged for commit, improving the overall code consistency and reliability in the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/288",
      "merged_at": "2023-06-18T03:52:03Z"
    },
    {
      "number": 287,
      "summary": "Ensure that the code is properly formatted by automatically running formatting before each commit. This helps maintain consistency and readability throughout the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/287",
      "merged_at": "2023-06-18T03:19:42Z"
    },
    {
      "number": 285,
      "summary": "Ensure that the review validation system acknowledges catch-all instructors, improving accuracy and inclusivity in the review process.",
      "url": "https://github.com/terror/mcgill.courses/pull/285",
      "merged_at": "2023-06-18T01:46:34Z"
    },
    {
      "number": 283,
      "summary": "Introduces a prompt for users who are not logged in when attempting to like a review, guiding them to log in for the action.",
      "url": "https://github.com/terror/mcgill.courses/pull/283",
      "merged_at": "2023-06-17T15:40:05Z"
    },
    {
      "number": 281,
      "summary": "Introduce server test to enhance the review process by enabling team members to interact with the review system efficiently.",
      "url": "https://github.com/terror/mcgill.courses/pull/281",
      "merged_at": "2023-06-17T01:39:41Z"
    },
    {
      "number": 278,
      "summary": "Improve testing coverage for the backend code to ensure all functionalities are thoroughly tested and minimize the potential for bugs or errors in the system. This pull request introduces new tests and enhances existing ones to provide better code quality and reliability.",
      "url": "https://github.com/terror/mcgill.courses/pull/278",
      "merged_at": "2023-06-16T04:44:13Z"
    },
    {
      "number": 277,
      "summary": "Introducing a new feature that allows users to like and dislike reviews on the platform for better engagement and feedback collection. This pull request enhances user interaction and provides valuable insights to the reviewers.",
      "url": "https://github.com/terror/mcgill.courses/pull/277",
      "merged_at": "2023-06-16T04:31:42Z"
    },
    {
      "number": 276,
      "summary": "Refactored the code to separate database initialization logic into its own module for better organization and readability. This change helps improve the maintainability and scalability of the project by isolating database-related functions.",
      "url": "https://github.com/terror/mcgill.courses/pull/276",
      "merged_at": "2023-06-12T20:35:23Z"
    },
    {
      "number": 271,
      "summary": "Improve the accuracy of the e-calendar by matching external professor names to their corresponding entries. This change ensures that all professor names are correctly synced with the e-calendar, providing users with up-to-date and accurate information on professor schedules.",
      "url": "https://github.com/terror/mcgill.courses/pull/271",
      "merged_at": "2023-06-12T15:11:32Z"
    },
    {
      "number": 273,
      "summary": "Enhance the visual appearance of the explore page by removing borders from the cards, providing a cleaner and more modern look for a better user experience. This change aims to create a more streamlined and visually appealing layout for the explore page.",
      "url": "https://github.com/terror/mcgill.courses/pull/273",
      "merged_at": "2023-06-12T04:06:53Z"
    },
    {
      "number": 274,
      "summary": "Streamline the process of populating database with initial data by simplifying the steps in the pipeline.",
      "url": "https://github.com/terror/mcgill.courses/pull/274",
      "merged_at": "2023-06-12T03:56:47Z"
    },
    {
      "number": 265,
      "summary": "Ensure that only authorized instructors can add or edit reviews on the backend, enhancing the security of the system and preventing unauthorized users from manipulating review data.",
      "url": "https://github.com/terror/mcgill.courses/pull/265",
      "merged_at": "2023-06-12T00:27:59Z"
    },
    {
      "number": 270,
      "summary": "Introducing a new feature that adds a sidebar overlay to improve navigation and accessibility on the website. This change ensures that users can easily access important information while browsing through different pages.",
      "url": "https://github.com/terror/mcgill.courses/pull/270",
      "merged_at": "2023-06-11T21:35:49Z"
    },
    {
      "number": 261,
      "summary": "Ensure that terms are displayed correctly on course cards in the explore page even when they are not currently available. Also, includes code formatting improvements.",
      "url": "https://github.com/terror/mcgill.courses/pull/261",
      "merged_at": "2023-06-10T19:12:03Z"
    },
    {
      "number": 258,
      "summary": "Enable users to choose whether to run database seeding operations concurrently, offering a way to speed up the process for those who prefer it without affecting the default behavior.",
      "url": "https://github.com/terror/mcgill.courses/pull/258",
      "merged_at": "2023-06-10T05:57:38Z"
    },
    {
      "number": 257,
      "summary": "Introducing a new feature in the form of a difficulty pie chart to visually represent course difficulty levels. The chart is fully responsive, ensuring optimal viewing experience across different devices. This addition aims to provide users with a quick and easy way to gauge the difficulty of courses at a glance. Happy exploring!",
      "url": "https://github.com/terror/mcgill.courses/pull/257",
      "merged_at": "2023-06-10T05:19:31Z"
    },
    {
      "number": 259,
      "summary": "Enhance functionality by verifying if the instructor is included in the list of review instructors before performing specific actions. This change ensures that only designated individuals can carry out certain tasks, providing more control and security within the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/259",
      "merged_at": "2023-06-05T00:39:09Z"
    },
    {
      "number": 256,
      "summary": "Improve the code quality by preventing the declaration of unused variables in the client-side JavaScript code. This change helps developers write cleaner and more efficient code by enforcing best practices during development.",
      "url": "https://github.com/terror/mcgill.courses/pull/256",
      "merged_at": "2023-06-04T04:59:24Z"
    },
    {
      "number": 254,
      "summary": "Allow multiple instructors to be selected when submitting a review in the form. This change enables students to choose more than one instructor for feedback, providing a more inclusive and flexible review process.",
      "url": "https://github.com/terror/mcgill.courses/pull/254",
      "merged_at": "2023-06-04T04:33:06Z"
    }
  ]
}
