{
  "January 2025": [
    {
      "number": 631,
      "summary": "Updated the web scraping script to re-scrape course data for the academic year 2024-2025. This change ensures that the latest and most accurate information is available for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/631",
      "merged_at": "2025-01-27T05:11:24Z"
    },
    {
      "number": 626,
      "summary": "Updated the schedule display to automatically select the current term, eliminating the need to manually choose it. This change simplifies the process for users, ensuring they view information for the ongoing term by default.",
      "url": "https://github.com/terror/mcgill.courses/pull/626",
      "merged_at": "2025-01-11T18:03:23Z"
    },
    {
      "number": 624,
      "summary": "Updated the functionality to verify the presence of search results before processing the enter keydown event, preventing navigation to non-existent pages from the search bar.",
      "url": "https://github.com/terror/mcgill.courses/pull/624",
      "merged_at": "2025-01-09T03:57:09Z"
    },
    {
      "number": 623,
      "summary": "Added functionality to use LinkedIn profiles to display team members' pictures on the about page, improving the visual appeal and credibility of the team section.",
      "url": "https://github.com/terror/mcgill.courses/pull/623",
      "merged_at": "2025-01-05T00:09:06Z"
    }
  ],
  "August 2024": [
    {
      "number": 598,
      "summary": "Improved the hover styling on the profile dropdown menu for a more visually appealing user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/598",
      "merged_at": "2024-08-28T18:02:12Z"
    }
  ],
  "June 2023": [
    {
      "number": 328,
      "summary": "Updated dependencies to ensure the app runs smoothly and securely with the latest versions of third-party libraries.",
      "url": "https://github.com/terror/mcgill.courses/pull/328",
      "merged_at": "2023-06-25T02:04:09Z"
    },
    {
      "number": 327,
      "summary": "Decreased the size of the index header text to improve readability on small screens.",
      "url": "https://github.com/terror/mcgill.courses/pull/327",
      "merged_at": "2023-06-23T03:02:27Z"
    },
    {
      "number": 325,
      "summary": "Removed the ability for users to interact with reviews that have been deleted. This change ensures a more accurate representation of the review process and prevents any confusion or errors that may arise from interacting with removed reviews.",
      "url": "https://github.com/terror/mcgill.courses/pull/325",
      "merged_at": "2023-06-23T00:20:53Z"
    },
    {
      "number": 321,
      "summary": "Filtered out the reviews array after a deletion to ensure accurate data display. Made changes to prevent deleted reviews from being shown in the user interface.",
      "url": "https://github.com/terror/mcgill.courses/pull/321",
      "merged_at": "2023-06-22T23:48:57Z"
    },
    {
      "number": 320,
      "summary": "Added a layout to the course page spinner, providing a more visually appealing loading experience for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/320",
      "merged_at": "2023-06-22T23:45:44Z"
    },
    {
      "number": 318,
      "summary": "Added a loading indicator to the instructor page for better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/318",
      "merged_at": "2023-06-22T23:13:12Z"
    },
    {
      "number": 313,
      "summary": "Added a reset button to the review filter box, allowing users to easily clear all filters applied to the reviews. This new feature enhances user experience by providing a convenient way to start fresh when searching for specific reviews.",
      "url": "https://github.com/terror/mcgill.courses/pull/313",
      "merged_at": "2023-06-22T00:26:19Z"
    },
    {
      "number": 311,
      "summary": "Ensured all course pages followed a uniform layout by standardizing fonts, colors, and spacing. This update improves user experience and enhances the overall visual consistency of the course platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/311",
      "merged_at": "2023-06-22T00:08:56Z"
    },
    {
      "number": 309,
      "summary": "Removed horizontal rules that were under the header text for a cleaner and more streamlined layout.",
      "url": "https://github.com/terror/mcgill.courses/pull/309",
      "merged_at": "2023-06-21T23:52:51Z"
    },
    {
      "number": 305,
      "summary": "Added a \"Prior Art\" section to the readme file. This section highlights existing work that inspired the project and provides context for its development.",
      "url": "https://github.com/terror/mcgill.courses/pull/305",
      "merged_at": "2023-06-21T04:52:41Z"
    },
    {
      "number": 300,
      "summary": "Removed the rmp-scraper tool from version control, as it is no longer necessary for project development.",
      "url": "https://github.com/terror/mcgill.courses/pull/300",
      "merged_at": "2023-06-21T04:07:44Z"
    },
    {
      "number": 299,
      "summary": "Implemented the functionality to request an access token with transport layer security in API calls. The changes ensure that all sensitive data is transmitted securely to and from the server, enhancing the overall security of the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/299",
      "merged_at": "2023-06-21T03:25:14Z"
    },
    {
      "number": 298,
      "summary": "Implemented automated deployment setup using CI/CD pipelines. Integrated continuous integration and continuous deployment processes to streamline the deployment workflow and ensure rapid and secure releases.",
      "url": "https://github.com/terror/mcgill.courses/pull/298",
      "merged_at": "2023-06-21T00:24:04Z"
    },
    {
      "number": 249,
      "summary": "Added functionality to sort course reviews by orders, filter reviews by specific instructors, and also filter reviews by ratings. Various miscellaneous improvements were made as well.",
      "url": "https://github.com/terror/mcgill.courses/pull/249",
      "merged_at": "2023-06-19T02:57:10Z"
    },
    {
      "number": 293,
      "summary": "Switched the project to use typescript-eslint for improved linting and error checking. Made necessary configuration changes to ensure consistent code quality and adherence to TypeScript best practices.",
      "url": "https://github.com/terror/mcgill.courses/pull/293",
      "merged_at": "2023-06-19T02:04:18Z"
    },
    {
      "number": 292,
      "summary": "Fixed an issue where dialogs would stutter when closing them. Made adjustments to improve dialog closing animation smoothness.",
      "url": "https://github.com/terror/mcgill.courses/pull/292",
      "merged_at": "2023-06-19T00:11:26Z"
    },
    {
      "number": 290,
      "summary": "Fixed an issue where invisible text was displayed in the schedule.",
      "url": "https://github.com/terror/mcgill.courses/pull/290",
      "merged_at": "2023-06-18T21:47:43Z"
    },
    {
      "number": 288,
      "summary": "Added lint-staged configuration to enforce code formatting and style checks before committing changes. This ensures that code quality is maintained and consistent across the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/288",
      "merged_at": "2023-06-18T03:52:03Z"
    },
    {
      "number": 287,
      "summary": "Ran a code formatting tool before each commit to ensure consistent coding style throughout the project. This change helps maintain clean and readable code in the repository.",
      "url": "https://github.com/terror/mcgill.courses/pull/287",
      "merged_at": "2023-06-18T03:19:42Z"
    },
    {
      "number": 285,
      "summary": "Updated the validation logic to account for scenarios where there is a catch-all instructor in reviews. This ensures that all instructors are correctly validated, improving the accuracy of the review process.",
      "url": "https://github.com/terror/mcgill.courses/pull/285",
      "merged_at": "2023-06-18T01:46:34Z"
    },
    {
      "number": 283,
      "summary": "Added a prompt for non-logged-in users when attempting to like a review. This improvement ensures that users who are not logged in are notified and prompted to log in before liking a review on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/283",
      "merged_at": "2023-06-17T15:40:05Z"
    },
    {
      "number": 281,
      "summary": "Added a server test to review interactions. This change ensures that the review process is thoroughly tested and functioning correctly on the server side.",
      "url": "https://github.com/terror/mcgill.courses/pull/281",
      "merged_at": "2023-06-17T01:39:41Z"
    },
    {
      "number": 278,
      "summary": "Added backend code coverage to improve tracking and visibility of test coverage for the project. Additionally, a code coverage report is now generated and can be viewed to assess testing effectiveness.",
      "url": "https://github.com/terror/mcgill.courses/pull/278",
      "merged_at": "2023-06-16T04:44:13Z"
    },
    {
      "number": 277,
      "summary": "Implemented the ability for users to like and dislike reviews on the platform. This feature allows users to express their opinions on the reviews they come across, providing valuable feedback to the community.",
      "url": "https://github.com/terror/mcgill.courses/pull/277",
      "merged_at": "2023-06-16T04:31:42Z"
    },
    {
      "number": 276,
      "summary": "Refactored the code to separate database initialization logic from other components for better organization and clarity in the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/276",
      "merged_at": "2023-06-12T20:35:23Z"
    },
    {
      "number": 271,
      "summary": "Updated the system to match external professor names with those in the e-calendar, ensuring accurate scheduling for all faculty members.",
      "url": "https://github.com/terror/mcgill.courses/pull/271",
      "merged_at": "2023-06-12T15:11:32Z"
    },
    {
      "number": 273,
      "summary": "Removed borders from the cards on the explore page to provide a cleaner and more visually appealing layout.",
      "url": "https://github.com/terror/mcgill.courses/pull/273",
      "merged_at": "2023-06-12T04:06:53Z"
    },
    {
      "number": 274,
      "summary": "Simplified the database seeding process for easier management and maintenance. Removed redundant steps and optimized the workflow for faster and more efficient data population.",
      "url": "https://github.com/terror/mcgill.courses/pull/274",
      "merged_at": "2023-06-12T03:56:47Z"
    },
    {
      "number": 265,
      "summary": "Added validation to ensure that only instructors can add or edit reviews on the backend. This change prevents unauthorized users from manipulating review data.",
      "url": "https://github.com/terror/mcgill.courses/pull/265",
      "merged_at": "2023-06-12T00:27:59Z"
    },
    {
      "number": 270,
      "summary": "Added a sidebar overlay feature for easier navigation on the website. Users can now access the sidebar menu with a click, improving the overall browsing experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/270",
      "merged_at": "2023-06-11T21:35:49Z"
    },
    {
      "number": 261,
      "summary": "Fixed the issue where no terms were displayed on course cards in the explore page when not currently offered. Added a fix to show the terms even if not currently available. Made formatting changes to improve readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/261",
      "merged_at": "2023-06-10T19:12:03Z"
    },
    {
      "number": 258,
      "summary": "Implemented the ability to seed the database using multiple threads, providing an option for faster data population during setup. This enhancement improves efficiency in setting up databases with large amounts of initial data.",
      "url": "https://github.com/terror/mcgill.courses/pull/258",
      "merged_at": "2023-06-10T05:57:38Z"
    },
    {
      "number": 257,
      "summary": "Added a difficulty pie chart feature to the project. The chart displays the difficulty level of courses. Additionally, the feature is fully responsive, ensuring a seamless viewing experience across different devices.",
      "url": "https://github.com/terror/mcgill.courses/pull/257",
      "merged_at": "2023-06-10T05:19:31Z"
    },
    {
      "number": 259,
      "summary": "- Checked if the instructor is included in the review instructors array for enabling review permissions.",
      "url": "https://github.com/terror/mcgill.courses/pull/259",
      "merged_at": "2023-06-05T00:39:09Z"
    },
    {
      "number": 256,
      "summary": "Updated the client-side code to disallow unused variables, improving code quality and reducing potential errors.",
      "url": "https://github.com/terror/mcgill.courses/pull/256",
      "merged_at": "2023-06-04T04:59:24Z"
    },
    {
      "number": 254,
      "summary": "Updated the review form to allow for multiple instructors to be assigned to a review. This change enables better collaboration and feedback from multiple instructors on student work.",
      "url": "https://github.com/terror/mcgill.courses/pull/254",
      "merged_at": "2023-06-04T04:33:06Z"
    }
  ],
  "June 2024": [
    {
      "number": 581,
      "summary": "Updated the scraping process to include data for 2024-2025 and refreshed the search index. Improved settings to prevent rate limit issues in the `just load` feature.",
      "url": "https://github.com/terror/mcgill.courses/pull/581",
      "merged_at": "2024-06-21T16:03:38Z"
    },
    {
      "number": 588,
      "summary": "Updated the course averages data to include Winter 2024 term information. This change ensures that the latest course averages are displayed on the platform for accurate and up-to-date information.",
      "url": "https://github.com/terror/mcgill.courses/pull/588",
      "merged_at": "2024-06-20T14:26:42Z"
    },
    {
      "number": 589,
      "summary": "Removed the version field from the docker compose file to prevent compatibility issues with older versions of Docker Compose. This change simplifies the configuration and ensures smoother deployment of the application across different environments.",
      "url": "https://github.com/terror/mcgill.courses/pull/589",
      "merged_at": "2024-06-20T14:23:04Z"
    },
    {
      "number": 587,
      "summary": "Updated the site's image in the readme file to reflect the latest design and branding guidelines.",
      "url": "https://github.com/terror/mcgill.courses/pull/587",
      "merged_at": "2024-06-18T17:23:17Z"
    },
    {
      "number": 586,
      "summary": "Replaced blue text with a more visible color on the 'Show all' button for better readability in dark mode on the changelog page.",
      "url": "https://github.com/terror/mcgill.courses/pull/586",
      "merged_at": "2024-06-07T04:02:57Z"
    },
    {
      "number": 585,
      "summary": "Updated the text displayed when there is no content on the course page to improve clarity and readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/585",
      "merged_at": "2024-06-06T22:42:04Z"
    },
    {
      "number": 584,
      "summary": "Fixed the issue where courses with no reviews were not displaying the correct empty state message. Updated the code to show a more user-friendly message when there are no reviews available for a course.",
      "url": "https://github.com/terror/mcgill.courses/pull/584",
      "merged_at": "2024-06-05T21:00:24Z"
    },
    {
      "number": 583,
      "summary": "Added the ability for users to expand or collapse changelog entries on the page. This change helps prevent clutter by limiting the display to 5 entries per month.",
      "url": "https://github.com/terror/mcgill.courses/pull/583",
      "merged_at": "2024-06-05T04:21:54Z"
    },
    {
      "number": 578,
      "summary": "Removed the review filter toggle feature from the user interface, simplifying the user experience by eliminating unnecessary options.",
      "url": "https://github.com/terror/mcgill.courses/pull/578",
      "merged_at": "2024-06-03T14:57:28Z"
    }
  ],
  "July 2024": [
    {
      "number": 596,
      "summary": "Added functionality to display course CRNs in schedules for better organization and tracking of courses. Rescraped 2024-2025 courses/schedules to incorporate this update.",
      "url": "https://github.com/terror/mcgill.courses/pull/596",
      "merged_at": "2024-07-26T16:21:05Z"
    },
    {
      "number": 594,
      "summary": "Updated dependencies for the backend and client-side, including Rust, to improve performance and security. Also, added a new recipe to generate the changelog in the justfile.",
      "url": "https://github.com/terror/mcgill.courses/pull/594",
      "merged_at": "2024-07-21T18:30:35Z"
    },
    {
      "number": 592,
      "summary": "Re-parsed the course graphs to accommodate the updated course data. This ensures that the latest information is accurately reflected in the graphs.",
      "url": "https://github.com/terror/mcgill.courses/pull/592",
      "merged_at": "2024-07-10T02:51:07Z"
    }
  ],
  "October 2024": [
    {
      "number": 604,
      "summary": "Simplified the about page content and added subtle animations to improve the page's design and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/604",
      "merged_at": "2024-10-16T23:52:40Z"
    }
  ],
  "March 2024": [
    {
      "number": 497,
      "summary": "Fixed the issue where the reset button was not properly resetting the sort order in the table view. Now, clicking the reset button will correctly revert the table back to the default sorting.",
      "url": "https://github.com/terror/mcgill.courses/pull/497",
      "merged_at": "2024-03-16T04:09:37Z"
    },
    {
      "number": 494,
      "summary": "Added functionality to remember the selected pane on the user profile page, so users can easily navigate back to their preferred view without resetting it each time they visit the page.",
      "url": "https://github.com/terror/mcgill.courses/pull/494",
      "merged_at": "2024-03-11T01:38:25Z"
    },
    {
      "number": 493,
      "summary": "Removed horizontal margins from the explore and profile pages to improve the overall layout and design of the website. This change helped to create a more visually appealing and user-friendly experience for visitors.",
      "url": "https://github.com/terror/mcgill.courses/pull/493",
      "merged_at": "2024-03-11T01:19:23Z"
    },
    {
      "number": 467,
      "summary": "Implemented rate limiting to prevent excessive requests and ensure a fair usage of resources. This change helps to protect the server from potential abuse and improve overall system performance.",
      "url": "https://github.com/terror/mcgill.courses/pull/467",
      "merged_at": "2024-03-08T17:11:27Z"
    }
  ],
  "December 2023": [
    {
      "number": 481,
      "summary": "Adjusted the styles for the instructors page to improve readability and consistency across the website. Fixed alignment issues and updated font sizes for better user experience. Made the necessary changes to enhance the overall look and feel of the instructors section on the site.",
      "url": "https://github.com/terror/mcgill.courses/pull/481",
      "merged_at": "2023-12-23T00:36:51Z"
    },
    {
      "number": 291,
      "summary": "Added privacy policy and terms of service to the website. Eliminated the footer for small screens and resolved an issue where the side navigation did not close when clicking on the current page.",
      "url": "https://github.com/terror/mcgill.courses/pull/291",
      "merged_at": "2023-12-22T21:44:09Z"
    },
    {
      "number": 480,
      "summary": "Refined the process of parsing course requirements by utilizing a fine-tuned LLM model for increased accuracy and efficiency.",
      "url": "https://github.com/terror/mcgill.courses/pull/480",
      "merged_at": "2023-12-22T02:00:47Z"
    },
    {
      "number": 470,
      "summary": "Made miscellaneous style tweaks to various parts of the app, focusing on the profile page, mobile explore feature, and empty states for course pages. These changes enhanced the visual appeal and user experience of the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/470",
      "merged_at": "2023-12-21T04:16:22Z"
    },
    {
      "number": 471,
      "summary": "Cleared the search query automatically after selecting a result. This change ensures a smoother user experience by removing the previously entered search term, making it easier to start a new search without manually clearing the input field.",
      "url": "https://github.com/terror/mcgill.courses/pull/471",
      "merged_at": "2023-12-21T00:42:52Z"
    },
    {
      "number": 476,
      "summary": "Improved the styling of the review form by updating the CSS, making it more visually appealing and user-friendly. Additionally, adjusted the layout for better readability and alignment of elements.",
      "url": "https://github.com/terror/mcgill.courses/pull/476",
      "merged_at": "2023-12-21T00:35:17Z"
    },
    {
      "number": 478,
      "summary": "Adjusted the styles in the navbar to improve readability and align with the overall design of the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/478",
      "merged_at": "2023-12-21T00:29:19Z"
    },
    {
      "number": 477,
      "summary": "Fixed the alignment issue on the location display in schedules, ensuring a more visually appealing layout for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/477",
      "merged_at": "2023-12-20T21:36:08Z"
    },
    {
      "number": 479,
      "summary": "Removed graph animation feature to improve transitions and make them smoother and less janky.",
      "url": "https://github.com/terror/mcgill.courses/pull/479",
      "merged_at": "2023-12-20T21:32:02Z"
    },
    {
      "number": 475,
      "summary": "Added linting rule to flag incorrect usage of the console object in the codebase. This change helps maintain consistency and best practices in the project by catching potential errors and promoting cleaner code.",
      "url": "https://github.com/terror/mcgill.courses/pull/475",
      "merged_at": "2023-12-19T23:57:20Z"
    },
    {
      "number": 473,
      "summary": "Reduced the size of text in the 'About' section to make it more concise and easier to read.",
      "url": "https://github.com/terror/mcgill.courses/pull/473",
      "merged_at": "2023-12-19T23:09:41Z"
    },
    {
      "number": 474,
      "summary": "Fixed the display issue causing weird search result icons on mobile devices. Now, the icons are properly aligned and no longer overlap with text on smaller screens.",
      "url": "https://github.com/terror/mcgill.courses/pull/474",
      "merged_at": "2023-12-19T03:07:31Z"
    },
    {
      "number": 469,
      "summary": "Fixed the inconsistent hover animation duration of the explore button in the course search bar. The hover effect now runs smoothly and consistently, enhancing the user experience while interacting with the search feature.",
      "url": "https://github.com/terror/mcgill.courses/pull/469",
      "merged_at": "2023-12-19T02:02:40Z"
    },
    {
      "number": 468,
      "summary": "Updated the file hosting process for Azure identity to ensure proper functionality. Fixed issues related to file hosting for Azure identity.",
      "url": "https://github.com/terror/mcgill.courses/pull/468",
      "merged_at": "2023-12-10T01:31:44Z"
    },
    {
      "number": 466,
      "summary": "Implemented a logging middleware to track requests and responses on the server. This change enhances monitoring and debugging capabilities for better server management.",
      "url": "https://github.com/terror/mcgill.courses/pull/466",
      "merged_at": "2023-12-10T01:29:04Z"
    }
  ],
  "September 2023": [
    {
      "number": 436,
      "summary": "Restructured content on the about page for improved readability and organization. Added new sections and updated existing information to provide a better user experience and clearer navigation.",
      "url": "https://github.com/terror/mcgill.courses/pull/436",
      "merged_at": "2023-09-29T16:52:41Z"
    },
    {
      "number": 437,
      "summary": "Added skeleton loading animations to the explore page to provide a visual indication to users while the content is being fetched. This change enhances the user experience by reducing uncertainty and wait times.",
      "url": "https://github.com/terror/mcgill.courses/pull/437",
      "merged_at": "2023-09-29T16:51:35Z"
    },
    {
      "number": 434,
      "summary": "Added a content label to review cards and evenly distributed margins to improve the layout and visual appeal.",
      "url": "https://github.com/terror/mcgill.courses/pull/434",
      "merged_at": "2023-09-27T18:35:46Z"
    },
    {
      "number": 432,
      "summary": "Added a link to the course page on the user's profile when they subscribe to a course. This change provides users with quick and easy access to their enrolled courses directly from their profile page.",
      "url": "https://github.com/terror/mcgill.courses/pull/432",
      "merged_at": "2023-09-27T17:13:31Z"
    },
    {
      "number": 431,
      "summary": "Changed the color of the notification dot to red for better visibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/431",
      "merged_at": "2023-09-27T03:08:04Z"
    },
    {
      "number": 426,
      "summary": "Adjusted the styles of explore filter for improved visual consistency.",
      "url": "https://github.com/terror/mcgill.courses/pull/426",
      "merged_at": "2023-09-26T04:10:42Z"
    },
    {
      "number": 429,
      "summary": "Added support for integrating Google Analytics tracking code into the website to gather insights on website traffic and user behavior. This change allows the website owner to track and analyze visitor interactions, helping to optimize content and improve user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/429",
      "merged_at": "2023-09-26T03:43:03Z"
    },
    {
      "number": 371,
      "summary": "Implemented a notification system to alert users of new course reviews. Users will now receive notifications when a new review is posted for a course they are interested in. This enhancement aims to keep users informed and engaged with the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/371",
      "merged_at": "2023-09-26T02:53:18Z"
    },
    {
      "number": 428,
      "summary": "Updated the Dockerfile to use pnpm instead of npm for package management. This change aims to optimize the build process and reduce image size by taking advantage of pnpm's efficient package caching and deduplication capabilities.",
      "url": "https://github.com/terror/mcgill.courses/pull/428",
      "merged_at": "2023-09-25T18:40:48Z"
    },
    {
      "number": 427,
      "summary": "Switched the package manager to pnpm and updated all packages to their latest versions. This change improves dependency management and ensures better performance and security for the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/427",
      "merged_at": "2023-09-25T18:01:23Z"
    },
    {
      "number": 425,
      "summary": "Fixed an issue where a bird image was getting squished in the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/425",
      "merged_at": "2023-09-23T17:27:53Z"
    },
    {
      "number": 424,
      "summary": "Added a date tooltip to the review card, providing users with a clear indication of when the review was conducted. This change enhances the user experience by offering more context and transparency within the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/424",
      "merged_at": "2023-09-22T20:26:07Z"
    },
    {
      "number": 422,
      "summary": "Added support for displaying a histogram on smaller screens to improve user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/422",
      "merged_at": "2023-09-22T20:25:38Z"
    },
    {
      "number": 419,
      "summary": "Improved the styling of the explore filter to enhance user experience and make it more visually appealing. Made changes to the CSS to ensure a more user-friendly and cohesive design throughout the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/419",
      "merged_at": "2023-09-21T03:02:44Z"
    },
    {
      "number": 416,
      "summary": "Replaced the old notification system with Sonner Toast for a more user-friendly and modern experience. Notifications now appear in a cleaner and more engaging way, leading to improved user interaction and satisfaction.",
      "url": "https://github.com/terror/mcgill.courses/pull/416",
      "merged_at": "2023-09-16T17:44:14Z"
    },
    {
      "number": 418,
      "summary": "Updated the Docker image to use the 1.70 version of Rust Buster for improved performance and compatibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/418",
      "merged_at": "2023-09-16T15:33:35Z"
    },
    {
      "number": 417,
      "summary": "Added a feature to display a toast notification when saving review drafts. This change improves user experience by providing visual feedback when the draft is successfully saved.",
      "url": "https://github.com/terror/mcgill.courses/pull/417",
      "merged_at": "2023-09-16T05:59:02Z"
    },
    {
      "number": 415,
      "summary": "Updated dependencies to ensure the latest versions are being used for improved performance and security.",
      "url": "https://github.com/terror/mcgill.courses/pull/415",
      "merged_at": "2023-09-16T05:17:54Z"
    },
    {
      "number": 414,
      "summary": "Improved the colors of the footer and course page filters in light mode for better visibility and aesthetics.",
      "url": "https://github.com/terror/mcgill.courses/pull/414",
      "merged_at": "2023-09-15T18:50:56Z"
    },
    {
      "number": 412,
      "summary": "Fixed an issue where the schedule display text would overflow if too long. Improved the text wrapping functionality to ensure all text is visible within the allocated space.",
      "url": "https://github.com/terror/mcgill.courses/pull/412",
      "merged_at": "2023-09-15T15:00:04Z"
    },
    {
      "number": 409,
      "summary": "Added an empty state feature to the instructor/course page to provide a clear message when no courses are available. This change improves user experience by guiding users on what to do next when there are no courses to display.",
      "url": "https://github.com/terror/mcgill.courses/pull/409",
      "merged_at": "2023-09-14T04:18:22Z"
    },
    {
      "number": 411,
      "summary": "Fixed the issue with the review display on the instructor page by adjusting the layout and styling to ensure all information is properly presented and aligned.",
      "url": "https://github.com/terror/mcgill.courses/pull/411",
      "merged_at": "2023-09-14T04:15:39Z"
    },
    {
      "number": 406,
      "summary": "Removed schedule information from `courses-2022-2023.json` and added `leadingTo` information for a clearer understanding of the courses. This change was made to streamline the data and enhance course relevance.",
      "url": "https://github.com/terror/mcgill.courses/pull/406",
      "merged_at": "2023-09-10T16:47:43Z"
    },
    {
      "number": 405,
      "summary": "Increased the rounded border at the bottom of the last course review for a more polished design.",
      "url": "https://github.com/terror/mcgill.courses/pull/405",
      "merged_at": "2023-09-10T16:31:48Z"
    },
    {
      "number": 404,
      "summary": "Updated the image used on the course page in the readme file to provide a more relevant and visually appealing representation of the course content.",
      "url": "https://github.com/terror/mcgill.courses/pull/404",
      "merged_at": "2023-09-10T16:05:29Z"
    },
    {
      "number": 403,
      "summary": "Removed the background color of the FAQ section on the about page to improve the overall design and readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/403",
      "merged_at": "2023-09-10T15:54:02Z"
    },
    {
      "number": 402,
      "summary": "Added a pin icon to the user review section for better organization and visibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/402",
      "merged_at": "2023-09-10T04:06:17Z"
    },
    {
      "number": 401,
      "summary": "Replaced the icons used in the review form for ratings and difficulty levels. The new icons provide a more intuitive and visually appealing user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/401",
      "merged_at": "2023-09-10T04:03:15Z"
    },
    {
      "number": 398,
      "summary": "Updated the light color scheme by modifying the shades of white and cream to enhance readability and aesthetics.",
      "url": "https://github.com/terror/mcgill.courses/pull/398",
      "merged_at": "2023-09-09T20:13:57Z"
    },
    {
      "number": 400,
      "summary": "Revamped the instructor page to align with the style of the course page. This included updating the layout, color scheme, and font to create a cohesive design across all pages. These changes provide a seamless user experience and a consistent look and feel throughout the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/400",
      "merged_at": "2023-09-09T20:12:06Z"
    },
    {
      "number": 399,
      "summary": "Corrected a typo that was present in the code.",
      "url": "https://github.com/terror/mcgill.courses/pull/399",
      "merged_at": "2023-09-07T15:03:40Z"
    },
    {
      "number": 397,
      "summary": "Added a highlight feature to showcase the review card course on the instructor page.",
      "url": "https://github.com/terror/mcgill.courses/pull/397",
      "merged_at": "2023-09-06T15:38:53Z"
    },
    {
      "number": 396,
      "summary": "Ensured that the fillbar is properly rounded out when it reaches its maximum capacity.",
      "url": "https://github.com/terror/mcgill.courses/pull/396",
      "merged_at": "2023-09-04T21:52:08Z"
    },
    {
      "number": 395,
      "summary": "Updated the code to ensure that statistics accurately reflect changes made when the professor in a review filter is updated.",
      "url": "https://github.com/terror/mcgill.courses/pull/395",
      "merged_at": "2023-09-04T21:51:08Z"
    },
    {
      "number": 394,
      "summary": "Fixed an issue where the graph was not updating correctly when toggling review forms on and off. The code was adjusted to ensure that the graph rerenders accurately in all situations, providing a smooth user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/394",
      "merged_at": "2023-09-04T19:56:39Z"
    },
    {
      "number": 391,
      "summary": "Added a tooltip to display review counts on histograms, allowing users to easily see the number of reviews for each data point. This enhancement improves data visualization and user experience by providing more context and insights at a glance.",
      "url": "https://github.com/terror/mcgill.courses/pull/391",
      "merged_at": "2023-09-04T19:49:45Z"
    },
    {
      "number": 374,
      "summary": "Updated the course requirements for MATH 478 to include a new mandatory project component and clarified grading criteria.",
      "url": "https://github.com/terror/mcgill.courses/pull/374",
      "merged_at": "2023-09-04T02:32:01Z"
    },
    {
      "number": 366,
      "summary": "Improved the user interface design for displaying course information. Updated styling, layout, and color scheme to enhance readability and aesthetics. Incorporated user feedback to make the information more accessible and visually appealing.",
      "url": "https://github.com/terror/mcgill.courses/pull/366",
      "merged_at": "2023-09-04T02:30:42Z"
    }
  ],
  "April 2024": [
    {
      "number": 544,
      "summary": "Added tests to ensure the proper functioning of the new database methods that were recently introduced. The tests cover different scenarios and edge cases to validate the reliability and accuracy of the database operations. The addition of these tests will help maintain the stability and consistency of the database functionality.",
      "url": "https://github.com/terror/mcgill.courses/pull/544",
      "merged_at": "2024-04-28T19:52:58Z"
    },
    {
      "number": 543,
      "summary": "Reduced image sizes and optimized code to speed up the loading time of the review page.",
      "url": "https://github.com/terror/mcgill.courses/pull/543",
      "merged_at": "2024-04-28T17:45:31Z"
    },
    {
      "number": 542,
      "summary": "Added a deployment section to the readme to provide clear instructions on how to deploy the application. This change aims to help users easily set up and run the project on their own servers or hosting platforms.",
      "url": "https://github.com/terror/mcgill.courses/pull/542",
      "merged_at": "2024-04-25T18:00:32Z"
    },
    {
      "number": 540,
      "summary": "Added a loading indicator to the profile page to provide visual feedback to users while fetching data.",
      "url": "https://github.com/terror/mcgill.courses/pull/540",
      "merged_at": "2024-04-25T14:53:35Z"
    },
    {
      "number": 539,
      "summary": "Adjusted the profile page to sort user reviews from most to least, removing the erroneous client-side sort and updating the styling for a more streamlined user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/539",
      "merged_at": "2024-04-25T14:52:15Z"
    },
    {
      "number": 538,
      "summary": "Removed the bold styling from the subtitle on the explore page to improve readability and visual consistency across the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/538",
      "merged_at": "2024-04-25T03:54:50Z"
    },
    {
      "number": 530,
      "summary": "Simplified the process for setting up the latest course. Removed unnecessary steps and streamlined the initialization workflow for better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/530",
      "merged_at": "2024-04-25T03:23:32Z"
    },
    {
      "number": 535,
      "summary": "Adjusted the styles on the reviews page to improve readability and user experience. Made changes to font sizes, colors, and spacing to enhance the overall appearance of the page. The adjustments were aimed at creating a more visually appealing and user-friendly interface for the reviews section.",
      "url": "https://github.com/terror/mcgill.courses/pull/535",
      "merged_at": "2024-04-25T03:23:12Z"
    },
    {
      "number": 534,
      "summary": "Added a subtitle to the explore page to provide more context and information for users browsing through the content.",
      "url": "https://github.com/terror/mcgill.courses/pull/534",
      "merged_at": "2024-04-25T03:22:33Z"
    },
    {
      "number": 529,
      "summary": "Added a simple meta description tag to improve SEO for the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/529",
      "merged_at": "2024-04-25T02:19:28Z"
    },
    {
      "number": 533,
      "summary": "Adjusted the design of the reviews page to ensure it displays properly on all screen sizes. Added responsive features to improve user experience on various devices. Fixed layout issues that were causing elements to appear incorrectly on smaller screens. tweaked CSS styles to make the page more adaptable and user-friendly.",
      "url": "https://github.com/terror/mcgill.courses/pull/533",
      "merged_at": "2024-04-25T01:47:00Z"
    },
    {
      "number": 531,
      "summary": "Added an initial reviews page to showcase feedback and testimonials from users on the website. This new section provides a platform for customers to share their experiences and help build trust with potential clients.",
      "url": "https://github.com/terror/mcgill.courses/pull/531",
      "merged_at": "2024-04-24T19:25:35Z"
    },
    {
      "number": 525,
      "summary": "Fixed issue where invalid schedules were being displayed, ensuring that only correct schedules are shown to users.",
      "url": "https://github.com/terror/mcgill.courses/pull/525",
      "merged_at": "2024-04-22T15:45:43Z"
    },
    {
      "number": 519,
      "summary": "Added a link to the Discord server in the contacts section, replacing the admin email for easier communication and community engagement.",
      "url": "https://github.com/terror/mcgill.courses/pull/519",
      "merged_at": "2024-04-22T15:39:47Z"
    },
    {
      "number": 517,
      "summary": "Improved user experience by persisting the explore filter state until the page is refreshed. This change ensures that users do not have to reapply filters every time the page reloads, providing a more seamless browsing experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/517",
      "merged_at": "2024-04-20T04:31:23Z"
    },
    {
      "number": 516,
      "summary": "Added horizontal margin to the new explore button to ensure that the link and hover effects only apply to the text itself, rather than covering the entire row.",
      "url": "https://github.com/terror/mcgill.courses/pull/516",
      "merged_at": "2024-04-19T20:48:25Z"
    },
    {
      "number": 513,
      "summary": "Added an 'explore all courses' option to the home page for quicker access to all courses, addressing a user experience issue and eliminating the need for an extra click.",
      "url": "https://github.com/terror/mcgill.courses/pull/513",
      "merged_at": "2024-04-19T20:07:30Z"
    },
    {
      "number": 515,
      "summary": "Updated the services command in development instructions to provide clearer guidance to developers.",
      "url": "https://github.com/terror/mcgill.courses/pull/515",
      "merged_at": "2024-04-19T19:57:44Z"
    },
    {
      "number": 512,
      "summary": "Added the `break-words` property to properly format long words in the review content. This change ensures that text will wrap correctly within the review section, improving readability for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/512",
      "merged_at": "2024-04-19T17:59:51Z"
    },
    {
      "number": 509,
      "summary": "Added functionality to securely plug in the Discord server to access development environment variables. This change ensures that sensitive information is protected while allowing seamless communication with the server for necessary configuration.",
      "url": "https://github.com/terror/mcgill.courses/pull/509",
      "merged_at": "2024-04-19T17:11:50Z"
    },
    {
      "number": 508,
      "summary": "Added new links and updated existing ones for social media profiles to ensure they are current and accurate.",
      "url": "https://github.com/terror/mcgill.courses/pull/508",
      "merged_at": "2024-04-19T16:55:26Z"
    },
    {
      "number": 505,
      "summary": "Fixed the issue with z-index in the notification dropdown to ensure it displays correctly on top of other elements.",
      "url": "https://github.com/terror/mcgill.courses/pull/505",
      "merged_at": "2024-04-19T15:18:45Z"
    },
    {
      "number": 506,
      "summary": "Implemented a feature to disable the initialization process in the production environment for enhanced security. This change ensures that sensitive data and configurations are not accidentally initialized in a live environment, reducing the risk of security breaches.",
      "url": "https://github.com/terror/mcgill.courses/pull/506",
      "merged_at": "2024-04-19T14:53:58Z"
    },
    {
      "number": 503,
      "summary": "Updated the Prettier version and enhanced the visibility of the course graph button for better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/503",
      "merged_at": "2024-04-19T12:45:49Z"
    },
    {
      "number": 501,
      "summary": "Updated the scraper to re-scrape the 2023-2024 e-calendar courses to ensure the most up-to-date information is reflected.",
      "url": "https://github.com/terror/mcgill.courses/pull/501",
      "merged_at": "2024-04-18T18:39:01Z"
    },
    {
      "number": 500,
      "summary": "Re-scraped RateMyProfessors reviews to ensure accurate and up-to-date information.",
      "url": "https://github.com/terror/mcgill.courses/pull/500",
      "merged_at": "2024-04-18T17:40:38Z"
    },
    {
      "number": 499,
      "summary": "Added a disclaimer to clearly distinguish from McGill University and prevent any confusion.",
      "url": "https://github.com/terror/mcgill.courses/pull/499",
      "merged_at": "2024-04-18T16:51:44Z"
    },
    {
      "number": 498,
      "summary": "Removed custom error structs from the database crate to simplify error handling and improve code readability. This change streamlines the error handling process by relying on standard Rust error handling mechanisms, making the codebase easier to maintain and understand.",
      "url": "https://github.com/terror/mcgill.courses/pull/498",
      "merged_at": "2024-04-03T14:48:29Z"
    }
  ],
  "August 2023": [
    {
      "number": 373,
      "summary": "Fixed a bug that caused the page to crash when duplicate nodes were present.",
      "url": "https://github.com/terror/mcgill.courses/pull/373",
      "merged_at": "2023-08-19T04:07:26Z"
    },
    {
      "number": 372,
      "summary": "Improved the performance of the course graph component by implementing memoization techniques. This change reduces unnecessary re-renders and optimizes the rendering process for a smoother user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/372",
      "merged_at": "2023-08-19T03:05:11Z"
    },
    {
      "number": 364,
      "summary": "Added a header to the profile page to improve its appearance.",
      "url": "https://github.com/terror/mcgill.courses/pull/364",
      "merged_at": "2023-08-14T02:16:31Z"
    },
    {
      "number": 363,
      "summary": "Corrected inconsistent vertical spacing between terms displayed on course cards to ensure a uniform and visually appealing layout across the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/363",
      "merged_at": "2023-08-13T17:43:01Z"
    },
    {
      "number": 362,
      "summary": "Capitalized and punctuated the course restrictions text to improve readability and conformity with standard formatting.",
      "url": "https://github.com/terror/mcgill.courses/pull/362",
      "merged_at": "2023-08-13T17:28:53Z"
    },
    {
      "number": 361,
      "summary": "Set the default log level to `info` when the `RUST_LOG` environment variable is not defined. This change ensures that the application provides sufficient logging information without the need for users to manually set the log level.",
      "url": "https://github.com/terror/mcgill.courses/pull/361",
      "merged_at": "2023-08-11T00:00:52Z"
    },
    {
      "number": 360,
      "summary": "Added installation of the `ca-certificates` package in the Dockerfile to ensure secure communication between the container and external servers. This update enhances the security of the application by including the necessary certification authorities.",
      "url": "https://github.com/terror/mcgill.courses/pull/360",
      "merged_at": "2023-08-10T23:33:37Z"
    },
    {
      "number": 359,
      "summary": "Integrated the rustls library with the rusoto crate for secure communication with AWS services. This change improves the security and performance of network requests by leveraging rustls' capabilities within the rusoto framework.",
      "url": "https://github.com/terror/mcgill.courses/pull/359",
      "merged_at": "2023-08-10T23:10:41Z"
    },
    {
      "number": 357,
      "summary": "Added building code for the shorthand `ARMST` to improve efficiency and accuracy in processing requests. This change ensures that requests using the shorthand `ARMST` can now be interpreted correctly and executed seamlessly.",
      "url": "https://github.com/terror/mcgill.courses/pull/357",
      "merged_at": "2023-08-10T03:13:39Z"
    },
    {
      "number": 356,
      "summary": "Updated the source hash check to only be computed during initialization, resulting in improved performance and efficiency.",
      "url": "https://github.com/terror/mcgill.courses/pull/356",
      "merged_at": "2023-08-10T03:07:43Z"
    },
    {
      "number": 355,
      "summary": "Added functionality to store a source hash in S3 (production environment only) to prevent unnecessary data seeding if the hash remains unchanged during deployments.",
      "url": "https://github.com/terror/mcgill.courses/pull/355",
      "merged_at": "2023-08-10T02:55:28Z"
    },
    {
      "number": 353,
      "summary": "Updated the code to re-initialize the database only when the source hash has changed, reducing unnecessary resets and improving efficiency.",
      "url": "https://github.com/terror/mcgill.courses/pull/353",
      "merged_at": "2023-08-06T17:26:21Z"
    },
    {
      "number": 352,
      "summary": "Parsed the HTML document from the requirement text following the specified prefix. This change ensures that the correct information is extracted and utilized effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/352",
      "merged_at": "2023-08-06T15:47:52Z"
    },
    {
      "number": 351,
      "summary": "Removed extension traits in the extractor to simplify the codebase and improve maintainability. This change streamlines the extractor functionality by eliminating unnecessary abstraction layers.",
      "url": "https://github.com/terror/mcgill.courses/pull/351",
      "merged_at": "2023-08-06T15:39:57Z"
    },
    {
      "number": 350,
      "summary": "Added verification for the Azure platform. This change ensures that the necessary checks and tests are in place to validate the compatibility and functionality of the software with Azure services.",
      "url": "https://github.com/terror/mcgill.courses/pull/350",
      "merged_at": "2023-08-05T03:07:37Z"
    },
    {
      "number": 343,
      "summary": "Updated the code to parse course requirements with LLM, allowing for more accurate and detailed information to be extracted from the data.",
      "url": "https://github.com/terror/mcgill.courses/pull/343",
      "merged_at": "2023-08-05T03:05:45Z"
    }
  ],
  "July 2023": [
    {
      "number": 344,
      "summary": "Added a hovering effect for classroom numbers in the schedule display. When hovering over the numbers, the fullname of the building is now displayed for better clarity and navigation.",
      "url": "https://github.com/terror/mcgill.courses/pull/344",
      "merged_at": "2023-07-26T23:18:37Z"
    },
    {
      "number": 348,
      "summary": "Fixed the failing MongoDB installation in the CI by updating the installation process and dependencies to ensure smooth and successful deployment.",
      "url": "https://github.com/terror/mcgill.courses/pull/348",
      "merged_at": "2023-07-22T19:03:06Z"
    },
    {
      "number": 345,
      "summary": "Fixed an issue where the open-schedule button was overflowing on smaller screens by adjusting the styling to ensure it displays correctly.",
      "url": "https://github.com/terror/mcgill.courses/pull/345",
      "merged_at": "2023-07-17T02:41:12Z"
    },
    {
      "number": 337,
      "summary": "Consolidated individual course requests to streamline and simplify the process. This change improves efficiency by allowing users to submit multiple course requests in a single submission rather than separately.",
      "url": "https://github.com/terror/mcgill.courses/pull/337",
      "merged_at": "2023-07-16T03:33:06Z"
    },
    {
      "number": 341,
      "summary": "Added a screenshot of the course page to the readme file, providing a visual representation of the course content. This change aims to enhance the user experience by offering a preview of the course layout and design.",
      "url": "https://github.com/terror/mcgill.courses/pull/341",
      "merged_at": "2023-07-15T23:39:35Z"
    },
    {
      "number": 340,
      "summary": "Blended the search results with the search bar to improve user experience. This change allows for a seamless integration of search suggestions with the search input field, making it easier for users to find relevant information quickly.",
      "url": "https://github.com/terror/mcgill.courses/pull/340",
      "merged_at": "2023-07-12T23:46:28Z"
    },
    {
      "number": 296,
      "summary": "Updated the frontend code by replacing utility classes, adjusting widths and margins, improving component structure, and fixing various styling issues across multiple files. Specific changes include renaming props, improving code cleanliness, simplifying expressions, optimizing transitions, and enhancing usability through visual adjustments. Some components were refactored to use reusable elements, simplify logic, or improve performance. Additionally, unnecessary code was removed, and dependencies were updated to enhance the overall user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/296",
      "merged_at": "2023-07-12T03:26:06Z"
    },
    {
      "number": 336,
      "summary": "Fixed a bug where the review form would unintentionally close upon clicking on it.",
      "url": "https://github.com/terror/mcgill.courses/pull/336",
      "merged_at": "2023-07-03T17:11:25Z"
    },
    {
      "number": 335,
      "summary": "Updated the example for the load command in the README to provide clearer instructions on how to use the feature effectively.",
      "url": "https://github.com/terror/mcgill.courses/pull/335",
      "merged_at": "2023-07-02T00:51:22Z"
    },
    {
      "number": 330,
      "summary": "Added a course graph feature to visualize course dependencies and relationships. The graph helps users plan their coursework effectively by visually displaying prerequisites and corequisites for each course.",
      "url": "https://github.com/terror/mcgill.courses/pull/330",
      "merged_at": "2023-07-02T00:41:36Z"
    },
    {
      "number": 317,
      "summary": "Added icons to the term filter buttons in the explore feature for better visual representation and user experience. The icons provide users with a quick visual cue to understand the purpose of each filter option, making it easier to navigate through the explore section.",
      "url": "https://github.com/terror/mcgill.courses/pull/317",
      "merged_at": "2023-07-01T15:43:14Z"
    }
  ],
  "March 2025": [
    {
      "number": 638,
      "summary": "Added a new tools section to the readme file to provide users with a comprehensive list of resources and utilities. This enhancement aims to improve the user experience by offering easy access to helpful tools and references.",
      "url": "https://github.com/terror/mcgill.courses/pull/638",
      "merged_at": "2025-03-17T15:42:27Z"
    },
    {
      "number": 636,
      "summary": "Added a new logo favicon and updated logos on the website. Credited the logo design on the About page and fixed issues with LinkedIn images.",
      "url": "https://github.com/terror/mcgill.courses/pull/636",
      "merged_at": "2025-03-16T01:41:59Z"
    }
  ],
  "October 2023": [
    {
      "number": 449,
      "summary": "Removed outdated rating display components that were no longer being used in the application. This cleanup improves code readability and reduces unnecessary clutter in the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/449",
      "merged_at": "2023-10-23T21:29:44Z"
    },
    {
      "number": 448,
      "summary": "Fixed issue where the histogram was not displaying correctly on specific screen sizes, as it was overlapping the background.",
      "url": "https://github.com/terror/mcgill.courses/pull/448",
      "merged_at": "2023-10-17T02:48:22Z"
    },
    {
      "number": 447,
      "summary": "Simplified the process of merging courses in the loader. Made adjustments to streamline and improve the course merging functionality.",
      "url": "https://github.com/terror/mcgill.courses/pull/447",
      "merged_at": "2023-10-16T19:25:50Z"
    },
    {
      "number": 446,
      "summary": "Ignored extractor test samples when generating the code report to ensure accuracy in the report.",
      "url": "https://github.com/terror/mcgill.courses/pull/446",
      "merged_at": "2023-10-16T05:20:40Z"
    },
    {
      "number": 440,
      "summary": "Implemented functionality to add instructors to the search feature, allowing users to search for instructors using full-text search capabilities. This change enhances the user experience by providing a more comprehensive search option within the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/440",
      "merged_at": "2023-10-16T05:13:16Z"
    },
    {
      "number": 445,
      "summary": "Added type-only import to ensure TypeScript fully erases it at runtime.",
      "url": "https://github.com/terror/mcgill.courses/pull/445",
      "merged_at": "2023-10-16T05:03:10Z"
    },
    {
      "number": 444,
      "summary": "Added a basic error boundary to address potential issues in the application. This change helps improve user experience by handling errors more gracefully.",
      "url": "https://github.com/terror/mcgill.courses/pull/444",
      "merged_at": "2023-10-16T04:59:22Z"
    },
    {
      "number": 443,
      "summary": "Fixed the position of the reset button, which was previously incorrectly set to absolute positioning, causing it to overlap with other elements on the page. Now, the reset button aligns properly within the layout of the webpage.",
      "url": "https://github.com/terror/mcgill.courses/pull/443",
      "merged_at": "2023-10-11T02:47:17Z"
    },
    {
      "number": 439,
      "summary": "Sorted the reviews on the instructor page by date to display the most recent ones first, providing users with easier access to the latest feedback.",
      "url": "https://github.com/terror/mcgill.courses/pull/439",
      "merged_at": "2023-10-07T04:16:48Z"
    },
    {
      "number": 421,
      "summary": "Added the capability for users to perform full-text searches on the explore page. This enhancement makes it easier for users to find specific content quickly and efficiently within the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/421",
      "merged_at": "2023-10-02T17:27:15Z"
    }
  ],
  "April 2023": [
    {
      "number": 130,
      "summary": "Added functionality to parse schedule data, allowing users to input their schedule information in a standardized format. This change streamlines the process of importing and organizing schedule data within the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/130",
      "merged_at": "2023-04-30T19:21:00Z"
    },
    {
      "number": 131,
      "summary": "Implemented the conversion of the review add/edit functionality to dialog boxes. This change improves the user experience by allowing for a smoother and more convenient process when adding or editing reviews on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/131",
      "merged_at": "2023-04-28T22:16:30Z"
    },
    {
      "number": 129,
      "summary": "Corrected the broken image link in the readme file, ensuring that users can view the image without any issues. Made a minor adjustment to improve the overall readability and aesthetics of the documentation.",
      "url": "https://github.com/terror/mcgill.courses/pull/129",
      "merged_at": "2023-04-28T20:59:45Z"
    },
    {
      "number": 128,
      "summary": "Implemented new search algorithm to enhance search functionality, resulting in faster and more accurate search results.",
      "url": "https://github.com/terror/mcgill.courses/pull/128",
      "merged_at": "2023-04-28T20:32:31Z"
    },
    {
      "number": 127,
      "summary": "Implemented a dark mode feature to provide users with an alternative color scheme for improved visibility in low-light environments. This change allows users to switch between light and dark themes easily within the application settings.",
      "url": "https://github.com/terror/mcgill.courses/pull/127",
      "merged_at": "2023-04-28T19:47:27Z"
    },
    {
      "number": 126,
      "summary": "Implemented a feature that restricts authentication to only allow users with McGill email addresses. This change ensures that only individuals affiliated with McGill University can access the platform, enhancing security and user privacy.",
      "url": "https://github.com/terror/mcgill.courses/pull/126",
      "merged_at": "2023-04-26T19:50:01Z"
    },
    {
      "number": 124,
      "summary": "Implemented the use of BSON formatted timestamps across the application for improved data consistency and compatibility with MongoDB databases.",
      "url": "https://github.com/terror/mcgill.courses/pull/124",
      "merged_at": "2023-04-18T02:02:22Z"
    },
    {
      "number": 122,
      "summary": "Fixed the formatting of Tailwind classes in the documentation by applying changes based on the provided link.",
      "url": "https://github.com/terror/mcgill.courses/pull/122",
      "merged_at": "2023-04-17T18:34:38Z"
    },
    {
      "number": 121,
      "summary": "Added functionality to underline search results that match the query in the search feature for better visibility and ease of use.",
      "url": "https://github.com/terror/mcgill.courses/pull/121",
      "merged_at": "2023-04-10T02:35:49Z"
    },
    {
      "number": 114,
      "summary": "Added new icons to enhance the user interface and provide more visual options for users to choose from.",
      "url": "https://github.com/terror/mcgill.courses/pull/114",
      "merged_at": "2023-04-09T22:24:02Z"
    },
    {
      "number": 113,
      "summary": "Updated the functionality to redirect users to the edit page if a review already exists when they try to leave a review on the client side. This change helps streamline the user experience and prevents potential confusion or errors.",
      "url": "https://github.com/terror/mcgill.courses/pull/113",
      "merged_at": "2023-04-09T22:19:59Z"
    },
    {
      "number": 110,
      "summary": "Added a blank target attribute to course URLs to ensure links open in a new tab for a better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/110",
      "merged_at": "2023-04-09T02:53:56Z"
    },
    {
      "number": 101,
      "summary": "Added an alert notification box for displaying errors on the client-side. Replaced console.err instances with the new alert box for improved error handling. Prototype created and code formatted for better readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/101",
      "merged_at": "2023-04-09T00:01:38Z"
    },
    {
      "number": 73,
      "summary": "Added functionality to display reviews on the course page, enhancing the user experience by providing valuable feedback.",
      "url": "https://github.com/terror/mcgill.courses/pull/73",
      "merged_at": "2023-04-08T23:47:47Z"
    },
    {
      "number": 103,
      "summary": "Added a basic prototype of an about page to serve as a temporary placeholder until final content is ready for deployment.",
      "url": "https://github.com/terror/mcgill.courses/pull/103",
      "merged_at": "2023-04-08T20:59:39Z"
    },
    {
      "number": 102,
      "summary": "Updated the logic to ensure that courses with the same ID in the database are properly updated instead of duplicated. This change prevents data inconsistencies and improves the accuracy of the database records.",
      "url": "https://github.com/terror/mcgill.courses/pull/102",
      "merged_at": "2023-04-05T04:30:20Z"
    },
    {
      "number": 100,
      "summary": "Improved layout and design elements on course pages for better user experience. Fixed broken links and updated content for accuracy. Refactored code to enhance performance and maintainability.",
      "url": "https://github.com/terror/mcgill.courses/pull/100",
      "merged_at": "2023-04-04T20:09:52Z"
    },
    {
      "number": 99,
      "summary": "Added a search bar to the navigation bar for non-home pages. Also, repositioned the navigation buttons to the right side of the navigation bar for improved layout and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/99",
      "merged_at": "2023-04-04T13:13:18Z"
    },
    {
      "number": 95,
      "summary": "Fixed a bug that was causing duplicate courses to be loaded after the extraction process.",
      "url": "https://github.com/terror/mcgill.courses/pull/95",
      "merged_at": "2023-04-02T20:04:19Z"
    },
    {
      "number": 94,
      "summary": "Added functionality to extract courses that are not offered in the current semester, allowing users to easily identify and remove them from the course list.",
      "url": "https://github.com/terror/mcgill.courses/pull/94",
      "merged_at": "2023-04-02T20:03:33Z"
    },
    {
      "number": 93,
      "summary": "Updated the course page by merging in new content and updates to improve the overall user experience. Added new course materials, fixed formatting issues, and updated information to ensure accuracy and relevance.",
      "url": "https://github.com/terror/mcgill.courses/pull/93",
      "merged_at": "2023-04-02T17:02:50Z"
    },
    {
      "number": 92,
      "summary": "Added a new feature to enhance the search functionality. Users can now search for cooler items with improved accuracy and speed.",
      "url": "https://github.com/terror/mcgill.courses/pull/92",
      "merged_at": "2023-04-02T02:15:11Z"
    },
    {
      "number": 91,
      "summary": "Added a review form to collect feedback from users on the website. Users can now rate their experience and leave comments, helping us improve our services.",
      "url": "https://github.com/terror/mcgill.courses/pull/91",
      "merged_at": "2023-04-02T01:22:36Z"
    },
    {
      "number": 86,
      "summary": "Extended the review model by adding a new property called `instructor` to store the name of the instructor associated with the review.",
      "url": "https://github.com/terror/mcgill.courses/pull/86",
      "merged_at": "2023-04-02T01:21:34Z"
    },
    {
      "number": 84,
      "summary": "Adjusted the name of the test function for clarity and accuracy.",
      "url": "https://github.com/terror/mcgill.courses/pull/84",
      "merged_at": "2023-04-01T19:22:33Z"
    },
    {
      "number": 83,
      "summary": "Removed the ring from the profile icon and adjusted the hover color to match the search bar for a more consistent styling.",
      "url": "https://github.com/terror/mcgill.courses/pull/83",
      "merged_at": "2023-04-01T19:20:54Z"
    },
    {
      "number": 82,
      "summary": "Added arrow-key navigation functionality for the search bar results, allowing users to navigate through each search result. The \"explore all courses\" rectangle is excluded from the navigation at this time.",
      "url": "https://github.com/terror/mcgill.courses/pull/82",
      "merged_at": "2023-04-01T19:11:04Z"
    }
  ],
  "May 2023": [
    {
      "number": 252,
      "summary": "Removed the border around user reviews to create a cleaner and more modern look on the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/252",
      "merged_at": "2023-05-28T04:16:18Z"
    },
    {
      "number": 251,
      "summary": "Implemented concurrent insertion of data during the database seeding process to improve efficiency and reduce the time required for populating the database with initial data. This change allows multiple data entries to be inserted simultaneously, speeding up the seeding process significantly.",
      "url": "https://github.com/terror/mcgill.courses/pull/251",
      "merged_at": "2023-05-28T04:16:10Z"
    },
    {
      "number": 250,
      "summary": "Updated the code to import log levels directly in order to streamline the logging process and improve code readability. This change eliminates the need for repetitive declarations and reduces the risk of errors during implementation.",
      "url": "https://github.com/terror/mcgill.courses/pull/250",
      "merged_at": "2023-05-28T02:18:40Z"
    },
    {
      "number": 248,
      "summary": "Improved animation transitions in the sidebar for a smoother user experience. The changes include adjusting the speed and easing of the animations to make the sidebar feel more responsive and natural while expanding and collapsing. Additionally, added a subtle shadow effect to enhance the visual appeal of the sidebar.",
      "url": "https://github.com/terror/mcgill.courses/pull/248",
      "merged_at": "2023-05-22T01:23:43Z"
    },
    {
      "number": 246,
      "summary": "Added functionality to scrape the latest course information from the e-calendar website. Updated the web scraping algorithm to ensure accurate and up-to-date data retrieval.",
      "url": "https://github.com/terror/mcgill.courses/pull/246",
      "merged_at": "2023-05-22T01:17:34Z"
    },
    {
      "number": 247,
      "summary": "Added the option to select \"other\" in the instructors dropdown menu for more flexibility. This change allows users to specify alternative instructor choices beyond the provided list.",
      "url": "https://github.com/terror/mcgill.courses/pull/247",
      "merged_at": "2023-05-22T00:34:07Z"
    },
    {
      "number": 235,
      "summary": "Added a new page for instructors to the website. The page includes information and a profile picture of the instructor, making it easier for students to connect with their teachers.",
      "url": "https://github.com/terror/mcgill.courses/pull/235",
      "merged_at": "2023-05-21T18:23:36Z"
    },
    {
      "number": 240,
      "summary": "Added a feature to display the difficulty level of each course on the website. Users can now easily identify the complexity of courses before enrolling. This update enhances the user experience by providing more transparency and helping users make informed decisions when selecting courses.",
      "url": "https://github.com/terror/mcgill.courses/pull/240",
      "merged_at": "2023-05-21T16:45:06Z"
    },
    {
      "number": 239,
      "summary": "Limited the search results for courses and instructors to only show the top 5 matches. This change reduces clutter and helps users find relevant information more quickly.",
      "url": "https://github.com/terror/mcgill.courses/pull/239",
      "merged_at": "2023-05-21T05:06:44Z"
    },
    {
      "number": 241,
      "summary": "Fixed a bug that was causing animation to glitch and not display properly on the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/241",
      "merged_at": "2023-05-21T04:09:38Z"
    },
    {
      "number": 238,
      "summary": "Improved the schedule display animation format. Additionally, a development recipe was added to the justfile for better organization and clarity.",
      "url": "https://github.com/terror/mcgill.courses/pull/238",
      "merged_at": "2023-05-21T02:10:11Z"
    },
    {
      "number": 237,
      "summary": "Enhanced the animation for displaying schedules, making it smoother and more visually appealing. The changes provide a better user experience when viewing and interacting with schedules on the platform.",
      "url": "https://github.com/terror/mcgill.courses/pull/237",
      "merged_at": "2023-05-21T01:54:56Z"
    },
    {
      "number": 236,
      "summary": "Added a new development recipe in the justfile for easier management of development-related tasks. This change includes commands for running tests, building the project, and deploying to a local server. The addition of the dev recipe enhances the workflow and productivity of developers working on the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/236",
      "merged_at": "2023-05-21T01:47:18Z"
    },
    {
      "number": 232,
      "summary": "Fixed an issue where clicking on autocomplete suggestion items would not scroll the list to keep the selected item in view. This improvement ensures a smoother user experience when selecting items from the autocomplete dropdown menu.",
      "url": "https://github.com/terror/mcgill.courses/pull/232",
      "merged_at": "2023-05-21T01:05:47Z"
    },
    {
      "number": 233,
      "summary": "Fixed an issue where the course term filtering was not working correctly on the explore page. Now, users can properly filter courses by term to find relevant content.",
      "url": "https://github.com/terror/mcgill.courses/pull/233",
      "merged_at": "2023-05-13T18:13:30Z"
    },
    {
      "number": 234,
      "summary": "Updated the login functionality to redirect users back to the same page they were on before logging in. This change enhances user experience by reducing the need to navigate back to the original page manually after logging in.",
      "url": "https://github.com/terror/mcgill.courses/pull/234",
      "merged_at": "2023-05-13T17:06:27Z"
    },
    {
      "number": 228,
      "summary": "Added the ability to scaffold end-to-end tests using Cypress. The pull request included setting up a mock for the /user route using fixtures.",
      "url": "https://github.com/terror/mcgill.courses/pull/228",
      "merged_at": "2023-05-13T04:00:25Z"
    },
    {
      "number": 227,
      "summary": "Added functionality to sort and group course schedule information for easier navigation and organization. This change helped to alleviate the pain users experienced when trying to understand and plan their course schedules.",
      "url": "https://github.com/terror/mcgill.courses/pull/227",
      "merged_at": "2023-05-13T03:24:06Z"
    },
    {
      "number": 229,
      "summary": "Added a \"show all reviews\" button to improve user experience on the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/229",
      "merged_at": "2023-05-13T02:23:21Z"
    },
    {
      "number": 226,
      "summary": "Sorted the reviews displayed on the page by date, ensuring that the most recent reviews appear at the top for a more user-friendly experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/226",
      "merged_at": "2023-05-10T19:21:51Z"
    },
    {
      "number": 225,
      "summary": "Increased the bottom margin in the explore filter card to provide better spacing and improve readability on the webpage.",
      "url": "https://github.com/terror/mcgill.courses/pull/225",
      "merged_at": "2023-05-10T19:12:45Z"
    },
    {
      "number": 220,
      "summary": "Added functionality to display the source path when seeding the database. Now, users can easily identify the source of the data being populated in the database.",
      "url": "https://github.com/terror/mcgill.courses/pull/220",
      "merged_at": "2023-05-10T15:57:59Z"
    },
    {
      "number": 219,
      "summary": "Updated the code to interpret seeding review timestamps as seconds instead of milliseconds. This change ensures accurate time calculations in the application's review process.",
      "url": "https://github.com/terror/mcgill.courses/pull/219",
      "merged_at": "2023-05-10T15:37:38Z"
    },
    {
      "number": 217,
      "summary": "Updated the loader usage information in the readme file to provide clearer instructions for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/217",
      "merged_at": "2023-05-10T06:57:50Z"
    },
    {
      "number": 206,
      "summary": "Seeded course reviews from an external source to provide more feedback for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/206",
      "merged_at": "2023-05-10T06:24:59Z"
    },
    {
      "number": 204,
      "summary": "Added fall and winter schedule information to the website to keep users informed of upcoming events.",
      "url": "https://github.com/terror/mcgill.courses/pull/204",
      "merged_at": "2023-05-09T23:38:33Z"
    },
    {
      "number": 202,
      "summary": "Added feature to display \"This course has no prerequisites\" or \"This course has no corequisites\" for courses that do not have specific requirements. Visual presentation in the user interface was also improved for better clarity.",
      "url": "https://github.com/terror/mcgill.courses/pull/202",
      "merged_at": "2023-05-09T23:02:44Z"
    },
    {
      "number": 201,
      "summary": "Removed the unnecessary .gitkeep file from the client public directory to declutter the repository.",
      "url": "https://github.com/terror/mcgill.courses/pull/201",
      "merged_at": "2023-05-09T16:34:06Z"
    },
    {
      "number": 199,
      "summary": "Added a site favicon to improve the website's branding and visual appeal. The favicon is now displayed in browser tabs and bookmarks for easy recognition.",
      "url": "https://github.com/terror/mcgill.courses/pull/199",
      "merged_at": "2023-05-08T23:20:33Z"
    },
    {
      "number": 195,
      "summary": "Fixed the issue with overflowing text in long reviews and made slight formatting changes for improved readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/195",
      "merged_at": "2023-05-08T04:30:31Z"
    },
    {
      "number": 189,
      "summary": "Added the functionality to include instructors in the search index. This change allows users to search for instructors within the platform, making it easier to find relevant information.",
      "url": "https://github.com/terror/mcgill.courses/pull/189",
      "merged_at": "2023-05-08T03:56:16Z"
    },
    {
      "number": 192,
      "summary": "Added functionality to display the schedule to the client, improving communication and transparency in the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/192",
      "merged_at": "2023-05-08T03:26:03Z"
    },
    {
      "number": 194,
      "summary": "Added functionality to automatically insert review data into the database to simulate real user activity and improve the testing process.",
      "url": "https://github.com/terror/mcgill.courses/pull/194",
      "merged_at": "2023-05-08T02:48:10Z"
    },
    {
      "number": 166,
      "summary": "Added a user profile page to the website, allowing users to view and edit their personal information. This feature enhances the user experience by providing a centralized location for managing account details.",
      "url": "https://github.com/terror/mcgill.courses/pull/166",
      "merged_at": "2023-05-07T06:37:24Z"
    },
    {
      "number": 188,
      "summary": "Added a clear button for explore filters and implemented an animation for the explore filter block to make it fully responsive.",
      "url": "https://github.com/terror/mcgill.courses/pull/188",
      "merged_at": "2023-05-07T05:10:38Z"
    },
    {
      "number": 190,
      "summary": "Updated the course page to be more responsive and load faster. This included moving navbar items to a footer, updating dependencies, removing unnecessary references from the database, adding tooltips for course term icons, internal links to course prerequisites and corequisites, and pinning current user reviews on the course page. Additionally, corrected an error message for review ratings.",
      "url": "https://github.com/terror/mcgill.courses/pull/190",
      "merged_at": "2023-05-07T03:23:21Z"
    },
    {
      "number": 183,
      "summary": "Updated the course page by pinning user reviews to the top, removing redundant code, and improving the UI for course requirements. Added links to prerequisite and co-requisite courses for easier navigation.",
      "url": "https://github.com/terror/mcgill.courses/pull/183",
      "merged_at": "2023-05-07T00:53:15Z"
    },
    {
      "number": 187,
      "summary": "Added functionality to the system to include hyperlinks to prerequisites and corequisites within course descriptions, allowing users to easily access related information.",
      "url": "https://github.com/terror/mcgill.courses/pull/187",
      "merged_at": "2023-05-07T00:31:32Z"
    },
    {
      "number": 184,
      "summary": "Added a hover effect to course term icons to improve user experience on the interface. This change was made to address the issue of limited space and enhance visual interaction.",
      "url": "https://github.com/terror/mcgill.courses/pull/184",
      "merged_at": "2023-05-07T00:25:16Z"
    },
    {
      "number": 186,
      "summary": "Removed unnecessary references from the code in order to improve efficiency and readability.",
      "url": "https://github.com/terror/mcgill.courses/pull/186",
      "merged_at": "2023-05-07T00:11:29Z"
    },
    {
      "number": 185,
      "summary": "Updated dependencies to ensure that the project runs smoothly, stays secure, and performs efficiently. Made necessary changes to keep up with the latest improvements and bug fixes from external libraries and tools.",
      "url": "https://github.com/terror/mcgill.courses/pull/185",
      "merged_at": "2023-05-06T18:24:52Z"
    },
    {
      "number": 182,
      "summary": "Moved navigation bar items to the footer section of the website and conducted linting for improved code quality.",
      "url": "https://github.com/terror/mcgill.courses/pull/182",
      "merged_at": "2023-05-06T16:51:13Z"
    },
    {
      "number": 181,
      "summary": "Added summer course schedule information for the 2022-2023 term, including new course offerings and updated class times.",
      "url": "https://github.com/terror/mcgill.courses/pull/181",
      "merged_at": "2023-05-06T04:26:44Z"
    },
    {
      "number": 180,
      "summary": "Added a Husky pre-push hook to ensure linting and tests are run before pushing changes. This helps maintain code quality by catching errors early in the development process.",
      "url": "https://github.com/terror/mcgill.courses/pull/180",
      "merged_at": "2023-05-06T02:57:59Z"
    },
    {
      "number": 176,
      "summary": "Extended the duration of user sessions on the website to improve user experience and reduce frequent logins. This change allows users to stay logged in for a longer period without being automatically logged out.",
      "url": "https://github.com/terror/mcgill.courses/pull/176",
      "merged_at": "2023-05-06T02:12:34Z"
    },
    {
      "number": 177,
      "summary": "Fixed an issue where the pluralization on reviews was incorrect. Now, the reviews are displayed accurately in the correct format.",
      "url": "https://github.com/terror/mcgill.courses/pull/177",
      "merged_at": "2023-05-06T02:12:03Z"
    },
    {
      "number": 173,
      "summary": "Fixed a bug that caused the bird character to appear squished on smaller screens. The issue was resolved by adjusting the CSS styling to ensure the bird's proportions remain consistent across different screen sizes.",
      "url": "https://github.com/terror/mcgill.courses/pull/173",
      "merged_at": "2023-05-06T02:07:04Z"
    },
    {
      "number": 174,
      "summary": "Added functionality to display an error message when a user submits a form without filling in required fields. Also included a star rating component for users to provide feedback easily.",
      "url": "https://github.com/terror/mcgill.courses/pull/174",
      "merged_at": "2023-05-06T02:03:24Z"
    },
    {
      "number": 175,
      "summary": "Updated the website title to \"mcgill.courses\" for better branding and user experience. Fixed the search result z-index on the explore page, added overflow-auto to the layout component, and included an FAQ section on the about page.",
      "url": "https://github.com/terror/mcgill.courses/pull/175",
      "merged_at": "2023-05-06T01:36:31Z"
    },
    {
      "number": 170,
      "summary": "Updated the about page and added an FAQ section to improve user experience on the website. Fixed some issues related to branch naming for a smoother development process.",
      "url": "https://github.com/terror/mcgill.courses/pull/170",
      "merged_at": "2023-05-06T01:13:09Z"
    },
    {
      "number": 169,
      "summary": "Fixed the issue where an overflowing page would display as white on the home page. Changes were made to prevent this visual glitch and ensure a seamless user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/169",
      "merged_at": "2023-05-06T00:55:17Z"
    },
    {
      "number": 168,
      "summary": "Improved the z-index of search results on the explore page to ensure they are displayed correctly above other elements on the page.",
      "url": "https://github.com/terror/mcgill.courses/pull/168",
      "merged_at": "2023-05-05T03:29:36Z"
    },
    {
      "number": 167,
      "summary": "Improved the reliability of loader requests by adding a retry mechanism in case of failure. This change ensures that data loading processes are more robust and resilient to temporary network issues or server downtime.",
      "url": "https://github.com/terror/mcgill.courses/pull/167",
      "merged_at": "2023-05-04T20:03:59Z"
    },
    {
      "number": 165,
      "summary": "Parsed `&amp;` in the extractor instead of frontend, and included a test for a course page with `&`.",
      "url": "https://github.com/terror/mcgill.courses/pull/165",
      "merged_at": "2023-05-04T15:48:23Z"
    },
    {
      "number": 162,
      "summary": "Added a new section in the readme explaining how to seed the database with examples. This change provides clear instructions for users to populate their database easily with sample data.",
      "url": "https://github.com/terror/mcgill.courses/pull/162",
      "merged_at": "2023-05-03T17:55:46Z"
    },
    {
      "number": 159,
      "summary": "Added database tests to ensure accurate filtering of courses based on various criteria such as subject, level, and price. These tests help validate the functionality and reliability of the course filtering feature.",
      "url": "https://github.com/terror/mcgill.courses/pull/159",
      "merged_at": "2023-05-03T17:36:51Z"
    },
    {
      "number": 132,
      "summary": "Implemented a filter box on the Explore page for both large and small screens. Updated the backend endpoint to return a filtered Course array and also updated tests. Refactored code for better organization.",
      "url": "https://github.com/terror/mcgill.courses/pull/132",
      "merged_at": "2023-05-03T05:12:03Z"
    },
    {
      "number": 155,
      "summary": "Added a 404 not found page and linked all bad URLs to it.",
      "url": "https://github.com/terror/mcgill.courses/pull/155",
      "merged_at": "2023-05-03T04:50:56Z"
    },
    {
      "number": 151,
      "summary": "Added a new function to retrieve a specific term from the database. This enhancement allows users to easily query and display a single term without the need to fetch the entire dataset.",
      "url": "https://github.com/terror/mcgill.courses/pull/151",
      "merged_at": "2023-05-03T03:17:52Z"
    },
    {
      "number": 152,
      "summary": "Added sorting functionality to ensure paths are seeded in a database directory in a consistent order. This change helps maintain organization and readability in the database seeding process.",
      "url": "https://github.com/terror/mcgill.courses/pull/152",
      "merged_at": "2023-05-03T02:55:26Z"
    },
    {
      "number": 146,
      "summary": "Added the \"data\" directory to the .prettierignore file to exclude formatting for data files, maintaining a cleaner codebase and easier navigation for developers.",
      "url": "https://github.com/terror/mcgill.courses/pull/146",
      "merged_at": "2023-05-02T23:50:24Z"
    },
    {
      "number": 143,
      "summary": "Extracted historical course data to provide users with access to past course information. This change allows users to view previous course data for better analysis and comparison.",
      "url": "https://github.com/terror/mcgill.courses/pull/143",
      "merged_at": "2023-05-02T23:49:07Z"
    },
    {
      "number": 142,
      "summary": "Updated the README.md file to include new installation instructions and updated examples for better clarity and user understanding.",
      "url": "https://github.com/terror/mcgill.courses/pull/142",
      "merged_at": "2023-05-01T23:59:28Z"
    },
    {
      "number": 139,
      "summary": "Implemented the use of MongoDB for storing session data, improving scalability and reliability. This change ensures that session information is securely stored in a more robust database system, enhancing the overall performance of the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/139",
      "merged_at": "2023-05-01T06:25:23Z"
    },
    {
      "number": 138,
      "summary": "Added a responsive pie chart to display average course ratings on course pages. The chart adjusts its size based on the screen width and becomes centered on small screens, providing a visually appealing way to view course ratings.",
      "url": "https://github.com/terror/mcgill.courses/pull/138",
      "merged_at": "2023-05-01T06:22:55Z"
    },
    {
      "number": 133,
      "summary": "Added a CourseTerm tag for non-offered courses to be displayed on the explore page and course page.",
      "url": "https://github.com/terror/mcgill.courses/pull/133",
      "merged_at": "2023-05-01T02:59:38Z"
    }
  ],
  "March 2023": [
    {
      "number": 77,
      "summary": "Added a few tests to ensure the proper functioning of the course and review routes. These additions aimed to enhance the reliability and accuracy of the application by covering critical functionality with testing.",
      "url": "https://github.com/terror/mcgill.courses/pull/77",
      "merged_at": "2023-03-31T02:37:06Z"
    },
    {
      "number": 76,
      "summary": "Fixed an issue where special characters in the query string were causing errors. Updated the code to properly handle and parse special characters, ensuring smooth functionality for all queries.",
      "url": "https://github.com/terror/mcgill.courses/pull/76",
      "merged_at": "2023-03-29T22:25:53Z"
    },
    {
      "number": 64,
      "summary": "Added new routes for course reviews to allow users to leave feedback and ratings for courses. This change enhances the user experience by providing a platform for sharing opinions and helping others make informed decisions about courses.",
      "url": "https://github.com/terror/mcgill.courses/pull/64",
      "merged_at": "2023-03-28T23:22:05Z"
    },
    {
      "number": 72,
      "summary": "Fixed tslint command by updating configuration to adhere to the latest linting rules. The changes ensure that the codebase follows consistent coding standards and best practices for improved code quality.",
      "url": "https://github.com/terror/mcgill.courses/pull/72",
      "merged_at": "2023-03-28T02:35:22Z"
    },
    {
      "number": 71,
      "summary": "Added tslint to the project to improve code quality by enforcing coding standards and catching potential bugs early on.",
      "url": "https://github.com/terror/mcgill.courses/pull/71",
      "merged_at": "2023-03-26T19:56:06Z"
    },
    {
      "number": 68,
      "summary": "Added a profile dropdown component to enhance user navigation and provide quick access to account settings. This improvement allows users to easily switch between profiles and manage their preferences without disrupting the browsing experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/68",
      "merged_at": "2023-03-26T18:56:32Z"
    },
    {
      "number": 62,
      "summary": "Added an explore page with incremental fetch feature for endless scrolling.",
      "url": "https://github.com/terror/mcgill.courses/pull/62",
      "merged_at": "2023-03-26T13:41:29Z"
    },
    {
      "number": 63,
      "summary": "Updated the project to use React Router links instead of anchor tags for improved navigation and better handling of client-side routing. This change ensures a more seamless user experience when navigating between pages within the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/63",
      "merged_at": "2023-03-25T20:30:44Z"
    },
    {
      "number": 61,
      "summary": "Updated the README to include a mention of the client/.env.example file for easy reference by users. This change will help users locate and use the example environment file during setup and configuration.",
      "url": "https://github.com/terror/mcgill.courses/pull/61",
      "merged_at": "2023-03-25T19:48:57Z"
    },
    {
      "number": 58,
      "summary": "The index page was finalized with the following changes:\n- The magnifying glass icon was made slightly smaller.\n- A parser was added to handle `&amp;` in course titles.\n- Links were added to each search result suggestion in the format of `/cource/${result._id}`.\n- The nav bar buttons were removed from the template and a button for the About page was added.\n- The search results' array size was capped at 6 to prevent screen overflow.",
      "url": "https://github.com/terror/mcgill.courses/pull/58",
      "merged_at": "2023-03-25T19:46:26Z"
    },
    {
      "number": 59,
      "summary": "Integrated a TypeScript formatting check into the actions workflow script. This change ensures that all TypeScript files adhere to the specified format guidelines, maintaining consistency across the codebase.",
      "url": "https://github.com/terror/mcgill.courses/pull/59",
      "merged_at": "2023-03-25T19:21:48Z"
    },
    {
      "number": 55,
      "summary": "Improved the styling of the course search dropdown by updating the font size, spacing, and alignment for better readability and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/55",
      "merged_at": "2023-03-25T16:38:16Z"
    },
    {
      "number": 51,
      "summary": "Refactored the home page by breaking it down into smaller, reusable components for improved code organization and maintainability. This change makes it easier to manage and update different sections of the home page separately.",
      "url": "https://github.com/terror/mcgill.courses/pull/51",
      "merged_at": "2023-03-25T15:35:41Z"
    },
    {
      "number": 50,
      "summary": "Removed the loading div that appeared during authentication to improve user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/50",
      "merged_at": "2023-03-24T02:59:00Z"
    },
    {
      "number": 49,
      "summary": "Added a request client to the state to improve data fetching efficiency and organization.",
      "url": "https://github.com/terror/mcgill.courses/pull/49",
      "merged_at": "2023-03-24T02:54:19Z"
    },
    {
      "number": 47,
      "summary": "Added a note about using environment variables to the readme file. This change helps users understand how to set and use environment variables in the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/47",
      "merged_at": "2023-03-23T23:57:44Z"
    },
    {
      "number": 46,
      "summary": "Added logic to conditionally render the login button in the sidepane based on user authentication status. This change improves the user experience by only showing the button when necessary, reducing clutter on the interface.",
      "url": "https://github.com/terror/mcgill.courses/pull/46",
      "merged_at": "2023-03-23T23:48:48Z"
    },
    {
      "number": 45,
      "summary": "Refactored authentication routes to improve code readability and organization. Split large functions into smaller, modular pieces for easier maintenance. Added comments for better documentation and clarity in the codebase. Cleaned up redundant code and optimized route handling for smoother user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/45",
      "merged_at": "2023-03-23T23:36:40Z"
    },
    {
      "number": 44,
      "summary": "Corrected multiple typos in the Rust source code files to improve readability and maintain coding standards.",
      "url": "https://github.com/terror/mcgill.courses/pull/44",
      "merged_at": "2023-03-23T19:05:27Z"
    },
    {
      "number": 25,
      "summary": "Added support for Microsoft OAuth authentication in the login system, allowing users to log in using their Microsoft accounts. This change enhances user experience by providing an additional secure and convenient login option.",
      "url": "https://github.com/terror/mcgill.courses/pull/25",
      "merged_at": "2023-03-23T18:49:10Z"
    },
    {
      "number": 42,
      "summary": "Implemented a MongoDB full-text search index for course identifiers. This enhancement enables more efficient and accurate search functionality when looking up courses based on their identifiers.",
      "url": "https://github.com/terror/mcgill.courses/pull/42",
      "merged_at": "2023-03-22T17:44:47Z"
    },
    {
      "number": 39,
      "summary": "Added a new route to find courses easily on the website. This change enhances the user experience by allowing quicker access to specific course information.",
      "url": "https://github.com/terror/mcgill.courses/pull/39",
      "merged_at": "2023-03-22T17:24:19Z"
    },
    {
      "number": 38,
      "summary": "Separated routes into individual modules to improve code organization and maintainability.",
      "url": "https://github.com/terror/mcgill.courses/pull/38",
      "merged_at": "2023-03-22T05:28:56Z"
    },
    {
      "number": 34,
      "summary": "Added a new option to the loader to support the McGill term. This change allows users to specify the term when loading data, enhancing the loader's functionality and flexibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/34",
      "merged_at": "2023-03-21T21:55:20Z"
    },
    {
      "number": 33,
      "summary": "Added a test case for combining vector elements in the testing suite. This change ensures that the vec combine function is properly tested for accuracy and reliability.",
      "url": "https://github.com/terror/mcgill.courses/pull/33",
      "merged_at": "2023-03-21T21:52:18Z"
    },
    {
      "number": 32,
      "summary": "Implemented support for full-text search in MongoDB, allowing users to search for text across multiple fields in a collection. This enhancement enables more efficient and comprehensive search capabilities within the database.",
      "url": "https://github.com/terror/mcgill.courses/pull/32",
      "merged_at": "2023-03-21T21:17:06Z"
    },
    {
      "number": 31,
      "summary": "Added a new helper function for easier testing of extractors. This function simplifies the process of testing data extraction functionality in the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/31",
      "merged_at": "2023-03-21T02:40:19Z"
    },
    {
      "number": 29,
      "summary": "Renamed the extract recipe in the justfile to improve clarity and consistency.",
      "url": "https://github.com/terror/mcgill.courses/pull/29",
      "merged_at": "2023-03-21T00:31:54Z"
    },
    {
      "number": 28,
      "summary": "Changed the serialization of courses to use camel case instead of snake case. This makes the data structure more consistent and easy to work with across the application.",
      "url": "https://github.com/terror/mcgill.courses/pull/28",
      "merged_at": "2023-03-21T00:29:01Z"
    },
    {
      "number": 27,
      "summary": "Added functionality to parse course restrictions from the input data, allowing for more accurate filtering and sorting of courses based on various criteria. This enhancement improves the overall user experience by providing more specific and relevant search results.",
      "url": "https://github.com/terror/mcgill.courses/pull/27",
      "merged_at": "2023-03-21T00:26:13Z"
    },
    {
      "number": 26,
      "summary": "Simplified the extract instructors function for better readability and comprehension. Made changes to streamline the code structure and make it more user-friendly.",
      "url": "https://github.com/terror/mcgill.courses/pull/26",
      "merged_at": "2023-03-21T00:02:17Z"
    },
    {
      "number": 22,
      "summary": "Added functionality to include the year in the instructor term field for improved clarity and organization.",
      "url": "https://github.com/terror/mcgill.courses/pull/22",
      "merged_at": "2023-03-19T20:45:14Z"
    },
    {
      "number": 21,
      "summary": "Added a new route to fetch all courses from the database using a GET request.",
      "url": "https://github.com/terror/mcgill.courses/pull/21",
      "merged_at": "2023-03-19T19:48:23Z"
    },
    {
      "number": 17,
      "summary": "Switched the backend to use MongoDB instead of the previous database system. Improved testing coverage by adding more database tests and ensuring they run successfully in the CI pipeline.",
      "url": "https://github.com/terror/mcgill.courses/pull/17",
      "merged_at": "2023-03-19T18:59:14Z"
    },
    {
      "number": 15,
      "summary": "Improved the formatting and readability of the JSON output for course information. Added indentation and line breaks to make the data more organized and user-friendly.",
      "url": "https://github.com/terror/mcgill.courses/pull/15",
      "merged_at": "2023-03-18T17:25:06Z"
    },
    {
      "number": 13,
      "summary": "Added an example for extracting course data to the readme file. This change aims to help users understand how to extract information from the provided courses in a clear and efficient manner.",
      "url": "https://github.com/terror/mcgill.courses/pull/13",
      "merged_at": "2023-03-18T17:18:01Z"
    },
    {
      "number": 12,
      "summary": "Fixed an issue where unnecessary terms were being passed into the vsb client, streamlining the process and improving efficiency.",
      "url": "https://github.com/terror/mcgill.courses/pull/12",
      "merged_at": "2023-03-18T17:10:43Z"
    },
    {
      "number": 10,
      "summary": "Formatted the workflow file to improve readability and consistency.Resolved indentation issues and aligned code blocks for better organization.",
      "url": "https://github.com/terror/mcgill.courses/pull/10",
      "merged_at": "2023-03-17T23:29:50Z"
    },
    {
      "number": 9,
      "summary": "Implemented a continuous integration workflow for the backend codebase. This change ensures that code changes are automatically tested and validated before merging, improving code quality and reliability.",
      "url": "https://github.com/terror/mcgill.courses/pull/9",
      "merged_at": "2023-03-17T23:08:54Z"
    },
    {
      "number": 8,
      "summary": "Moved mocks from the main crate to the extractor crate for better code organization and maintainability.",
      "url": "https://github.com/terror/mcgill.courses/pull/8",
      "merged_at": "2023-03-17T22:46:21Z"
    },
    {
      "number": 7,
      "summary": "Updated the names of mocks to be more descriptive and less ambiguous. This change helps improve code readability and maintainability by clearly indicating the purpose of each mock in the project.",
      "url": "https://github.com/terror/mcgill.courses/pull/7",
      "merged_at": "2023-03-17T22:42:27Z"
    },
    {
      "number": 6,
      "summary": "Refactored the extraction code by implementing extension traits for improved organization and readability. This change streamlines the codebase and enhances maintainability for future development tasks.",
      "url": "https://github.com/terror/mcgill.courses/pull/6",
      "merged_at": "2023-03-17T22:35:08Z"
    },
    {
      "number": 5,
      "summary": "Moved model structs to the root of the crate for better organization and accessibility.",
      "url": "https://github.com/terror/mcgill.courses/pull/5",
      "merged_at": "2023-03-16T19:24:25Z"
    },
    {
      "number": 4,
      "summary": "Updated the code-statistics feature to exclude mock files, improving the accuracy of the generated metrics.",
      "url": "https://github.com/terror/mcgill.courses/pull/4",
      "merged_at": "2023-03-16T19:15:36Z"
    },
    {
      "number": 1,
      "summary": "Added support for scraping course scheduling information by updating the schema to include details such as course title, credits, instructors, department, and more. Also, separated out html parsing and models into individual crates.",
      "url": "https://github.com/terror/mcgill.courses/pull/1",
      "merged_at": "2023-03-16T19:11:21Z"
    }
  ],
  "January 2024": [
    {
      "number": 486,
      "summary": "Adjusted the position of the notification pane to be more towards the right side on the screen. This change provides a better user experience by improving visibility and accessibility of notifications.",
      "url": "https://github.com/terror/mcgill.courses/pull/486",
      "merged_at": "2024-01-02T04:48:33Z"
    },
    {
      "number": 487,
      "summary": "Updated the display image in the readme file to reflect the latest design changes.",
      "url": "https://github.com/terror/mcgill.courses/pull/487",
      "merged_at": "2024-01-02T04:39:10Z"
    },
    {
      "number": 482,
      "summary": "Improved the mobile display by adjusting various styling elements:\n- Fixed inconsistent margins on the explore page\n- Resolved overflow issues with long schedule rows\n- Prevented users from scrolling the page when the sidenav is open",
      "url": "https://github.com/terror/mcgill.courses/pull/482",
      "merged_at": "2024-01-02T04:38:02Z"
    },
    {
      "number": 483,
      "summary": "Improved the application by adding functionality to serve the Microsoft Identity Association file, which enhances the integration and authentication process for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/483",
      "merged_at": "2024-01-02T03:41:26Z"
    }
  ],
  "February 2024": [
    {
      "number": 488,
      "summary": "Improved efficiency by batching all review interactions from a single course into one request. This change replaces the previous method of sending multiple queries for each review card on a page. Now, a single request is made at the course level, streamlining the process. Each review's interactions are now retrieved from a new endpoint specific to a course, enhancing performance and user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/488",
      "merged_at": "2024-02-05T04:27:12Z"
    }
  ],
  "February 2025": [
    {
      "number": 633,
      "summary": "Added tests to ensure that the request retry feature works properly, improving the reliability of the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/633",
      "merged_at": "2025-02-02T00:23:01Z"
    },
    {
      "number": 632,
      "summary": "Implemented exponential backoff with jitter when retrying requests to improve the reliability and performance of the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/632",
      "merged_at": "2025-02-01T22:49:20Z"
    }
  ],
  "December 2024": [
    {
      "number": 618,
      "summary": "Consolidated various TypeScript declaration files in the client directory to improve organization and simplify maintenance.",
      "url": "https://github.com/terror/mcgill.courses/pull/618",
      "merged_at": "2024-12-22T20:05:12Z"
    },
    {
      "number": 617,
      "summary": "Added support for client-side unit testing by integrating Jest and React Testing Library to ensure code quality and reliability.",
      "url": "https://github.com/terror/mcgill.courses/pull/617",
      "merged_at": "2024-12-22T19:45:19Z"
    },
    {
      "number": 612,
      "summary": "Updated the course average data by incorporating additional grades. Special thanks to @atlasgong for their contribution.",
      "url": "https://github.com/terror/mcgill.courses/pull/612",
      "merged_at": "2024-12-21T01:24:29Z"
    },
    {
      "number": 615,
      "summary": "Improved the way we calculate time since events by providing more specific and user-friendly time descriptions. Now phrases like \"just now,\" \"1 minute ago,\" \"1 hour ago,\" etc. are used based on the time elapsed since an event.",
      "url": "https://github.com/terror/mcgill.courses/pull/615",
      "merged_at": "2024-12-20T16:35:16Z"
    },
    {
      "number": 613,
      "summary": "Removed the display of empty course CRNs to improve the user experience and prevent confusion for students.",
      "url": "https://github.com/terror/mcgill.courses/pull/613",
      "merged_at": "2024-12-20T15:55:37Z"
    },
    {
      "number": 610,
      "summary": "Updated search data parsing to include all historical school years, resolving an issue where only a single year of data was being indexed. As a result, the search functionality now includes information from previous school years. The file size has increased to approximately 20mb due to this change.",
      "url": "https://github.com/terror/mcgill.courses/pull/610",
      "merged_at": "2024-12-20T15:42:19Z"
    },
    {
      "number": 605,
      "summary": "Added functionality to update the course average data for S2024.",
      "url": "https://github.com/terror/mcgill.courses/pull/605",
      "merged_at": "2024-12-20T04:36:39Z"
    },
    {
      "number": 609,
      "summary": "Adjusted the background in dark mode for the notification dropdown to enhance the contrast with reviews.",
      "url": "https://github.com/terror/mcgill.courses/pull/609",
      "merged_at": "2024-12-19T16:21:56Z"
    },
    {
      "number": 608,
      "summary": "Re-scraped course data for the academic year 2024-2025 to ensure accuracy and completeness.",
      "url": "https://github.com/terror/mcgill.courses/pull/608",
      "merged_at": "2024-12-19T04:15:20Z"
    },
    {
      "number": 606,
      "summary": "Added functionality to differentiate scraped reviews by appending a unique identifier to each review.",
      "url": "https://github.com/terror/mcgill.courses/pull/606",
      "merged_at": "2024-12-18T18:34:13Z"
    }
  ],
  "May 2024": [
    {
      "number": 576,
      "summary": "Fixed an issue where the UI was displaying last year's instructors instead of the current ones. The change ensures that the explore page now shows the correct instructors for the current year, improving the user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/576",
      "merged_at": "2024-05-30T14:13:13Z"
    },
    {
      "number": 575,
      "summary": "Added functionality to scrape and display currently available 2024-2025 course information for users who are planning their courses in advance. This update ensures that users can access up-to-date information and prepares for future course selections.",
      "url": "https://github.com/terror/mcgill.courses/pull/575",
      "merged_at": "2024-05-24T19:34:30Z"
    },
    {
      "number": 574,
      "summary": "Added a changelog page and a tool to automatically generate changelog entries for merged PRs.",
      "url": "https://github.com/terror/mcgill.courses/pull/574",
      "merged_at": "2024-05-15T17:26:19Z"
    },
    {
      "number": 573,
      "summary": "Improved the readability of the header text on the reviews page for mobile users. Redesigned the layout to ensure that the text is properly displayed and easily readable on smaller screens. Tweaked the styling to enhance the overall user experience when viewing reviews on mobile devices.",
      "url": "https://github.com/terror/mcgill.courses/pull/573",
      "merged_at": "2024-05-13T22:11:02Z"
    },
    {
      "number": 572,
      "summary": "Added functionality to display the full list of instructors in course averages.",
      "url": "https://github.com/terror/mcgill.courses/pull/572",
      "merged_at": "2024-05-13T19:11:30Z"
    },
    {
      "number": 569,
      "summary": "Improved readability on the explore page for mobile users by increasing font size and spacing to prevent text overcrowding and allow for better user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/569",
      "merged_at": "2024-05-11T18:17:34Z"
    },
    {
      "number": 568,
      "summary": "Removed the click handler from course terms that do not have an instructor assigned. This change ensures that users cannot interact with terms that are incomplete, improving the overall user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/568",
      "merged_at": "2024-05-11T15:55:45Z"
    },
    {
      "number": 566,
      "summary": "Added support for displaying multiple instructors in course terms. This change allows users to view courses with more than one instructor assigned. To improve state management, the library `immer` was incorporated for effortless nested state updates. Key errors in various components have been rectified for a smoother user experience.",
      "url": "https://github.com/terror/mcgill.courses/pull/566",
      "merged_at": "2024-05-10T03:30:51Z"
    },
    {
      "number": 565,
      "summary": "Fixed the issue with an expired Discord link by updating it to the current valid link.",
      "url": "https://github.com/terror/mcgill.courses/pull/565",
      "merged_at": "2024-05-08T14:09:27Z"
    },
    {
      "number": 562,
      "summary": "Modified the restrictions text parsing to handle year-long courses correctly. This change ensures that courses with a duration spanning a year are accurately processed in the system.",
      "url": "https://github.com/terror/mcgill.courses/pull/562",
      "merged_at": "2024-05-06T01:59:21Z"
    },
    {
      "number": 559,
      "summary": "Aligned course averages with requirements box by adjusting the layout for better visibility and consistency. This change ensures that students can easily compare their grades with the necessary criteria.",
      "url": "https://github.com/terror/mcgill.courses/pull/559",
      "merged_at": "2024-05-05T19:30:53Z"
    },
    {
      "number": 558,
      "summary": "Added functionality to include links to course codes in the restrictions text, improving the user experience and making it easier for users to navigate and access course information.",
      "url": "https://github.com/terror/mcgill.courses/pull/558",
      "merged_at": "2024-05-05T19:30:37Z"
    },
    {
      "number": 557,
      "summary": "Added a standard SEO tag to the Home page to ensure Helmet switches back to `index.html` when revisiting the page.",
      "url": "https://github.com/terror/mcgill.courses/pull/557",
      "merged_at": "2024-05-05T01:12:25Z"
    },
    {
      "number": 555,
      "summary": "Added functionality to hide the \"Show All\" button on course averages when there are fewer than six grades present. This change improves the user experience by simplifying the interface for courses with limited grading data.",
      "url": "https://github.com/terror/mcgill.courses/pull/555",
      "merged_at": "2024-05-04T21:13:40Z"
    },
    {
      "number": 554,
      "summary": "Increased the z-index of the sidebar to prevent it from being obstructed by other elements on the page.",
      "url": "https://github.com/terror/mcgill.courses/pull/554",
      "merged_at": "2024-05-04T20:44:14Z"
    },
    {
      "number": 552,
      "summary": "Fixed the ordering of terms within the codebase. Made necessary changes to ensure correct sequence of terms is maintained.",
      "url": "https://github.com/terror/mcgill.courses/pull/552",
      "merged_at": "2024-05-04T16:57:41Z"
    },
    {
      "number": 547,
      "summary": "Added course averages feature using McGill Enhanced's crowdsourced sheet. The data is fetched via Google Sheets API and stored as a JSON file in `/assets`. Credits are mentioned within the Class Average component. The Json file will be periodically updated, approximately every month or two. This static asset was chosen over seeding in the database for easier maintenance by the project maintainers. This update aligns with McGill Enhanced's approach. The UI may still undergo further improvements in the future.",
      "url": "https://github.com/terror/mcgill.courses/pull/547",
      "merged_at": "2024-05-04T16:17:18Z"
    },
    {
      "number": 550,
      "summary": "Added SEO meta tags to improve the search engine visibility of all pages on the website.",
      "url": "https://github.com/terror/mcgill.courses/pull/550",
      "merged_at": "2024-05-04T15:06:26Z"
    },
    {
      "number": 551,
      "summary": "Updated the review page to round all four corners of the cards instead of just the bottom, addressing an issue related to tailwind styling.",
      "url": "https://github.com/terror/mcgill.courses/pull/551",
      "merged_at": "2024-05-04T14:52:26Z"
    },
    {
      "number": 548,
      "summary": "Implemented the use of the rust slim-buster docker image for production environments, reducing the size of the image and improving efficiency during deployment.",
      "url": "https://github.com/terror/mcgill.courses/pull/548",
      "merged_at": "2024-05-03T18:00:17Z"
    },
    {
      "number": 546,
      "summary": "Added functionality to scrape summer 2024 course schedules from university website. This change allows users to access and download course information for the upcoming summer semester.",
      "url": "https://github.com/terror/mcgill.courses/pull/546",
      "merged_at": "2024-05-03T16:29:54Z"
    }
  ],
  "November 2023": [
    {
      "number": 465,
      "summary": "Adjusted the explore filter text color to be more consistent with other page elements.",
      "url": "https://github.com/terror/mcgill.courses/pull/465",
      "merged_at": "2023-11-29T17:14:03Z"
    },
    {
      "number": 463,
      "summary": "Added a new schedule display feature with improved visuals, making it easier to view and manage course schedules.",
      "url": "https://github.com/terror/mcgill.courses/pull/463",
      "merged_at": "2023-11-28T05:36:14Z"
    },
    {
      "number": 461,
      "summary": "Added a dialog prompt to confirm subscription deletion. This change ensures users have a chance to confirm their action before permanently removing a subscription. This enhancement aims to prevent accidental deletion of important subscription data and improve user experience by adding an extra layer of protection.",
      "url": "https://github.com/terror/mcgill.courses/pull/461",
      "merged_at": "2023-11-17T20:03:12Z"
    },
    {
      "number": 460,
      "summary": "Updated the code to use the complete database URL stored in the environment variables, ensuring a seamless connection to the database without any manual configurations needed.",
      "url": "https://github.com/terror/mcgill.courses/pull/460",
      "merged_at": "2023-11-14T00:19:51Z"
    },
    {
      "number": 450,
      "summary": "Improved the review interaction filter by adding additional criteria for sorting and filtering review comments. This change enhances the overall user experience by providing more specific and relevant results when reviewing comments.",
      "url": "https://github.com/terror/mcgill.courses/pull/450",
      "merged_at": "2023-11-13T04:07:06Z"
    },
    {
      "number": 453,
      "summary": "Improved user experience by adding additional filters to the explore page, allowing users to easily search for specific items based on various criteria such as price, category, and popularity.",
      "url": "https://github.com/terror/mcgill.courses/pull/453",
      "merged_at": "2023-11-13T03:19:44Z"
    },
    {
      "number": 457,
      "summary": "Reduced the application's bundle size significantly by optimizing code and removing unused dependencies.",
      "url": "https://github.com/terror/mcgill.courses/pull/457",
      "merged_at": "2023-11-13T03:14:43Z"
    },
    {
      "number": 454,
      "summary": "Improved course search performance by implementing FlexSearch directly on the frontend, eliminating the need for backend requests. This change significantly speeds up the search process for users.",
      "url": "https://github.com/terror/mcgill.courses/pull/454",
      "merged_at": "2023-11-13T01:04:40Z"
    },
    {
      "number": 452,
      "summary": "Limited the word count on course descriptions displayed on the explore page to 400 characters for better readability and consistency.",
      "url": "https://github.com/terror/mcgill.courses/pull/452",
      "merged_at": "2023-11-09T04:09:17Z"
    }
  ]
}